[
  {
    "id": "8084960935",
    "receipt_id": "6NhqKMaYyiDRhHB13AoXp6T2br9FFn75W4dto6Pqd9Fq",
    "predecessor_account_id": "trechriron71.near",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "CHA78852D9PXwnCBZngUdjEqKnw21rtFtnTrTVUodMrU",
      "block_height": 127433868,
      "block_timestamp": 1725639909481832000
    },
    "receipt_outcome": {
      "gas_burnt": 6249212312422,
      "tokens_burnt": 624921231242200000000,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "F4tC5otE14oWNy7RGEXgQSMy5DWZrGVvwHnKiMR8JTxE",
    "included_in_block_hash": "JD4smERLvpwNknWVqxyNQe4HbjYyCkyFQGKUSL569tVN",
    "block_timestamp": "1725639908154956354",
    "block": {
      "block_height": 127433867
    },
    "receipt_conversion_tokens_burnt": "77144984237000000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "edit_proposal",
        "deposit": 0,
        "fee": 624921231242200000000,
        "args": "{\"id\": 8, \"body\": {\"name\": \"GetBlock Explorer for NEAR \\\\\\\\u{2013} Maintenance and Cross-chain Functionality\", \"summary\": \"Since Q1, 2022, we have been supporting GetBlock Explorer for NEAR and the Explorer API to enable any developer to quickly access data and easily develop their DApps. Our ultimate goal is to develop an explorer with cross-chain functionality. We believe that every user should be able to assess their portfolio composition and track asset movements within a unified interface of our explorer.\\\\\\\\n\", \"category\": \"Infrastructure Committee\", \"timeline\": {\"status\": \"REJECTED\", \"sponsor_requested_review\": false, \"reviewer_completed_attestation\": false}, \"linked_rfp\": null, \"supervisor\": \"trechriron71.near\", \"description\": \"### Organization  \\\\\\\\nGetBlock \\\\\\\\n### Primary person\\\\\\\\u{2019}s contact information\\\\\\\\nNataly Lahuti\\\\\\\\nEmail: nataly@getblock.io\\\\\\\\nTG: @ GetBlock_tg\\\\\\\\n\\\\\\\\n### Size of the whole team\\\\\\\\nMore than 40 people\\\\\\\\n\\\\\\\\n### Size of the engineering team\\\\\\\\nMore than 20 people\\\\\\\\n\\\\\\\\n### Any affiliations with other NEAR ecosystem partners?\\\\\\\\nDevelopment of the NEAR blockchain explorer as part of a grant in Q1, 2022\\\\\\\\nWe have been also working and collaborating with such NEAR-focused projects as Aurora, Near Zombies, Learn Near Club etc.\\\\\\\\n\\\\\\\\n## Professional Experience\\\\\\\\nLaunched in Q4, 2019, GetBlock is a Blockchain-as-a-Service (BaaS)platform that provides instant API access to full nodes from 50+ blockchain protocols on mainnet and testnet including NEAR.\\\\\\\\nAdditionally, the GetBlock team specializes in building customized explorers tailored for various blockchains and dApps.\\\\\\\\nWe aim at building user-friendly blockchain explorers in an app-like modern interface. We want to build a tool for the entire community that will facilitate on-chain data and high-end analytics in an easy-to-read and to-understand format fit for both newbies and crypto-savvy individuals.\\\\\\\\n\\\\\\\\n### Examples of relevant experience with NEAR blockchain\\\\\\\\nWe support the dedicated and shared RPC node infrastructure for NEAR so that all the ecosystem developers and projects can quickly access the NEAR network without setting up their own infrastructure.\\\\\\\\nGetBlock has been providing RPCs for NEAR since Q1 2022 and has achieved and provides service reliability of 99.9% for Q2 2024. The duplicate NEAR nodes setup and the automatic failover system ensure the stability of the NEAR node. In case of a node failure incident or during the NEAR mainnet upgrade period, the automatic failover system directs users\\\\\\\\\\\\' requests to a backup node, ensuring continuous network operation.\\\\\\\\n\\\\\\\\nWe have developed and maintained the Near Explorer for 2 years, as well as the Near Explorer API.\\\\\\\\n\\\\\\\\n### Non-technical capabilities:\\\\\\\\n* Partnerships with major blockchains to support infrastructure. \\\\\\\\n* Built-in marketplace that highlights important projects in the Web3 industry.\\\\\\\\n* Our clients are leading developers in building ecosystems on blockchains such as TON, Solana, Ethereum, BSC, and others (Trust Wallet, Elliptic, Chainlink, etc.).\\\\\\\\n* Providing tutorials, webinars, and documentation to help users master blockchain technologies and GetBlock services.\\\\\\\\n* Making strategic alliances with tech firms, blockchain projects, and educational institutions to expand services and reach.\\\\\\\\n* Actively engaging with blockchain and developer communities via forums, social media, and events\\\\\\\\n\\\\\\\\n### In-House Resources;\\\\\\\\nWe have a highly experienced team of DevOps and Backend Developers working on the deployment and maintenance of the node infrastructure. Each team members\\\\\\\\u{2019} experience ranges from 3 up to 10 years in the development field, most of which are years closely related to blockchain development.\\\\\\\\n\\\\\\\\n* (Design, UX/UI?) - Yes\\\\\\\\n* (Project management?) - Yes\\\\\\\\n* (Customer support?) - Yes\\\\\\\\n* (BD / Marketing?) - Yes\\\\\\\\n\\\\\\\\n### Portfolio of relevant work\\\\\\\\n* [GetBlock Explorer ](https://getblock.io/explorers/) is our primary project, which we support and aim to develop as a multi-chain explorer. Currently, we support 4 blockchains.\\\\\\\\n* [Faucet](https://getblock.io/faucet/) is a project where we help developers obtain test tokens for free to test their applications and smart contracts. ETH Sepolia and MATIC Amaoy are available for 9 different protocols.\\\\\\\\n* [Marketplace](https://getblock.io/marketplace/) is a project for publishing popular and completely new Web3 applications. It helps users discover the advantages of these applications and quickly compare them with one another.\\\\\\\\n\\\\\\\\n## Proposal\\\\\\\\n\\\\\\\\nCurrently, alongside our explorer, there are two other explorers for NEAR: Nearblocks and Pikespeak. Both have proven functionality, and we believe it is wise to build upon it. We are focused on improving the user interface and UX, and we also believe that data completeness can be a decisive factor in the adoption of our solution.\\\\\\\\n\\\\\\\\nAt present, we are conducting interviews with the blockchain\\\\\\\\\\\\'s custdev community to assess specific issues and needs related to the use of explorers. This will help better define the product-market fit of GetBlock Explorer for NEAR. We aim to address these issues in the development of our product and are very open to any ideas you might have regarding suggestions and requirements from the NEAR community that could be applied to the explorer.\\\\\\\\n\\\\\\\\nSince Q1, 2022, we have been supporting GetBlock Explorer for NEAR and the Explorer API to enable any developer to quickly access data and easily develop their DApps.\\\\\\\\nOur ultimate goal is to develop an explorer with cross-chain functionality. We believe that every user should be able to assess their portfolio composition and track asset movements within a unified interface of our explorer.\\\\\\\\nWe support and plan to enhance our Explorer API source code. The documentation can be accessed [here](https://getblock.io/docs/getblock-explorer/get-started/).\\\\\\\\n\\\\\\\\n### Target audience\\\\\\\\nThe target audience is basically anyone in the NEAR community who may need to check on transactions, stats, blocks, etc.\\\\\\\\n\\\\\\\\n## Goals / Milestones\\\\\\\\nOur primary goal is to create an ecosystem for NEAR users and developers where they can access all the necessary information in real-time. Currently, we are experiencing increased demand on our infrastructure. To develop and maintain our public infrastructure, we need to scale up our capacity.\\\\\\\\n\\\\\\\\n**Databases:**\\\\\\\\n* As part of this project, we will test the concept of using Cassandra and ClickHouse in comparison with PostgreSQL and choose the most productive and efficient solution.\\\\\\\\n* After the comparison, we will implement one of the best practices with optimal blockchain data processing and cost reduction. Work stages include:\\\\\\\\n - Developing the system architecture based on the chosen solution (Cassandra, ClickHouse, or PostgreSQL).\\\\\\\\n - Transferring existing data to the new system.\\\\\\\\n- Restructuring data for maximum performance and efficiency.\\\\\\\\n- Creating and optimizing extraction, transformation, and loading processes.\\\\\\\\n-  Setting up system performance monitoring, regular optimization, and database parameter tuning.\\\\\\\\n\\\\\\\\n**Cost Reduction of Hosts:**\\\\\\\\n* Reevaluate the operation of the explorer to reduce host costs. This is necessary for product scaling and adding new features.\\\\\\\\n\\\\\\\\n**Addition and support of third-party protocols:**\\\\\\\\n* Solana\\\\\\\\n* Tron\\\\\\\\n* Polygon\\\\\\\\n* etc.\\\\\\\\n\\\\\\\\n**Adding New Features:**\\\\\\\\n* Token viewing\\\\\\\\n* Token transfer\\\\\\\\n* NFT viewing\\\\\\\\n* NFT transfer\\\\\\\\n\\\\\\\\n**Marketing Support:**\\\\\\\\n* Provide marketing support for projects built on or using the NEAR blockchain (social media announcements, blog posts, marketplace, interviews and AMAs, etc).\\\\\\\\n* GetBlock is eager to support the NEAR  ecosystem and drive further attention to its infrastructure. One way to achieve this is by providing a technical sponsorship for the hackathons organized or sponsored by NEAR. One of the critical components for a successful hackathon is providing the necessary infrastructure for developers to build and test their projects. GetBlock is offering to allocate NEAR nodes with unlimited RPC requests for all hackathon participants, which will allow them to save time and focus on building their projects and developing skills.\\\\\\\\n \\\\\\\\n## Metrics\\\\\\\\nThe key success metrics we highlight are:\\\\\\\\n* Total of unique users\\\\\\\\n* User retention\\\\\\\\nWe believe these metrics will help increase the user base of NEAR and highlight the best projects within the ecosystem.\\\\\\\\n\\\\\\\\nA detailed roadmap will be created for all stages. Each release will be accompanied by a marketing announcement. NEAR will receive continuous updates as GetBlock adds new functionality/protocols.\\\\\\\\n\\\\\\\\n## Competitor Comparison\\\\\\\\nWe identify several segments among our competitors:\\\\\\\\n1. Explorers built exclusively for NEAR\\\\\\\\n* https://nearblocks.io/ru/address/trader-near.near\\\\\\\\n* https://pikespeak.ai/\\\\\\\\n2. Explorers for other protocols or multi-chain applications\\\\\\\\n* https://blockchair.com/\\\\\\\\n* https://www.oklink.com/\\\\\\\\n* https://etherscan.io/\\\\\\\\n* https://tronscan.org\\\\\\\\n\\\\\\\\n### Budget Total\\\\\\\\n$180,000/year\\\\\\\\n\\\\\\\\n### Budget Breakdown\\\\\\\\nTo maintain the infrastructure, providing R&D, we are asking for $15,000/month. This amount will cover:\\\\\\\\n* Payment of current infrastructure expenses\\\\\\\\n* Work on updating the current database\\\\\\\\n* Development stages for adding new features (once every 2-3 months)\\\\\\\\n* Human resources\\\\\\\\n* Marketing\\\\\\\\nIn the future, we hope to reduce infrastructure costs and maintain it with a budget of up to $4,000/month.\\\\\\\\n\\\\\\\\nP.S. The addition of new protocols is not included in the cost and will be carried out by our own efforts.\\\\\\\\n\", \"linked_proposals\": [], \"receiver_account\": \"getblock.near\", \"requested_sponsor\": \"infrastructure-committee.near\", \"proposal_body_version\": \"V1\", \"requested_sponsorship_usd_amount\": \"180000\", \"requested_sponsorship_paid_in_currency\": \"USDT\"}, \"labels\": [\"Explorers\"]}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.0531112087339e+21
    }
  },
  {
    "id": "8084962249",
    "receipt_id": "3nJ5gSgqesoeitHE8dGDhohtj7RicEQGadjeDz9Vk7gM",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "social.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "68734nyJpJMapH9Nnq32cMZ2JbzKrhNHDqfmeebdu7P2",
      "block_height": 127433869,
      "block_timestamp": 1725639910815438600
    },
    "receipt_outcome": {
      "gas_burnt": 3510449932547,
      "tokens_burnt": 351044993254700000000,
      "executor_account_id": "social.near",
      "status": true
    },
    "transaction_hash": "F4tC5otE14oWNy7RGEXgQSMy5DWZrGVvwHnKiMR8JTxE",
    "included_in_block_hash": "JD4smERLvpwNknWVqxyNQe4HbjYyCkyFQGKUSL569tVN",
    "block_timestamp": "1725639908154956354",
    "block": {
      "block_height": 127433867
    },
    "receipt_conversion_tokens_burnt": "77144984237000000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set",
        "deposit": 0,
        "fee": 351044993254700000000,
        "args": "{\"data\": {\"infrastructure-committee.near\": {\"index\": {\"notify\": \"{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"getblock.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"proposal/edit\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"proposal\\\\\\\\\\\\\\\":8,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"trechriron71.near\\\\\\\\\\\\\\\"}}\"}}}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.0531112087339e+21
    }
  },
  {
    "id": "8111357791",
    "receipt_id": "BsavB5VEQTFGh1VryvoL3JLmCkSN78peWox539psa3HB",
    "predecessor_account_id": "0xalxx.near",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "Eh5nVaUBYdmP8ptCVjYsSSWb9MMRyKhNZkDCWxoKMzkJ",
      "block_height": 127497340,
      "block_timestamp": 1725711607855240000
    },
    "receipt_outcome": {
      "gas_burnt": 6536569739439,
      "tokens_burnt": 653656973943900000000,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "ChiWT7LFVPJx9oY3wuWsGLpf2Y17RqVyyRvy9apMtPZA",
    "included_in_block_hash": "7xoS18mZcyxtkmap8ZMt7MnbujQ1zLADTAVf58iyMfSa",
    "block_timestamp": "1725711606718428236",
    "block": {
      "block_height": 127497339
    },
    "receipt_conversion_tokens_burnt": "62382106073000000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "add_proposal",
        "deposit": 0,
        "fee": 653656973943900000000,
        "args": "{\"body\": {\"name\": \"Aeon: permissionless multi-sig for NEAR\", \"summary\": \"At Aeon, we\\\\\\\\\\\\'re building the first multi-chain multi-sig for custody of any asset on any chain. We use decentralized MPC, enable permissionless onboarding of chains and DeFi services, and offer sophisticated transaction policies down to the payload level. Our vision: become the hub for multi-chain DeFi and provide an AI agent marketplace for outsourcing work like reporting, trading strategies, and risk management.\", \"category\": \"Infrastructure Committee\", \"timeline\": {\"status\": \"DRAFT\"}, \"description\": \"### Primary person\\\\\\\\u{2019}s contact information\\\\\\\\nJustin Heinz(justin@aeon.so)\\\\\\\\n\\\\\\\\n### Size of the whole team\\\\\\\\n4\\\\\\\\n\\\\\\\\n### Size of the engineering team\\\\\\\\n3 (+2 starting in Q4)\\\\\\\\n\\\\\\\\n### Team location\\\\\\\\nLisbon, Portugal\\\\\\\\n\\\\\\\\n\\\\\\\\n### Team background and bios\\\\\\\\n\\\\\\\\n* Justin - Co-Founder (https://www.linkedin.com/in/justin-alexander-heinz/, https://github.com/fl0ydj): studied at Cambridge, worked at Amazon, built wallet for Outlet finance; prev. founder experience\\\\\\\\n* Alex - Co-Founder (https://www.linkedin.com/in/alexander-ludwig-profile/, https://github.com/alexanderludwig): start-up experience in data science; VC for EQT ventures\\\\\\\\n* Parshant - Founding Engineer (https://www.linkedin.com/in/psm21/, https://github.com/singhparshant): IIIT Allahabad/ TUM, Goldman Sachs; MPC research at UCL\\\\\\\\n* + 2 engineers starting in Q4\\\\\\\\n* + freelance designer\\\\\\\\n\\\\\\\\n\\\\\\\\n### Product / Value Proposition\\\\\\\\n\\\\\\\\nBuilding a trustless and permissionless multi-sig for the Near ecosystem, to make it easier for sophisticated investors to hold tokens and interact with Near\\\\\\\\u{2019}s DeFi protocols.\\\\\\\\nProduct demo: https://www.loom.com/share/270c39a0d9044d59b555dfa04a24e501\\\\\\\\n* Allowing trustless custody of any asset on any chain by leveraging dWallet network\\\\\\\\\\\\'s decentralized & non-collusive MPC. (Find more details here: https://github.com/dwallet-labs/dwallet-network, https://eprint.iacr.org/2024/253.pdf)\\\\\\\\n* Permissionless onboarding of new chains, so ecosystems can onboard themselves in a self-service manner. Existing ecosystem integrations include Bitcoin, EVM, Cosmos, Sui, and Fuel.\\\\\\\\nOffers sophisticated transaction policies down to the payload level (e.g., allowing limits on swapping, lending, and borrowing amounts) and other features like user management, address book, and trustless recovery (with a Ledger).\\\\\\\\n* Access dApps through our dApp store ecosystem in a secure manner, safeguarded by our policy engine.\\\\\\\\nInstitutional-grade security, with part of the key secured by dWallet\\\\\\\\\\\\'s decentralized MPC network and the other part by our mobile signing app using the mobile phone\\\\\\\\\\\\'s secure enclave.\\\\\\\\n* Integration of chain abstraction and chain-abstracted DeFi services into our product.\\\\\\\\n* Product vision: Become a platform for AI agents that users can hire to execute tasks for them, such as executing sophisticated trading strategies (e.g., going long on revenue-generating DeFi projects, shorting infrastructure projects), and advising users on proper risk management techniques. Here we see synergies with NEAR\\\\\\\\\\\\'s strategy and hence would want to integrate such projects and work closely together with them.\\\\\\\\n\\\\\\\\n### Benefits for the NEAR ecosystem\\\\\\\\n* Integration of NEAR into a multi-chain custody solution with policy engine support (NEAR token holders can restrict sender, receiver, and amount of assets being transferred). This increases accessibility of NEAR assets for institutional and sophisticated investors (market makers, liquid/venture funds, sophisticated teams/individuals) to hold assets. The product will be gradually made open-source over the next years.\\\\\\\\n* Integration of NEAR multi-chain DeFi projects to be used directly by sophisticated investors from within our product (e.g., swapping and lending).\\\\\\\\n* Integration of NEAR AI agents into our platform to offer our customers services provided by these agents.\\\\\\\\n\\\\\\\\n### Goals / Milestones\\\\\\\\n\\\\\\\\n**NEAR integration (Target: Q4 2024)**\\\\\\\\n* Dependent on dWallet network, anticipated mainnet launch in Q4 2024\\\\\\\\n* Integration of the NEAR RPC API into our chain integration SDK to communicate with and read transactions from the NEAR blockchain\\\\\\\\n* Completion of security audits for our core smart contracts and the NEAR transaction assembling module (written in Move)\\\\\\\\n**dApp integration (Q1 2025)**\\\\\\\\n* Integration of NEAR ecosystems into our integrated dApp store (as described here: https://x.com/ilblackdragon/status/1821933128799211618)\\\\\\\\n* Incorporation of the NEAR wallet selector into our multi-chain extension framework\\\\\\\\n \\\\\\\\n### Metrics\\\\\\\\n**Milestone 1: NEAR integration**\\\\\\\\n* Users can hold assets on NEAR and execute transfers of the NEAR native asset, NEP-141 fungible token standard, and NEP-171 non-fungible token standard.\\\\\\\\n**Milestone 2: dApp integration**\\\\\\\\n* Users can natively use the top 10 NEAR dApps through our dApp interface.\\\\\\\\n\\\\\\\\n\\\\\\\\n### Competitor Comparison\\\\\\\\n\\\\\\\\n** Alternatives:**\\\\\\\\n* On-chain multi-sigs (e.g., Gnosis Safe, Squads): Suffer from fragmentation across chains and lack support for non-smart contract chains. However, for NEAR, there is no native multi-sig available offering the same features as Aeon does.\\\\\\\\n* MPC-based institutional custody players (e.g., Fireblocks): Slow to innovate, permissioned, closed source, not built from the ground up for DeFi interactions, and expensive.\\\\\\\\n**Our Advantages:**\\\\\\\\n* Built for DeFi & AI agents: Manage all your positions within our platform.\\\\\\\\n* Ability to hire AI agents constrained by the policy engine built for DeFi.\\\\\\\\n* Institutional-grade security: Truly decentralized and censorship-resistant. Transactions are cosigned by the user\\\\\\\\\\\\'s mobile phone enclave and a decentralized network.\\\\\\\\n\\\\\\\\n### Usage & Examples\\\\\\\\n\\\\\\\\nCurrent testnet launch with 10 investors testing our product. Integration with BTC, EVM, Cosmos, Sui, Fuel integration. See product demo above.\\\\\\\\n\\\\\\\\n\\\\\\\\n## Budget\\\\\\\\n\\\\\\\\n### Budget Total\\\\\\\\n\\\\\\\\n$62k\\\\\\\\n\\\\\\\\n### Budget Breakdown\\\\\\\\n\\\\\\\\n**Milestone 1: Near integration $41k**\\\\\\\\n* Engineering costs smart contract signing module in Move: $14k\\\\\\\\n* Smart contract audits: $8k\\\\\\\\n* Integration into Aeon chain SDK abstracting Near RPC: $11k\\\\\\\\n* Setting up and maintaining subquery indexer: $8k\\\\\\\\n** Milestone 2: dApp integration $21k **\\\\\\\\n* Javascript extension injection flow enabling dApps to connect with Aeon using the Near wallet selector $12k\\\\\\\\n* Extend Aeon chain SDK to support Near dApp request processing $9k\\\\\\\\n\", \"linked_proposals\": [], \"receiver_account\": \"0xalxx.near\", \"requested_sponsor\": \"infrastructure-committee.near\", \"proposal_body_version\": \"V1\", \"requested_sponsorship_usd_amount\": \"62\", \"requested_sponsorship_paid_in_currency\": \"USDC\"}, \"labels\": [\"Other\"]}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.8961772296169e+21
    }
  },
  {
    "id": "8111358153",
    "receipt_id": "BNA1gHgACxGgPwtGjZepqarvGzbomxF6UMC28rSGAPBM",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "social.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "4yDUjLE1Lh7shxUc6zkHrQCpNV69z2w1kLtcyRmGrtEk",
      "block_height": 127497341,
      "block_timestamp": 1725711609026675200
    },
    "receipt_outcome": {
      "gas_burnt": 4525202280794,
      "tokens_burnt": 452520228079400000000,
      "executor_account_id": "social.near",
      "status": true
    },
    "transaction_hash": "ChiWT7LFVPJx9oY3wuWsGLpf2Y17RqVyyRvy9apMtPZA",
    "included_in_block_hash": "7xoS18mZcyxtkmap8ZMt7MnbujQ1zLADTAVf58iyMfSa",
    "block_timestamp": "1725711606718428236",
    "block": {
      "block_height": 127497339
    },
    "receipt_conversion_tokens_burnt": "62382106073000000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set",
        "deposit": 0,
        "fee": 452520228079400000000,
        "args": "{\"data\": {\"infrastructure-committee.near\": {\"post\": {\"main\": \"{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"md\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"text\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"We have just received a new *Infrastructure Committee* proposal.\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\n\\\\\\\\u{2014}\\\\\\\\u{2014}\\\\\\\\u{2014}\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\n**By**: @0xalxx.near\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\n**Title**: \\\\\\\\u{201c}Aeon: permissionless multi-sig for NEAR\\\\\\\\u{201c}\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\n**Summary**:\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\nAt Aeon, we\\\\\\\\\\\\'re building the first multi-chain multi-sig for custody of any asset on any chain. We use decentralized MPC, enable permissionless onboarding of chains and DeFi services, and offer sophisticated transaction policies down to the payload level. Our vision: become the hub for multi-chain DeFi and provide an AI agent marketplace for outsourcing work like reporting, trading strategies, and risk management.\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\n\\\\\\\\u{2014}\\\\\\\\u{2014}\\\\\\\\u{2014}\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\nRead the full proposal and share your feedback on [DevHub](/devhub.near/widget/app?page=proposal&id=16)\\\\\\\\\\\\\\\"}\"}, \"index\": {\"post\": \"{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"main\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"md\\\\\\\\\\\\\\\"}}\"}}}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.8961772296169e+21
    }
  },
  {
    "id": "8111358160",
    "receipt_id": "DMo2AfdcUDUuuHVmPzZmWVUXFYRq2T18XTz2rm4vc5RY",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "4yDUjLE1Lh7shxUc6zkHrQCpNV69z2w1kLtcyRmGrtEk",
      "block_height": 127497341,
      "block_timestamp": 1725711609026675200
    },
    "receipt_outcome": {
      "gas_burnt": 3738508923777,
      "tokens_burnt": 373850892377700000000,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "ChiWT7LFVPJx9oY3wuWsGLpf2Y17RqVyyRvy9apMtPZA",
    "included_in_block_hash": "7xoS18mZcyxtkmap8ZMt7MnbujQ1zLADTAVf58iyMfSa",
    "block_timestamp": "1725711606718428236",
    "block": {
      "block_height": 127497339
    },
    "receipt_conversion_tokens_burnt": "62382106073000000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set_block_height_callback",
        "deposit": 0,
        "fee": 373850892377700000000,
        "args": "{\"proposal\": {\"id\": 16, \"snapshot\": {\"name\": \"Aeon: permissionless multi-sig for NEAR\", \"labels\": [\"Other\"], \"summary\": \"At Aeon, we\\\\\\\\\\\\'re building the first multi-chain multi-sig for custody of any asset on any chain. We use decentralized MPC, enable permissionless onboarding of chains and DeFi services, and offer sophisticated transaction policies down to the payload level. Our vision: become the hub for multi-chain DeFi and provide an AI agent marketplace for outsourcing work like reporting, trading strategies, and risk management.\", \"category\": \"Infrastructure Committee\", \"timeline\": {\"status\": \"DRAFT\"}, \"editor_id\": \"0xalxx.near\", \"timestamp\": \"1725711607855239928\", \"linked_rfp\": null, \"supervisor\": null, \"description\": \"### Primary person\\\\\\\\u{2019}s contact information\\\\\\\\nJustin Heinz(justin@aeon.so)\\\\\\\\n\\\\\\\\n### Size of the whole team\\\\\\\\n4\\\\\\\\n\\\\\\\\n### Size of the engineering team\\\\\\\\n3 (+2 starting in Q4)\\\\\\\\n\\\\\\\\n### Team location\\\\\\\\nLisbon, Portugal\\\\\\\\n\\\\\\\\n\\\\\\\\n### Team background and bios\\\\\\\\n\\\\\\\\n* Justin - Co-Founder (https://www.linkedin.com/in/justin-alexander-heinz/, https://github.com/fl0ydj): studied at Cambridge, worked at Amazon, built wallet for Outlet finance; prev. founder experience\\\\\\\\n* Alex - Co-Founder (https://www.linkedin.com/in/alexander-ludwig-profile/, https://github.com/alexanderludwig): start-up experience in data science; VC for EQT ventures\\\\\\\\n* Parshant - Founding Engineer (https://www.linkedin.com/in/psm21/, https://github.com/singhparshant): IIIT Allahabad/ TUM, Goldman Sachs; MPC research at UCL\\\\\\\\n* + 2 engineers starting in Q4\\\\\\\\n* + freelance designer\\\\\\\\n\\\\\\\\n\\\\\\\\n### Product / Value Proposition\\\\\\\\n\\\\\\\\nBuilding a trustless and permissionless multi-sig for the Near ecosystem, to make it easier for sophisticated investors to hold tokens and interact with Near\\\\\\\\u{2019}s DeFi protocols.\\\\\\\\nProduct demo: https://www.loom.com/share/270c39a0d9044d59b555dfa04a24e501\\\\\\\\n* Allowing trustless custody of any asset on any chain by leveraging dWallet network\\\\\\\\\\\\'s decentralized & non-collusive MPC. (Find more details here: https://github.com/dwallet-labs/dwallet-network, https://eprint.iacr.org/2024/253.pdf)\\\\\\\\n* Permissionless onboarding of new chains, so ecosystems can onboard themselves in a self-service manner. Existing ecosystem integrations include Bitcoin, EVM, Cosmos, Sui, and Fuel.\\\\\\\\nOffers sophisticated transaction policies down to the payload level (e.g., allowing limits on swapping, lending, and borrowing amounts) and other features like user management, address book, and trustless recovery (with a Ledger).\\\\\\\\n* Access dApps through our dApp store ecosystem in a secure manner, safeguarded by our policy engine.\\\\\\\\nInstitutional-grade security, with part of the key secured by dWallet\\\\\\\\\\\\'s decentralized MPC network and the other part by our mobile signing app using the mobile phone\\\\\\\\\\\\'s secure enclave.\\\\\\\\n* Integration of chain abstraction and chain-abstracted DeFi services into our product.\\\\\\\\n* Product vision: Become a platform for AI agents that users can hire to execute tasks for them, such as executing sophisticated trading strategies (e.g., going long on revenue-generating DeFi projects, shorting infrastructure projects), and advising users on proper risk management techniques. Here we see synergies with NEAR\\\\\\\\\\\\'s strategy and hence would want to integrate such projects and work closely together with them.\\\\\\\\n\\\\\\\\n### Benefits for the NEAR ecosystem\\\\\\\\n* Integration of NEAR into a multi-chain custody solution with policy engine support (NEAR token holders can restrict sender, receiver, and amount of assets being transferred). This increases accessibility of NEAR assets for institutional and sophisticated investors (market makers, liquid/venture funds, sophisticated teams/individuals) to hold assets. The product will be gradually made open-source over the next years.\\\\\\\\n* Integration of NEAR multi-chain DeFi projects to be used directly by sophisticated investors from within our product (e.g., swapping and lending).\\\\\\\\n* Integration of NEAR AI agents into our platform to offer our customers services provided by these agents.\\\\\\\\n\\\\\\\\n### Goals / Milestones\\\\\\\\n\\\\\\\\n**NEAR integration (Target: Q4 2024)**\\\\\\\\n* Dependent on dWallet network, anticipated mainnet launch in Q4 2024\\\\\\\\n* Integration of the NEAR RPC API into our chain integration SDK to communicate with and read transactions from the NEAR blockchain\\\\\\\\n* Completion of security audits for our core smart contracts and the NEAR transaction assembling module (written in Move)\\\\\\\\n**dApp integration (Q1 2025)**\\\\\\\\n* Integration of NEAR ecosystems into our integrated dApp store (as described here: https://x.com/ilblackdragon/status/1821933128799211618)\\\\\\\\n* Incorporation of the NEAR wallet selector into our multi-chain extension framework\\\\\\\\n \\\\\\\\n### Metrics\\\\\\\\n**Milestone 1: NEAR integration**\\\\\\\\n* Users can hold assets on NEAR and execute transfers of the NEAR native asset, NEP-141 fungible token standard, and NEP-171 non-fungible token standard.\\\\\\\\n**Milestone 2: dApp integration**\\\\\\\\n* Users can natively use the top 10 NEAR dApps through our dApp interface.\\\\\\\\n\\\\\\\\n\\\\\\\\n### Competitor Comparison\\\\\\\\n\\\\\\\\n** Alternatives:**\\\\\\\\n* On-chain multi-sigs (e.g., Gnosis Safe, Squads): Suffer from fragmentation across chains and lack support for non-smart contract chains. However, for NEAR, there is no native multi-sig available offering the same features as Aeon does.\\\\\\\\n* MPC-based institutional custody players (e.g., Fireblocks): Slow to innovate, permissioned, closed source, not built from the ground up for DeFi interactions, and expensive.\\\\\\\\n**Our Advantages:**\\\\\\\\n* Built for DeFi & AI agents: Manage all your positions within our platform.\\\\\\\\n* Ability to hire AI agents constrained by the policy engine built for DeFi.\\\\\\\\n* Institutional-grade security: Truly decentralized and censorship-resistant. Transactions are cosigned by the user\\\\\\\\\\\\'s mobile phone enclave and a decentralized network.\\\\\\\\n\\\\\\\\n### Usage & Examples\\\\\\\\n\\\\\\\\nCurrent testnet launch with 10 investors testing our product. Integration with BTC, EVM, Cosmos, Sui, Fuel integration. See product demo above.\\\\\\\\n\\\\\\\\n\\\\\\\\n## Budget\\\\\\\\n\\\\\\\\n### Budget Total\\\\\\\\n\\\\\\\\n$62k\\\\\\\\n\\\\\\\\n### Budget Breakdown\\\\\\\\n\\\\\\\\n**Milestone 1: Near integration $41k**\\\\\\\\n* Engineering costs smart contract signing module in Move: $14k\\\\\\\\n* Smart contract audits: $8k\\\\\\\\n* Integration into Aeon chain SDK abstracting Near RPC: $11k\\\\\\\\n* Setting up and maintaining subquery indexer: $8k\\\\\\\\n** Milestone 2: dApp integration $21k **\\\\\\\\n* Javascript extension injection flow enabling dApps to connect with Aeon using the Near wallet selector $12k\\\\\\\\n* Extend Aeon chain SDK to support Near dApp request processing $9k\\\\\\\\n\", \"linked_proposals\": [], \"receiver_account\": \"0xalxx.near\", \"requested_sponsor\": \"infrastructure-committee.near\", \"proposal_body_version\": \"V1\", \"requested_sponsorship_usd_amount\": \"62\", \"requested_sponsorship_paid_in_currency\": \"USDC\"}, \"author_id\": \"0xalxx.near\", \"snapshot_history\": [], \"social_db_post_block_height\": \"0\"}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.8961772296169e+21
    }
  },
  {
    "id": "8111358162",
    "receipt_id": "3p5T3MY7ozwb88zgbpbYfHWxmXApTyhEMhumJp6Dwt4M",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "social.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "4yDUjLE1Lh7shxUc6zkHrQCpNV69z2w1kLtcyRmGrtEk",
      "block_height": 127497341,
      "block_timestamp": 1725711609026675200
    },
    "receipt_outcome": {
      "gas_burnt": 3537670291429,
      "tokens_burnt": 353767029142900000000,
      "executor_account_id": "social.near",
      "status": true
    },
    "transaction_hash": "ChiWT7LFVPJx9oY3wuWsGLpf2Y17RqVyyRvy9apMtPZA",
    "included_in_block_hash": "7xoS18mZcyxtkmap8ZMt7MnbujQ1zLADTAVf58iyMfSa",
    "block_timestamp": "1725711606718428236",
    "block": {
      "block_height": 127497339
    },
    "receipt_conversion_tokens_burnt": "62382106073000000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set",
        "deposit": 0,
        "fee": 353767029142900000000,
        "args": "{\"data\": {\"infrastructure-committee.near\": {\"index\": {\"notify\": \"[{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"aeon.so\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"proposal/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"proposal\\\\\\\\\\\\\\\":16,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"0xalxx.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"proposal/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"proposal\\\\\\\\\\\\\\\":16,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"0xalxx.near\\\\\\\\\\\\\\\"}}]\"}}}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.8961772296169e+21
    }
  },
  {
    "id": "8112674919",
    "receipt_id": "14mPuij5Q6H4481dQqo4R8jch3jiiaYyfawhmjDwMuMj",
    "predecessor_account_id": "0xalxx.near",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "9ctmKxsNFLzdoVB3BDjkMP7xh4qEUSKQWcEEaRP279SB",
      "block_height": 127500261,
      "block_timestamp": 1725714866374960000
    },
    "receipt_outcome": {
      "gas_burnt": 5443871491566,
      "tokens_burnt": 544387149156600000000,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "7bfrhrV26WQR8V3wepZHSWFoMXsLyxsymG4hcKSM3ef9",
    "included_in_block_hash": "BLMcSwJFi2pVhxTtUuisFjZdBFraoksdJXmo1r8am5bn",
    "block_timestamp": "1725714865335878781",
    "block": {
      "block_height": 127500260
    },
    "receipt_conversion_tokens_burnt": "62501315360500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "edit_proposal",
        "deposit": 0,
        "fee": 544387149156600000000,
        "args": "{\"id\": 16, \"body\": {\"name\": \"Aeon: permissionless multi-sig for NEAR\", \"summary\": \"At Aeon, we\\\\\\\\\\\\'re building the first multi-chain multi-sig for custody of any asset on any chain. We use decentralized MPC, enable permissionless onboarding of chains and DeFi services, and offer sophisticated transaction policies down to the payload level. Our vision: become the hub for multi-chain DeFi and provide an AI agent marketplace for outsourcing work like reporting, trading strategies, and risk management.\", \"category\": \"Infrastructure Committee\", \"timeline\": {\"status\": \"DRAFT\"}, \"supervisor\": null, \"description\": \"### Primary person\\\\\\\\u{2019}s contact information\\\\\\\\nJustin Heinz(justin@aeon.so)\\\\\\\\n\\\\\\\\n### Size of the whole team\\\\\\\\n4\\\\\\\\n\\\\\\\\n### Size of the engineering team\\\\\\\\n3 (+2 starting in Q4)\\\\\\\\n\\\\\\\\n### Team location\\\\\\\\nLisbon, Portugal\\\\\\\\n\\\\\\\\n\\\\\\\\n### Team background and bios\\\\\\\\n\\\\\\\\n* Justin - Co-Founder (https://www.linkedin.com/in/justin-alexander-heinz/, https://github.com/fl0ydj): studied at Cambridge, worked at Amazon, built wallet for Outlet finance; prev. founder experience\\\\\\\\n* Alex - Co-Founder (https://www.linkedin.com/in/alexander-ludwig-profile/, https://github.com/alexanderludwig): start-up experience in data science; VC for EQT ventures\\\\\\\\n* Parshant - Founding Engineer (https://www.linkedin.com/in/psm21/, https://github.com/singhparshant): IIIT Allahabad/ TUM, Goldman Sachs; MPC research at UCL\\\\\\\\n* + 2 engineers starting in Q4\\\\\\\\n* + freelance designer\\\\\\\\n\\\\\\\\n\\\\\\\\n### Product / Value Proposition\\\\\\\\n\\\\\\\\nBuilding a trustless and permissionless multi-sig for the Near ecosystem, to make it easier for sophisticated investors to hold tokens and interact with Near\\\\\\\\u{2019}s DeFi protocols.\\\\\\\\nProduct demo: https://www.loom.com/share/270c39a0d9044d59b555dfa04a24e501\\\\\\\\n* Allowing trustless custody of any asset on any chain by leveraging Pera\\\\\\\\\\\\'s (formerly dWallet network) decentralized & non-collusive MPC. (Find more details here: https://github.com/dwallet-labs/dwallet-network, https://eprint.iacr.org/2024/253.pdf)\\\\\\\\n* Permissionless onboarding of new chains, so ecosystems can onboard themselves in a self-service manner. Existing ecosystem integrations include Bitcoin, EVM, Cosmos, Sui, and Fuel.\\\\\\\\nOffers sophisticated transaction policies down to the payload level (e.g., allowing limits on swapping, lending, and borrowing amounts) and other features like user management, address book, and trustless recovery (with a Ledger).\\\\\\\\n* Access dApps through our dApp store ecosystem in a secure manner, safeguarded by our policy engine.\\\\\\\\nInstitutional-grade security, with part of the key secured by Pera\\\\\\\\\\\\'s decentralized MPC network and the other part by our mobile signing app using the mobile phone\\\\\\\\\\\\'s secure enclave.\\\\\\\\n* Integration of chain abstraction and chain-abstracted DeFi services into our product.\\\\\\\\n* Product vision: Become a platform for AI agents that users can hire to execute tasks for them, such as executing sophisticated trading strategies (e.g., going long on revenue-generating DeFi projects, shorting infrastructure projects), and advising users on proper risk management techniques. Here we see synergies with NEAR\\\\\\\\\\\\'s strategy and hence would want to integrate such projects and work closely together with them.\\\\\\\\n\\\\\\\\n### Benefits for the NEAR ecosystem\\\\\\\\n* Integration of NEAR into a multi-chain custody solution with policy engine support (NEAR token holders can restrict sender, receiver, and amount of assets being transferred). This increases accessibility of NEAR assets for institutional and sophisticated investors (market makers, liquid/venture funds, sophisticated teams/individuals) to hold assets. The product will be gradually made open-source over the next years.\\\\\\\\n* Integration of NEAR multi-chain DeFi projects to be used directly by sophisticated investors from within our product (e.g., swapping and lending).\\\\\\\\n* Integration of NEAR AI agents into our platform to offer our customers services provided by these agents.\\\\\\\\n\\\\\\\\n### Goals / Milestones\\\\\\\\n\\\\\\\\n**NEAR integration (Target: Q4 2024)**\\\\\\\\n* Mainnet launch in Q4 2024, dependent on Pera network\\\\\\\\n* Integration of the NEAR RPC API into our chain integration SDK to communicate with and read transactions from the NEAR blockchain\\\\\\\\n* Completion of security audits for our core smart contracts and the NEAR transaction assembling module (written in Move)\\\\\\\\n**dApp integration (Q1 2025)**\\\\\\\\n* Integration of NEAR ecosystems into our integrated dApp store (as described here: https://x.com/ilblackdragon/status/1821933128799211618)\\\\\\\\n* Incorporation of the NEAR wallet selector into our multi-chain extension framework\\\\\\\\n \\\\\\\\n### Metrics\\\\\\\\n**Milestone 1: NEAR integration**\\\\\\\\n* Users can hold assets on NEAR and execute transfers of the NEAR native asset, NEP-141 fungible token standard, and NEP-171 non-fungible token standard.\\\\\\\\n**Milestone 2: dApp integration**\\\\\\\\n* Users can natively use the top 10 NEAR dApps through our dApp interface.\\\\\\\\n\\\\\\\\n\\\\\\\\n### Competitor Comparison\\\\\\\\n\\\\\\\\n** Alternatives:**\\\\\\\\n* On-chain multi-sigs (e.g., Gnosis Safe, Squads): Suffer from fragmentation across chains and lack support for non-smart contract chains. However, for NEAR, there is no native multi-sig available offering the same features as Aeon does.\\\\\\\\n* MPC-based institutional custody players (e.g., Fireblocks): Slow to innovate, permissioned, closed source, not built from the ground up for DeFi interactions, and expensive.\\\\\\\\n**Our Advantages:**\\\\\\\\n* Built for DeFi & AI agents: Manage all your positions within our platform.\\\\\\\\n* Ability to hire AI agents constrained by the policy engine built for DeFi.\\\\\\\\n* Institutional-grade security: Truly decentralized and censorship-resistant. Transactions are cosigned by the user\\\\\\\\\\\\'s mobile phone enclave and a decentralized network.\\\\\\\\n\\\\\\\\n### Usage & Examples\\\\\\\\n\\\\\\\\nCurrent testnet launch with 10 investors testing our product. Integration with BTC, EVM, Cosmos, Sui, Fuel integration. See product demo above.\\\\\\\\n\\\\\\\\n\\\\\\\\n## Budget\\\\\\\\n\\\\\\\\n### Budget Total\\\\\\\\n\\\\\\\\n$62k\\\\\\\\n\\\\\\\\n### Budget Breakdown\\\\\\\\n\\\\\\\\n**Milestone 1: Near integration $41k**\\\\\\\\n* Engineering costs smart contract signing module in Move: $14k\\\\\\\\n* Smart contract audits: $8k\\\\\\\\n* Integration into Aeon chain SDK abstracting Near RPC: $11k\\\\\\\\n* Setting up and maintaining subquery indexer: $8k\\\\\\\\n** Milestone 2: dApp integration $21k **\\\\\\\\n* Javascript extension injection flow enabling dApps to connect with Aeon using the Near wallet selector $12k\\\\\\\\n* Extend Aeon chain SDK to support Near dApp request processing $9k\\\\\\\\n\", \"linked_proposals\": [], \"receiver_account\": \"0xalxx.near\", \"requested_sponsor\": \"infrastructure-committee.near\", \"proposal_body_version\": \"V1\", \"requested_sponsorship_usd_amount\": \"62\", \"requested_sponsorship_paid_in_currency\": \"USDC\"}, \"labels\": [\"Other\"]}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 959687278947200000000
    }
  },
  {
    "id": "8112675496",
    "receipt_id": "7GFhgZsD6Xpu3QnaVDq6JbYrEow66R9Jknqfh2DtKjwk",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "social.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "6gDexuGiYYpNdqgb6P92SFqj7SXMhBcCWV6Skm3XuxZE",
      "block_height": 127500262,
      "block_timestamp": 1725714867719433700
    },
    "receipt_outcome": {
      "gas_burnt": 3527988144301,
      "tokens_burnt": 352798814430100000000,
      "executor_account_id": "social.near",
      "status": true
    },
    "transaction_hash": "7bfrhrV26WQR8V3wepZHSWFoMXsLyxsymG4hcKSM3ef9",
    "included_in_block_hash": "BLMcSwJFi2pVhxTtUuisFjZdBFraoksdJXmo1r8am5bn",
    "block_timestamp": "1725714865335878781",
    "block": {
      "block_height": 127500260
    },
    "receipt_conversion_tokens_burnt": "62501315360500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set",
        "deposit": 0,
        "fee": 352798814430100000000,
        "args": "{\"data\": {\"infrastructure-committee.near\": {\"index\": {\"notify\": \"{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"0xalxx.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"proposal/edit\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"proposal\\\\\\\\\\\\\\\":16,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"0xalxx.near\\\\\\\\\\\\\\\"}}\"}}}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 959687278947200000000
    }
  },
  {
    "id": "8112783410",
    "receipt_id": "C9SGJffrRwh6GBDv1pSmtNdkLLkKS1pdoPvPJnDCmHqy",
    "predecessor_account_id": "0xalxx.near",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "Y9TZwWcvQnzmSurittmhKBN7heNJDFMBu691wwRQt3j",
      "block_height": 127500458,
      "block_timestamp": 1725715113201727200
    },
    "receipt_outcome": {
      "gas_burnt": 6306420568537,
      "tokens_burnt": 630642056853700000000,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "Gn3T8VVWDHdwcLkTE61UhmB1pZspYZMVG6MM3u9FfF1f",
    "included_in_block_hash": "FywsCQfytjVLhzL95aPyMfs7g1jF4SVUHPhaHqEkrKep",
    "block_timestamp": "1725715111995969078",
    "block": {
      "block_height": 127500457
    },
    "receipt_conversion_tokens_burnt": "62491778617500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "edit_proposal",
        "deposit": 0,
        "fee": 630642056853700000000,
        "args": "{\"id\": 16, \"body\": {\"name\": \"Aeon: permissionless multi-sig for NEAR\", \"summary\": \"At Aeon, we\\\\\\\\\\\\'re building the first multi-chain multi-sig for custody of any asset on any chain. We use decentralized MPC, enable permissionless onboarding of chains and DeFi services, and offer sophisticated transaction policies down to the payload level. Our vision: become the hub for multi-chain DeFi and provide an AI agent marketplace for outsourcing work like reporting, trading strategies, and risk management.\", \"category\": \"Infrastructure Committee\", \"timeline\": {\"status\": \"DRAFT\"}, \"supervisor\": null, \"description\": \"### Primary person\\\\\\\\u{2019}s contact information\\\\\\\\nJustin Heinz(justin@aeon.so)\\\\\\\\n\\\\\\\\n### Size of the whole team\\\\\\\\n4\\\\\\\\n\\\\\\\\n### Size of the engineering team\\\\\\\\n3 (+2 starting in Q4)\\\\\\\\n\\\\\\\\n### Team location\\\\\\\\nLisbon, Portugal\\\\\\\\n\\\\\\\\n\\\\\\\\n### Team background and bios\\\\\\\\n\\\\\\\\n* Justin - Co-Founder (https://www.linkedin.com/in/justin-alexander-heinz/, https://github.com/fl0ydj): studied at Cambridge, worked at Amazon, built wallet for Outlet finance; prev. founder experience\\\\\\\\n* Alex - Co-Founder (https://www.linkedin.com/in/alexander-ludwig-profile/, https://github.com/alexanderludwig): start-up experience in data science; VC for EQT ventures\\\\\\\\n* Parshant - Founding Engineer (https://www.linkedin.com/in/psm21/, https://github.com/singhparshant): IIIT Allahabad/ TUM, Goldman Sachs; MPC research at UCL\\\\\\\\n* 2 engineers starting in Q4\\\\\\\\n* freelance designer\\\\\\\\n\\\\\\\\n\\\\\\\\n### Product / Value Proposition\\\\\\\\n\\\\\\\\nBuilding a trustless and permissionless multi-sig for the Near ecosystem, to make it easier for sophisticated investors to hold tokens and interact with Near\\\\\\\\u{2019}s DeFi protocols.\\\\\\\\nProduct demo: https://www.loom.com/share/270c39a0d9044d59b555dfa04a24e501\\\\\\\\n* Allowing trustless custody of any asset on any chain by leveraging Pera\\\\\\\\\\\\'s (formerly dWallet network) decentralized & non-collusive MPC. (Find more details here: https://github.com/dwallet-labs/dwallet-network, https://eprint.iacr.org/2024/253.pdf)\\\\\\\\n* Permissionless onboarding of new chains, so ecosystems can onboard themselves in a self-service manner. Existing ecosystem integrations include Bitcoin, EVM, Cosmos, Sui, and Fuel.\\\\\\\\nOffers sophisticated transaction policies down to the payload level (e.g., allowing limits on swapping, lending, and borrowing amounts) and other features like user management, address book, and trustless recovery (with a Ledger).\\\\\\\\n* Access dApps through our dApp store ecosystem in a secure manner, safeguarded by our policy engine.\\\\\\\\nInstitutional-grade security, with part of the key secured by Pera\\\\\\\\\\\\'s decentralized MPC network and the other part by our mobile signing app using the mobile phone\\\\\\\\\\\\'s secure enclave.\\\\\\\\n* Integration of chain abstraction and chain-abstracted DeFi services into our product.\\\\\\\\n* Product vision: Become a platform for AI agents that users can hire to execute tasks for them, such as executing sophisticated trading strategies (e.g., going long on revenue-generating DeFi projects, shorting infrastructure projects), and advising users on proper risk management techniques. Here we see synergies with NEAR\\\\\\\\\\\\'s strategy and hence would want to integrate such projects and work closely together with them.\\\\\\\\n\\\\\\\\n### Benefits for the NEAR ecosystem\\\\\\\\n* Integration of NEAR into a multi-chain custody solution with policy engine support (NEAR token holders can restrict sender, receiver, and amount of assets being transferred). This increases accessibility of NEAR assets for institutional and sophisticated investors (market makers, liquid/venture funds, sophisticated teams/individuals) to hold assets. The product will be gradually made open-source over the next years.\\\\\\\\n* Integration of NEAR multi-chain DeFi projects to be used directly by sophisticated investors from within our product (e.g., swapping and lending).\\\\\\\\n* Integration of NEAR AI agents into our platform to offer our customers services provided by these agents.\\\\\\\\n\\\\\\\\n### Goals / Milestones\\\\\\\\n\\\\\\\\n**NEAR integration (Target: Q4 2024)**\\\\\\\\n* Mainnet launch in Q4 2024, dependent on Pera network\\\\\\\\n* Integration of the NEAR RPC API into our chain integration SDK to communicate with and read transactions from the NEAR blockchain\\\\\\\\n* Completion of security audits for our core smart contracts and the NEAR transaction assembling module (written in Move)\\\\\\\\n**dApp integration (Q1 2025)**\\\\\\\\n* Integration of NEAR ecosystems into our integrated dApp store (as described here: https://x.com/ilblackdragon/status/1821933128799211618)\\\\\\\\n* Incorporation of the NEAR wallet selector into our multi-chain extension framework\\\\\\\\n \\\\\\\\n### Metrics\\\\\\\\n**Milestone 1: NEAR integration**\\\\\\\\n* Users can hold assets on NEAR and execute transfers of the NEAR native asset, NEP-141 fungible token standard, and NEP-171 non-fungible token standard.\\\\\\\\n**Milestone 2: dApp integration**\\\\\\\\n* Users can natively use the top 10 NEAR dApps through our dApp interface.\\\\\\\\n\\\\\\\\n\\\\\\\\n### Competitor Comparison\\\\\\\\n\\\\\\\\n** Alternatives:**\\\\\\\\n* On-chain multi-sigs (e.g., Gnosis Safe, Squads): Suffer from fragmentation across chains and lack support for non-smart contract chains. However, for NEAR, there is no native multi-sig available offering the same features as Aeon does.\\\\\\\\n* MPC-based institutional custody players (e.g., Fireblocks): Slow to innovate, permissioned, closed source, not built from the ground up for DeFi interactions, and expensive.\\\\\\\\n**Our Advantages:**\\\\\\\\n* Built for DeFi & AI agents: Manage all your positions within our platform.\\\\\\\\n* Ability to hire AI agents constrained by the policy engine built for DeFi.\\\\\\\\n* Institutional-grade security: Truly decentralized and censorship-resistant. Transactions are cosigned by the user\\\\\\\\\\\\'s mobile phone enclave and a decentralized network.\\\\\\\\n\\\\\\\\n### Usage & Examples\\\\\\\\n\\\\\\\\nCurrent testnet launch with 10 investors testing our product. Integration with BTC, EVM, Cosmos, Sui, Fuel integration. See product demo above.\\\\\\\\n\\\\\\\\n\\\\\\\\n## Budget\\\\\\\\n\\\\\\\\n### Budget Total\\\\\\\\n\\\\\\\\n$62k\\\\\\\\n\\\\\\\\n### Budget Breakdown\\\\\\\\n#### Milestone 1: Near integration $41k\\\\\\\\n* Engineering costs smart contract signing module in Move: $14k\\\\\\\\n* Smart contract audits: $8k\\\\\\\\n* Integration into Aeon chain SDK abstracting Near RPC: $11k\\\\\\\\n* Setting up and maintaining subquery indexer: $8k\\\\\\\\n \\\\\\\\n#### Milestone 2: dApp integration $21k \\\\\\\\n* Javascript extension injection flow enabling dApps to connect with Aeon using the Near wallet selector $12k\\\\\\\\n* Extend Aeon chain SDK to support Near dApp request processing $9k\\\\\\\\n\", \"linked_proposals\": [], \"receiver_account\": \"0xalxx.near\", \"requested_sponsor\": \"infrastructure-committee.near\", \"proposal_body_version\": \"V1\", \"requested_sponsorship_usd_amount\": \"62\", \"requested_sponsorship_paid_in_currency\": \"USDC\"}, \"labels\": [\"Other\"]}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.0447744574333e+21
    }
  },
  {
    "id": "8112783803",
    "receipt_id": "HWbd32NEP3GT6wxVyuZkZKnN3HjgpSbiRtXz7D4UbYCJ",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "social.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "Fw8tqBiQHNwENkTEgWVQg7n58ABQY9NiopRdbY3952UK",
      "block_height": 127500459,
      "block_timestamp": 1725715114383563800
    },
    "receipt_outcome": {
      "gas_burnt": 3516406219621,
      "tokens_burnt": 351640621962100000000,
      "executor_account_id": "social.near",
      "status": true
    },
    "transaction_hash": "Gn3T8VVWDHdwcLkTE61UhmB1pZspYZMVG6MM3u9FfF1f",
    "included_in_block_hash": "FywsCQfytjVLhzL95aPyMfs7g1jF4SVUHPhaHqEkrKep",
    "block_timestamp": "1725715111995969078",
    "block": {
      "block_height": 127500457
    },
    "receipt_conversion_tokens_burnt": "62491778617500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set",
        "deposit": 0,
        "fee": 351640621962100000000,
        "args": "{\"data\": {\"infrastructure-committee.near\": {\"index\": {\"notify\": \"{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"0xalxx.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"proposal/edit\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"proposal\\\\\\\\\\\\\\\":16,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"0xalxx.near\\\\\\\\\\\\\\\"}}\"}}}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.0447744574333e+21
    }
  },
  {
    "id": "8139756904",
    "receipt_id": "9DjrozZXqrqe4by1TVw741bLc8dMPYSuddNk7YoTCZmF",
    "predecessor_account_id": "bb5142ca412fb51a03ae4523f8f3dc77047d29e63c1c9e1ad8c5d019a4b64f3d",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "GWQbU3wxYqod5xpTHeE3Xugui5ifnymA5tAMUzRRVMfy",
      "block_height": 127574883,
      "block_timestamp": 1725799208133646000
    },
    "receipt_outcome": {
      "gas_burnt": 8510553874074,
      "tokens_burnt": 851055387407400000000,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "5oJvnkMvD6FPuDoLA4i4CCEfTyLZsWQ5LeYfrXhxN9XD",
    "included_in_block_hash": "AUeTGNBNqJq9z2yWQxTF2D2KdASg5NC8CxQqsXsQcxdi",
    "block_timestamp": "1725799207036503020",
    "block": {
      "block_height": 127574882
    },
    "receipt_conversion_tokens_burnt": "110766771683500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "add_proposal",
        "deposit": 0,
        "fee": 851055387407400000000,
        "args": "{\"body\": {\"name\": \"NEAR x IBC Smart Contracts on NEAR\", \"summary\": \"At Moonstruck, our goal is to bring the existing implementation of NEAR IBC to a working, production ready state and offer maintenance and support for teams looking to integrate. Furthermore, we would love to work with the NEAR and Cosmos ecosystems and communities to further expand upon this foundation towards a future V2 of this protocol.\", \"category\": \"Infrastructure Committee\", \"timeline\": {\"status\": \"DRAFT\"}, \"supervisor\": null, \"description\": \"## Organization\\\\\\\\n\\\\\\\\n### Primary person\\\\\\\\\\\\'s contact information\\\\\\\\n\\\\\\\\n**Strahinja Vukoi\\\\\\\\u{10d}i\\\\\\\\u{107} (CEO)**  \\\\\\\\nTelegram:   @StrahinjaVukoicic  \\\\\\\\nEmail:      strahinja@moonstruck.io\\\\\\\\n\\\\\\\\n### Size of the whole team\\\\\\\\n\\\\\\\\nMOONSTRUCK has a total of 33 employees, not including external contractors (consultants, auditors, UI/UX experts).\\\\\\\\n\\\\\\\\n### Size of the engineering team\\\\\\\\n\\\\\\\\nMOONSTRUCK has a total of 25 engineers available in full time roles.\\\\\\\\n\\\\\\\\n### Team location\\\\\\\\n\\\\\\\\nBelgrade, Serbia\\\\\\\\n\\\\\\\\n### Team background and bios\\\\\\\\n\\\\\\\\nSelected team member CVs:\\\\\\\\n\\\\\\\\n- Pavle Batuta \\\\\\\\\\\\\\\\- [1\\\\\\\\\\\\\\\\. CV - Pavle Batuta.pdf](https://drive.google.com/file/d/1HC35s5Nz1KS7Xr9NIJsBCfE2JScLm1gt/view?usp=sharing)  \\\\\\\\n- Bogdan Ilic \\\\\\\\\\\\\\\\- [2\\\\\\\\\\\\\\\\. CV - Bogdan Ilic\\\\\\\\u{301}.pdf](https://drive.google.com/file/d/12HmM7oMkYx6rbI7U5a6Ds\\\\\\\\\\\\\\\\_QqiKo2qsyT/view?usp=sharing)  \\\\\\\\n- Emil Bob \\\\\\\\\\\\\\\\- [3\\\\\\\\\\\\\\\\. CV - Emil Bob.pdf](https://drive.google.com/file/d/1v5jaqXpRzmbCivydxEyKgiPeGMSPEXN1/view?usp=sharing)  \\\\\\\\n- Stefan Latinovic \\\\\\\\\\\\\\\\- [4\\\\\\\\\\\\\\\\. CV - Stefan Latinovic\\\\\\\\u{301}.pdf](https://drive.google.com/file/d/1E3aahumuXfA\\\\\\\\\\\\\\\\_\\\\\\\\\\\\\\\\_wvdhQbOvjJHjxAl65Tu/view?usp=sharing)\\\\\\\\n\\\\\\\\n### Any affiliations with other NEAR ecosystem partners?\\\\\\\\n\\\\\\\\nMOONSTRUCK has had an open collaboration with NEAR Balkans Hub for almost 3 years, pretty much from the onset, helping to promote NEAR\\\\\\\\u{2019}s technology and ecosystem. Our company facilitated the first ever technical workshop about NEAR for software engineers in Serbia. During the ETH Belgrade and Belgrade Blockchain Week 2023, our company provided a venue for \\\\\\\\u{201c}NEAR Day\\\\\\\\u{201d} and \\\\\\\\u{201c}BOS Workshop\\\\\\\\u{201d} held by NEAR\\\\\\\\u{2019}s experts.\\\\\\\\n\\\\\\\\n## Professional Experience\\\\\\\\n\\\\\\\\n### Examples of relevant experience with NEAR blockchain\\\\\\\\n\\\\\\\\nMOONSTRUCK has not deployed a production-level project on NEAR blockchain; however, 7 engineers from our company have passed the training in BOS and have experience in building BOS components. Team proposed for this project is very familiar with NEAR architecture and latest technical documentation.\\\\\\\\n\\\\\\\\n### Non-technical capabilities:\\\\\\\\n\\\\\\\\nMOONSTRUCK has consistently strived to connect and bring together the Web3 community in the SEE region and participate in various programs to empower teams and individuals, thus cultivating our own talent.\\\\\\\\n\\\\\\\\n**Web3 Supercluster**  \\\\\\\\nMOONSTRUCK is the founding member of Web3 Supercluster, a part of the \\\\\\\\u{201c}Serbia Innovates\\\\\\\\u{201d} program supported by USAID that seeks to strengthen the Serbian economy through R\\\\\\\\\\\\\\\\&D collaboration, education and skills development in the deep tech domain.\\\\\\\\n\\\\\\\\n**Web 2.5 Academy**  \\\\\\\\nMOONSTRUCK holds a Web 2.5 Academy, aimed at enabling the inclusion of a wide range of participants with basic programming skills and directing them towards Web3 technologies, providing intrinsic knowledge in blockchain architecture, consensus mechanism, smart contracts and tooling. For the past 2 years, we have held 3 cohorts and trained more than 400 participants.\\\\\\\\n\\\\\\\\n**Moonwalk**  \\\\\\\\nMOONSTRUCK has a four-month internship program Moonwalk, which is designed to bring out the best from a small group of selected candidates from our yearly educational programs.\\\\\\\\n\\\\\\\\n**Glue**  \\\\\\\\nGlue, our Web3 acceleration program, is the premier launchpad for emerging teams and projects, emphasizing technology excellence and hands-on learning process under guidance of our mentors.\\\\\\\\n\\\\\\\\n**Guesthouse**  \\\\\\\\nGuesthouse by MOONSTRUCK is held every year during Belgrade Blockchain Week. It represents a series of side events that cover relevant topics in the Web3 and Blockchain industry. For the past 2 years, we hosted 25 impactful events, engaging over 300 participants in workshops, discussions, presentations, training, etc. With the support from NEAR, Chainlink, ICP, Sui, Superchain and many other valued partners, we brought the Guesthouse event to life.\\\\\\\\n\\\\\\\\n### Portfolio of relevant work\\\\\\\\n\\\\\\\\n**Swarm** \\\\\\\\\\\\\\\\- Decentralised Storage Service by Ethereum Foundation.\\\\\\\\n\\\\\\\\n**Giveth** \\\\\\\\\\\\\\\\- Cryptocurrency donation platform and DeFi protocol that rewards donors of verified public goods projects.\\\\\\\\n\\\\\\\\n**Bitcoin.com** \\\\\\\\\\\\\\\\- Automated Market Maker (AMM).\\\\\\\\n\\\\\\\\n**Hundrx** \\\\\\\\\\\\\\\\- Web3 extension for Twitter (X) enabling tokenization of profiles and enhanced interaction between influencers and followers via social tokens.\\\\\\\\n\\\\\\\\n**AgAu** \\\\\\\\\\\\\\\\- RWA digital platform for tokenization of investment gold and precious metals with fully collateralized cryptocurrency.\\\\\\\\n\\\\\\\\n**DeFire** \\\\\\\\\\\\\\\\- DEX aggregation platform for transaction optimization.\\\\\\\\n\\\\\\\\n**Tycoon** \\\\\\\\\\\\\\\\- Social crypto trading platform and cryptocurrency.\\\\\\\\n\\\\\\\\n**Renfter** \\\\\\\\\\\\\\\\- Uncollateralized NFT Renting Protocol.\\\\\\\\n\\\\\\\\n**Libertas** \\\\\\\\\\\\\\\\- Infrastructure and Protocol for TSF proof-of-work blockchain (L1).\\\\\\\\n\\\\\\\\n**Disberse** \\\\\\\\\\\\\\\\- Transparency on-chain platform for tracking means of public funding.\\\\\\\\n\\\\\\\\n**Asphodel** \\\\\\\\\\\\\\\\- Metaverse on-chain game.\\\\\\\\n\\\\\\\\n**Kamigotchi World** \\\\\\\\\\\\\\\\- DAO governed on-chain game.\\\\\\\\n\\\\\\\\n**Mirage Protocol** \\\\\\\\\\\\\\\\- Universal multichain asset-mirroring protocol.\\\\\\\\n\\\\\\\\n**TRAKEN** \\\\\\\\\\\\\\\\- Renewable energy aggregation and trading platform for smart electrical grids based on blockchain technology, enabling power purchasing agreements execution in the form of smart contracts.\\\\\\\\n\\\\\\\\n## Body\\\\\\\\n\\\\\\\\nWe propose to inherit the current implementation of the NEAR \\\\\\\\\\\\\\\\- IBC protocol, previously built by [Octopus Network](https://oct.network/) and prepare it for mainnet production as a version 1.0 release candidate. Furthermore, we would like to offer our services, collaborate with the relevant stakeholders in the Cosmos ecosystem and work towards developing further production releases with new features built in tight cooperation. Finally, we would like to commit a team towards long term maintenance and support of the project \\\\\\\\\\\\\\\\- including documentation\\\\\\\\n\\\\\\\\nThe NEAR \\\\\\\\\\\\\\\\- IBC protocol is the NEAR implementation of the IBC protocol transport layer (IBC/TAO). The project integrates the implementation of the IBC protocol based Inter-Blockchain Communication fungible token transfer application (ICS20) to link the NEAR and Cosmos ecosystems, bringing greater composability to the innovation of the entire interchain blockchain Internet.\\\\\\\\n\\\\\\\\nMore information on the original project iteration is available on the accompanying [Octopus network Medium post.](https://medium.com/omnity/introduction-to-near-ibc-how-to-implement-the-ibc-protocol-with-smart-contracts-a8b0e13cb886)\\\\\\\\n\\\\\\\\nOur team has performed an extensive gap analysis and research of the current implementation version and has compiled a [gap analysis report](https://docs.google.com/document/d/1icI44qEgX3srzjx5EJQJs6LJRYy1-H96t4zzwh99\\\\\\\\\\\\\\\\_28/edit?usp=sharing) with our findings.\\\\\\\\n\\\\\\\\nWe intend to release the codebase under a permissive open source license. We intend to discuss with the NEAR foundation and any other relevant stakeholders on the exact choice of the license we will be selecting.\\\\\\\\n\\\\\\\\nThere are currently at least two teams looking to utilize NEAR IBC as a solution. Our goal is to help these initial early adopters to achieve success and build a strong foundation for supporting other teams in the future.\\\\\\\\n\\\\\\\\n## Goals / Milestones\\\\\\\\n\\\\\\\\n### Project Goals\\\\\\\\n\\\\\\\\nWe define two major goals for this proposal: **release** and **maintenance**.\\\\\\\\n\\\\\\\\nOur **primary release goal** is to prepare a mainnet ready **NEAR IBC v1.0 release candidate** and deploy it into production on time and at quality. The release candidate should \\\\\\\\n\\\\\\\\n- implement all of the features of the NEAR IBC protocol spec   \\\\\\\\n- successfully pass a security audit by a reputable team (or platform).\\\\\\\\n\\\\\\\\nOur **secondary release goal(s)** are to support teams looking to integrate NEAR IBC into their products and protocols by well produced and detailed developer documentation as well as a working prototype (proof of concept) console based application as a reference.\\\\\\\\n\\\\\\\\nOur **maintenance goal** is to commit a team to maintain the NEAR IBC project after the release candidate: fix bugs and security issues, prepare new releases, update and maintain documentation and provide first or second line support to teams that are using the protocol as a part of their solutions.\\\\\\\\n\\\\\\\\nBeyond our immediate goals, we wish to extend the current implementation towards a V2 release with the support of teams in the Cosmos ecosystem. With that in mind, we will ensure that the implementation stays clear and extensible towards future features and upgrades.\\\\\\\\n\\\\\\\\nTo that end we propose the project be divided into two phases: active development and maintenance cycle.\\\\\\\\n\\\\\\\\n### Milestones\\\\\\\\n\\\\\\\\nWe propose the following milestones:\\\\\\\\n\\\\\\\\n- Alpha release: constitutes a version with a working happy path that can be tested in a local environment  \\\\\\\\n- V1 release candidate: constitutes a version with a demonstration PoC that is deployed to a testnet environment and is ready for an audit\\\\\\\\n\\\\\\\\nThese milestones are based on our current understanding of the project and objectives and priorities. We invite the infrastructure team and the NEAR Foundation to help us define clearer milestones for delivery based on ecosystem priorities and shared understanding.\\\\\\\\n\\\\\\\\n### Reporting\\\\\\\\n\\\\\\\\nDuring the **release phase** of the project, we suggest regular **2 week** intervals for reporting on the project status, coinciding with the **end of each working sprint**.\\\\\\\\n\\\\\\\\nAs part of the report, the team would present (in agreed upon forum and format) the progress of the project, including any demonstration of functionality that can be performed. The project management team will also open a retrospective of the sprint, with the ability to discuss delivery velocity, risks or potential changes of scope.\\\\\\\\n\\\\\\\\nDuring the **support/maintenance** phase of the project, we suggest **monthly status updates** of work done: security and bug fixes, tech debt resolved, issues reported by the community etc.\\\\\\\\n\\\\\\\\nWe invite the Infrastructure Board and the NEAR Foundation to help us propose a clear and detailed way of reporting for the project.\\\\\\\\n\\\\\\\\n### Engineering Estimation\\\\\\\\n\\\\\\\\nBased on the above gap analysis conclusions, we are able to suggest a provisional delivery scope and provide an expert estimation on engagement with development roles required.\\\\\\\\n\\\\\\\\n#### Provisional Scope\\\\\\\\n\\\\\\\\nWe recommend the following scope of work in order to complete the project into a working solution.\\\\\\\\n\\\\\\\\n##### Required\\\\\\\\n\\\\\\\\n1. Identify any and all components that need to be replaced from the project  \\\\\\\\n2. Determine development/integration/mitigation for the project  \\\\\\\\n3. Bring the project into a working state  \\\\\\\\n4. Implement a minimal testing framework with essential coverage  \\\\\\\\n5. Document a testing procedure for the project and perform smoke testing  \\\\\\\\n6. Upgrade the deployment procedure  \\\\\\\\n7. Provide documentation to changes  \\\\\\\\n8. Deploy solution to testnet  \\\\\\\\n9. Scope and implement a minimal PoC (terminal based)\\\\\\\\n\\\\\\\\n##### Optional\\\\\\\\n\\\\\\\\n1. Implement a full CI/CD release pipeline  \\\\\\\\n2. Implement deployment automation  \\\\\\\\n3. Implement full test coverage  \\\\\\\\n4. Add static analysis in manual or automated form  \\\\\\\\n5. Prepare separate detailed development documentation (for V1)  \\\\\\\\n6. Prepare examples for use  \\\\\\\\n7. Scope and implement a full PoC Dapp\\\\\\\\n\\\\\\\\n#### Definition of Done\\\\\\\\n\\\\\\\\nWe consider the solution as ready for release when it is deployed on a public/available testnet, with released code and artifacts in a state that is ready for audit or early integration. This functionally equates to a testnet release.\\\\\\\\n\\\\\\\\nThis release constitutes a fully delivered project.\\\\\\\\n\\\\\\\\nThe release includes a **working PoC** with demonstrable functionality.\\\\\\\\n\\\\\\\\nThe release does not depend upon audits and integrations with third parties.\\\\\\\\n\\\\\\\\nMOONSTRUCK will be fully committed to assist with any work required to fix any security issues discovered as well as integration to other projects.\\\\\\\\n\\\\\\\\n#### Level of Effort and Timeline \\\\\\\\\\\\\\\\- Development Phase\\\\\\\\n\\\\\\\\nBased on the provisional scope of the project and the expert estimation we are able to provide a provisional engagement for the project with required roles and effort.\\\\\\\\n\\\\\\\\nThis project would be handled by a single Agile pod team with the project being their sole focus during the active development phase. Beyond that, experts will be made available to the pod based on task and project requirements. These team members constitute core and support roles:\\\\\\\\n\\\\\\\\n##### Core Roles\\\\\\\\n\\\\\\\\n| Role | Responsibilities | Effort |\\\\\\\\n| :---- | :---- | :---- |\\\\\\\\n| Project Lead, Blockchain Architect | Leadership, reporting, development | Part Time |\\\\\\\\n| Blockchain Engineer | Development, testing | Full Time |\\\\\\\\n| Blockchain Engineer | Development, testing | Full Time |\\\\\\\\n\\\\\\\\n##### Support Roles\\\\\\\\n\\\\\\\\n| Role | Responsibilities | Effort |\\\\\\\\n| :---- | :---- | :---- |\\\\\\\\n| Engineer in Test | Test automation | Part Time |\\\\\\\\n| Technical Writer | Documentation | Part Time |\\\\\\\\n| Devops | CI/CD, project deployment | Part Time |\\\\\\\\n\\\\\\\\n##### Timeline\\\\\\\\n\\\\\\\\nWe suggest the following timeline for the project, measured in **two week sprints**:\\\\\\\\n\\\\\\\\n| Sprints | Description | Goals |\\\\\\\\n| :---- | :---- | :---- |\\\\\\\\n| 1 | Finish gap analysis, perform spikes and fill backlog | Initial task backlog |\\\\\\\\n| 2, 3 | Perform smoke testing, write test scenarios, write automated tests, set up initial CI/CD, tech debt analysis | Alpha w/ demonstration capability, basic CI/CD pipeline |\\\\\\\\n| 4, 5 | Improved test coverage, tech debt resolution tasks, initial documentation, PoC candidate planning | Basic prototype w/ demonstration capability, documentation, PoC plan |\\\\\\\\n| 6 | PoC development, deployment to testnet, developer documentation, examples | Release Candidate: deployed to testnet w/ working PoC |\\\\\\\\n\\\\\\\\nTotal estimate for delivery of the **proposed scope for V1** amounts to **three months** of effort for the engaged team.\\\\\\\\n\\\\\\\\n##### Release schedule\\\\\\\\n\\\\\\\\n| Release | End of sprint | Goal |\\\\\\\\n| :---- | :---- | :---- |\\\\\\\\n| Alpha | 3 | Local release with a demonstrable happy path available |\\\\\\\\n| RC1 | 6 | Fully featured V1 release deployed to testnet with a working PoC |\\\\\\\\n\\\\\\\\n#### Level of Effort and Timeline \\\\\\\\\\\\\\\\- Support Phase\\\\\\\\n\\\\\\\\nAfter the release, we would assign a maintenance team to support the V1 release, ensuring it is working to spec and assisting other development teams with integration. Maintenance will also cover a certain amount of tech debt resolution from the development phase. This role includes redundant effort to ensure availability of support.\\\\\\\\n\\\\\\\\n##### Support Roles\\\\\\\\n\\\\\\\\n| Role | Responsibilities | Effort |\\\\\\\\n| :---- | :---- | :---- |\\\\\\\\n| Blockchain Engineer | Maintenance and support | Part time |\\\\\\\\n| Blockchain Engineer | Maintenance and support | Part time |\\\\\\\\n\\\\\\\\nWe would commit the core support roles to work on maintenance and support tasks for a period of **nine months**.\\\\\\\\n\\\\\\\\n#### Commentary\\\\\\\\n\\\\\\\\nMoonstruck wishes to engage and own this project long term. Our goal is to support the expansion of this protocol towards V2 and beyond. Therefore one of the primary outcomes of working on V1 is to get the team acquainted with an expert level of understanding of the underlying protocol, technology and concepts.\\\\\\\\n\\\\\\\\nOur hope is to reach a level of understanding towards our provisional scope and best-effort analysis as well as continuous improvements towards the protocol with a close relations\\\\\\\\n\\\\\\\\n## Budget\\\\\\\\n\\\\\\\\n### Budget Total\\\\\\\\n\\\\\\\\nWe have estimated the total budget for the project as:\\\\\\\\n\\\\\\\\n- **USD 98.000** for the development phase (over 3 months)  \\\\\\\\n- **USD 72.000** for the support phase (over 9 months)\\\\\\\\n\\\\\\\\nFor a total of ***USD 170.000*** over a period of 1 year.\\\\\\\\n\\\\\\\\n### Budget Breakdown\\\\\\\\n\\\\\\\\nWe suggest the following budget breakdown and payment structure:\\\\\\\\n\\\\\\\\nFor the development phase we suggest the following payouts:\\\\\\\\n\\\\\\\\n| Milestone | Time of payment (after project start) | Amount |\\\\\\\\n| :---- | :---- | :---- |\\\\\\\\n| Alpha | 1.5 months | USD 50.000 |\\\\\\\\n| RC1 | 3 months | USD 48.000 |\\\\\\\\n\\\\\\\\n| Total | USD 98.000 |\\\\\\\\n| :---- | :---- |\\\\\\\\n\\\\\\\\nFor the support phase we suggest the following retainer for the next ***9 months***.\\\\\\\\n\\\\\\\\n| Item | Recurring | Amount |\\\\\\\\n| :---- | :---- | :---- |\\\\\\\\n| Engineering Support | Monthly (x9) | USD 8000 |\\\\\\\\n\\\\\\\\n| Total | 72.000 |\\\\\\\\n| :---- | :---- |\\\\\\\\n\\\\\\\\n\", \"linked_proposals\": [], \"receiver_account\": \"bb5142ca412fb51a03ae4523f8f3dc77047d29e63c1c9e1ad8c5d019a4b64f3d\", \"requested_sponsor\": \"infrastructure-committee.near\", \"proposal_body_version\": \"V1\", \"requested_sponsorship_usd_amount\": \"170000\", \"requested_sponsorship_paid_in_currency\": \"USDC\"}, \"labels\": [\"Bridges\", \"Other\"]}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 2.2451757450795e+21
    }
  },
  {
    "id": "8139757142",
    "receipt_id": "HbKTLEvdWzSXNS7Fnpvqs2MrjRqpmbSzetHBooFoDbkn",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "social.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "7dNxwSocvmT34ej6bAspbMjTvnMiYgfi34ppqdSfQzAT",
      "block_height": 127574884,
      "block_timestamp": 1725799209133980400
    },
    "receipt_outcome": {
      "gas_burnt": 4533221162316,
      "tokens_burnt": 453322116231600000000,
      "executor_account_id": "social.near",
      "status": true
    },
    "transaction_hash": "5oJvnkMvD6FPuDoLA4i4CCEfTyLZsWQ5LeYfrXhxN9XD",
    "included_in_block_hash": "AUeTGNBNqJq9z2yWQxTF2D2KdASg5NC8CxQqsXsQcxdi",
    "block_timestamp": "1725799207036503020",
    "block": {
      "block_height": 127574882
    },
    "receipt_conversion_tokens_burnt": "110766771683500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set",
        "deposit": 0,
        "fee": 453322116231600000000,
        "args": "{\"data\": {\"infrastructure-committee.near\": {\"post\": {\"main\": \"{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"md\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"text\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"We have just received a new *Infrastructure Committee* proposal.\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\n\\\\\\\\u{2014}\\\\\\\\u{2014}\\\\\\\\u{2014}\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\n**By**: @bb5142ca412fb51a03ae4523f8f3dc77047d29e63c1c9e1ad8c5d019a4b64f3d\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\n**Title**: \\\\\\\\u{201c}NEAR x IBC Smart Contracts on NEAR\\\\\\\\u{201c}\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\n**Summary**:\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\nAt Moonstruck, our goal is to bring the existing implementation of NEAR IBC to a working, production ready state and offer maintenance and support for teams looking to integrate. Furthermore, we would love to work with the NEAR and Cosmos ecosystems and communities to further expand upon this foundation towards a future V2 of this protocol.\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\n\\\\\\\\u{2014}\\\\\\\\u{2014}\\\\\\\\u{2014}\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\nRead the full proposal and share your feedback on [DevHub](/devhub.near/widget/app?page=proposal&id=17)\\\\\\\\\\\\\\\"}\"}, \"index\": {\"post\": \"{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"main\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"md\\\\\\\\\\\\\\\"}}\"}}}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 2.2451757450795e+21
    }
  },
  {
    "id": "8139757146",
    "receipt_id": "8P2PTth7756jyRuoEnjW9qH5thmdZehqFbTwnCatwyrK",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "7dNxwSocvmT34ej6bAspbMjTvnMiYgfi34ppqdSfQzAT",
      "block_height": 127574884,
      "block_timestamp": 1725799209133980400
    },
    "receipt_outcome": {
      "gas_burnt": 4743320710079,
      "tokens_burnt": 474332071007900000000,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "5oJvnkMvD6FPuDoLA4i4CCEfTyLZsWQ5LeYfrXhxN9XD",
    "included_in_block_hash": "AUeTGNBNqJq9z2yWQxTF2D2KdASg5NC8CxQqsXsQcxdi",
    "block_timestamp": "1725799207036503020",
    "block": {
      "block_height": 127574882
    },
    "receipt_conversion_tokens_burnt": "110766771683500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set_block_height_callback",
        "deposit": 0,
        "fee": 474332071007900000000,
        "args": "{\"proposal\": {\"id\": 17, \"snapshot\": {\"name\": \"NEAR x IBC Smart Contracts on NEAR\", \"labels\": [\"Bridges\", \"Other\"], \"summary\": \"At Moonstruck, our goal is to bring the existing implementation of NEAR IBC to a working, production ready state and offer maintenance and support for teams looking to integrate. Furthermore, we would love to work with the NEAR and Cosmos ecosystems and communities to further expand upon this foundation towards a future V2 of this protocol.\", \"category\": \"Infrastructure Committee\", \"timeline\": {\"status\": \"DRAFT\"}, \"editor_id\": \"bb5142ca412fb51a03ae4523f8f3dc77047d29e63c1c9e1ad8c5d019a4b64f3d\", \"timestamp\": \"1725799208133646192\", \"linked_rfp\": null, \"supervisor\": null, \"description\": \"## Organization\\\\\\\\n\\\\\\\\n### Primary person\\\\\\\\\\\\'s contact information\\\\\\\\n\\\\\\\\n**Strahinja Vukoi\\\\\\\\u{10d}i\\\\\\\\u{107} (CEO)**  \\\\\\\\nTelegram:   @StrahinjaVukoicic  \\\\\\\\nEmail:      strahinja@moonstruck.io\\\\\\\\n\\\\\\\\n### Size of the whole team\\\\\\\\n\\\\\\\\nMOONSTRUCK has a total of 33 employees, not including external contractors (consultants, auditors, UI/UX experts).\\\\\\\\n\\\\\\\\n### Size of the engineering team\\\\\\\\n\\\\\\\\nMOONSTRUCK has a total of 25 engineers available in full time roles.\\\\\\\\n\\\\\\\\n### Team location\\\\\\\\n\\\\\\\\nBelgrade, Serbia\\\\\\\\n\\\\\\\\n### Team background and bios\\\\\\\\n\\\\\\\\nSelected team member CVs:\\\\\\\\n\\\\\\\\n- Pavle Batuta \\\\\\\\\\\\\\\\- [1\\\\\\\\\\\\\\\\. CV - Pavle Batuta.pdf](https://drive.google.com/file/d/1HC35s5Nz1KS7Xr9NIJsBCfE2JScLm1gt/view?usp=sharing)  \\\\\\\\n- Bogdan Ilic \\\\\\\\\\\\\\\\- [2\\\\\\\\\\\\\\\\. CV - Bogdan Ilic\\\\\\\\u{301}.pdf](https://drive.google.com/file/d/12HmM7oMkYx6rbI7U5a6Ds\\\\\\\\\\\\\\\\_QqiKo2qsyT/view?usp=sharing)  \\\\\\\\n- Emil Bob \\\\\\\\\\\\\\\\- [3\\\\\\\\\\\\\\\\. CV - Emil Bob.pdf](https://drive.google.com/file/d/1v5jaqXpRzmbCivydxEyKgiPeGMSPEXN1/view?usp=sharing)  \\\\\\\\n- Stefan Latinovic \\\\\\\\\\\\\\\\- [4\\\\\\\\\\\\\\\\. CV - Stefan Latinovic\\\\\\\\u{301}.pdf](https://drive.google.com/file/d/1E3aahumuXfA\\\\\\\\\\\\\\\\_\\\\\\\\\\\\\\\\_wvdhQbOvjJHjxAl65Tu/view?usp=sharing)\\\\\\\\n\\\\\\\\n### Any affiliations with other NEAR ecosystem partners?\\\\\\\\n\\\\\\\\nMOONSTRUCK has had an open collaboration with NEAR Balkans Hub for almost 3 years, pretty much from the onset, helping to promote NEAR\\\\\\\\u{2019}s technology and ecosystem. Our company facilitated the first ever technical workshop about NEAR for software engineers in Serbia. During the ETH Belgrade and Belgrade Blockchain Week 2023, our company provided a venue for \\\\\\\\u{201c}NEAR Day\\\\\\\\u{201d} and \\\\\\\\u{201c}BOS Workshop\\\\\\\\u{201d} held by NEAR\\\\\\\\u{2019}s experts.\\\\\\\\n\\\\\\\\n## Professional Experience\\\\\\\\n\\\\\\\\n### Examples of relevant experience with NEAR blockchain\\\\\\\\n\\\\\\\\nMOONSTRUCK has not deployed a production-level project on NEAR blockchain; however, 7 engineers from our company have passed the training in BOS and have experience in building BOS components. Team proposed for this project is very familiar with NEAR architecture and latest technical documentation.\\\\\\\\n\\\\\\\\n### Non-technical capabilities:\\\\\\\\n\\\\\\\\nMOONSTRUCK has consistently strived to connect and bring together the Web3 community in the SEE region and participate in various programs to empower teams and individuals, thus cultivating our own talent.\\\\\\\\n\\\\\\\\n**Web3 Supercluster**  \\\\\\\\nMOONSTRUCK is the founding member of Web3 Supercluster, a part of the \\\\\\\\u{201c}Serbia Innovates\\\\\\\\u{201d} program supported by USAID that seeks to strengthen the Serbian economy through R\\\\\\\\\\\\\\\\&D collaboration, education and skills development in the deep tech domain.\\\\\\\\n\\\\\\\\n**Web 2.5 Academy**  \\\\\\\\nMOONSTRUCK holds a Web 2.5 Academy, aimed at enabling the inclusion of a wide range of participants with basic programming skills and directing them towards Web3 technologies, providing intrinsic knowledge in blockchain architecture, consensus mechanism, smart contracts and tooling. For the past 2 years, we have held 3 cohorts and trained more than 400 participants.\\\\\\\\n\\\\\\\\n**Moonwalk**  \\\\\\\\nMOONSTRUCK has a four-month internship program Moonwalk, which is designed to bring out the best from a small group of selected candidates from our yearly educational programs.\\\\\\\\n\\\\\\\\n**Glue**  \\\\\\\\nGlue, our Web3 acceleration program, is the premier launchpad for emerging teams and projects, emphasizing technology excellence and hands-on learning process under guidance of our mentors.\\\\\\\\n\\\\\\\\n**Guesthouse**  \\\\\\\\nGuesthouse by MOONSTRUCK is held every year during Belgrade Blockchain Week. It represents a series of side events that cover relevant topics in the Web3 and Blockchain industry. For the past 2 years, we hosted 25 impactful events, engaging over 300 participants in workshops, discussions, presentations, training, etc. With the support from NEAR, Chainlink, ICP, Sui, Superchain and many other valued partners, we brought the Guesthouse event to life.\\\\\\\\n\\\\\\\\n### Portfolio of relevant work\\\\\\\\n\\\\\\\\n**Swarm** \\\\\\\\\\\\\\\\- Decentralised Storage Service by Ethereum Foundation.\\\\\\\\n\\\\\\\\n**Giveth** \\\\\\\\\\\\\\\\- Cryptocurrency donation platform and DeFi protocol that rewards donors of verified public goods projects.\\\\\\\\n\\\\\\\\n**Bitcoin.com** \\\\\\\\\\\\\\\\- Automated Market Maker (AMM).\\\\\\\\n\\\\\\\\n**Hundrx** \\\\\\\\\\\\\\\\- Web3 extension for Twitter (X) enabling tokenization of profiles and enhanced interaction between influencers and followers via social tokens.\\\\\\\\n\\\\\\\\n**AgAu** \\\\\\\\\\\\\\\\- RWA digital platform for tokenization of investment gold and precious metals with fully collateralized cryptocurrency.\\\\\\\\n\\\\\\\\n**DeFire** \\\\\\\\\\\\\\\\- DEX aggregation platform for transaction optimization.\\\\\\\\n\\\\\\\\n**Tycoon** \\\\\\\\\\\\\\\\- Social crypto trading platform and cryptocurrency.\\\\\\\\n\\\\\\\\n**Renfter** \\\\\\\\\\\\\\\\- Uncollateralized NFT Renting Protocol.\\\\\\\\n\\\\\\\\n**Libertas** \\\\\\\\\\\\\\\\- Infrastructure and Protocol for TSF proof-of-work blockchain (L1).\\\\\\\\n\\\\\\\\n**Disberse** \\\\\\\\\\\\\\\\- Transparency on-chain platform for tracking means of public funding.\\\\\\\\n\\\\\\\\n**Asphodel** \\\\\\\\\\\\\\\\- Metaverse on-chain game.\\\\\\\\n\\\\\\\\n**Kamigotchi World** \\\\\\\\\\\\\\\\- DAO governed on-chain game.\\\\\\\\n\\\\\\\\n**Mirage Protocol** \\\\\\\\\\\\\\\\- Universal multichain asset-mirroring protocol.\\\\\\\\n\\\\\\\\n**TRAKEN** \\\\\\\\\\\\\\\\- Renewable energy aggregation and trading platform for smart electrical grids based on blockchain technology, enabling power purchasing agreements execution in the form of smart contracts.\\\\\\\\n\\\\\\\\n## Body\\\\\\\\n\\\\\\\\nWe propose to inherit the current implementation of the NEAR \\\\\\\\\\\\\\\\- IBC protocol, previously built by [Octopus Network](https://oct.network/) and prepare it for mainnet production as a version 1.0 release candidate. Furthermore, we would like to offer our services, collaborate with the relevant stakeholders in the Cosmos ecosystem and work towards developing further production releases with new features built in tight cooperation. Finally, we would like to commit a team towards long term maintenance and support of the project \\\\\\\\\\\\\\\\- including documentation\\\\\\\\n\\\\\\\\nThe NEAR \\\\\\\\\\\\\\\\- IBC protocol is the NEAR implementation of the IBC protocol transport layer (IBC/TAO). The project integrates the implementation of the IBC protocol based Inter-Blockchain Communication fungible token transfer application (ICS20) to link the NEAR and Cosmos ecosystems, bringing greater composability to the innovation of the entire interchain blockchain Internet.\\\\\\\\n\\\\\\\\nMore information on the original project iteration is available on the accompanying [Octopus network Medium post.](https://medium.com/omnity/introduction-to-near-ibc-how-to-implement-the-ibc-protocol-with-smart-contracts-a8b0e13cb886)\\\\\\\\n\\\\\\\\nOur team has performed an extensive gap analysis and research of the current implementation version and has compiled a [gap analysis report](https://docs.google.com/document/d/1icI44qEgX3srzjx5EJQJs6LJRYy1-H96t4zzwh99\\\\\\\\\\\\\\\\_28/edit?usp=sharing) with our findings.\\\\\\\\n\\\\\\\\nWe intend to release the codebase under a permissive open source license. We intend to discuss with the NEAR foundation and any other relevant stakeholders on the exact choice of the license we will be selecting.\\\\\\\\n\\\\\\\\nThere are currently at least two teams looking to utilize NEAR IBC as a solution. Our goal is to help these initial early adopters to achieve success and build a strong foundation for supporting other teams in the future.\\\\\\\\n\\\\\\\\n## Goals / Milestones\\\\\\\\n\\\\\\\\n### Project Goals\\\\\\\\n\\\\\\\\nWe define two major goals for this proposal: **release** and **maintenance**.\\\\\\\\n\\\\\\\\nOur **primary release goal** is to prepare a mainnet ready **NEAR IBC v1.0 release candidate** and deploy it into production on time and at quality. The release candidate should \\\\\\\\n\\\\\\\\n- implement all of the features of the NEAR IBC protocol spec   \\\\\\\\n- successfully pass a security audit by a reputable team (or platform).\\\\\\\\n\\\\\\\\nOur **secondary release goal(s)** are to support teams looking to integrate NEAR IBC into their products and protocols by well produced and detailed developer documentation as well as a working prototype (proof of concept) console based application as a reference.\\\\\\\\n\\\\\\\\nOur **maintenance goal** is to commit a team to maintain the NEAR IBC project after the release candidate: fix bugs and security issues, prepare new releases, update and maintain documentation and provide first or second line support to teams that are using the protocol as a part of their solutions.\\\\\\\\n\\\\\\\\nBeyond our immediate goals, we wish to extend the current implementation towards a V2 release with the support of teams in the Cosmos ecosystem. With that in mind, we will ensure that the implementation stays clear and extensible towards future features and upgrades.\\\\\\\\n\\\\\\\\nTo that end we propose the project be divided into two phases: active development and maintenance cycle.\\\\\\\\n\\\\\\\\n### Milestones\\\\\\\\n\\\\\\\\nWe propose the following milestones:\\\\\\\\n\\\\\\\\n- Alpha release: constitutes a version with a working happy path that can be tested in a local environment  \\\\\\\\n- V1 release candidate: constitutes a version with a demonstration PoC that is deployed to a testnet environment and is ready for an audit\\\\\\\\n\\\\\\\\nThese milestones are based on our current understanding of the project and objectives and priorities. We invite the infrastructure team and the NEAR Foundation to help us define clearer milestones for delivery based on ecosystem priorities and shared understanding.\\\\\\\\n\\\\\\\\n### Reporting\\\\\\\\n\\\\\\\\nDuring the **release phase** of the project, we suggest regular **2 week** intervals for reporting on the project status, coinciding with the **end of each working sprint**.\\\\\\\\n\\\\\\\\nAs part of the report, the team would present (in agreed upon forum and format) the progress of the project, including any demonstration of functionality that can be performed. The project management team will also open a retrospective of the sprint, with the ability to discuss delivery velocity, risks or potential changes of scope.\\\\\\\\n\\\\\\\\nDuring the **support/maintenance** phase of the project, we suggest **monthly status updates** of work done: security and bug fixes, tech debt resolved, issues reported by the community etc.\\\\\\\\n\\\\\\\\nWe invite the Infrastructure Board and the NEAR Foundation to help us propose a clear and detailed way of reporting for the project.\\\\\\\\n\\\\\\\\n### Engineering Estimation\\\\\\\\n\\\\\\\\nBased on the above gap analysis conclusions, we are able to suggest a provisional delivery scope and provide an expert estimation on engagement with development roles required.\\\\\\\\n\\\\\\\\n#### Provisional Scope\\\\\\\\n\\\\\\\\nWe recommend the following scope of work in order to complete the project into a working solution.\\\\\\\\n\\\\\\\\n##### Required\\\\\\\\n\\\\\\\\n1. Identify any and all components that need to be replaced from the project  \\\\\\\\n2. Determine development/integration/mitigation for the project  \\\\\\\\n3. Bring the project into a working state  \\\\\\\\n4. Implement a minimal testing framework with essential coverage  \\\\\\\\n5. Document a testing procedure for the project and perform smoke testing  \\\\\\\\n6. Upgrade the deployment procedure  \\\\\\\\n7. Provide documentation to changes  \\\\\\\\n8. Deploy solution to testnet  \\\\\\\\n9. Scope and implement a minimal PoC (terminal based)\\\\\\\\n\\\\\\\\n##### Optional\\\\\\\\n\\\\\\\\n1. Implement a full CI/CD release pipeline  \\\\\\\\n2. Implement deployment automation  \\\\\\\\n3. Implement full test coverage  \\\\\\\\n4. Add static analysis in manual or automated form  \\\\\\\\n5. Prepare separate detailed development documentation (for V1)  \\\\\\\\n6. Prepare examples for use  \\\\\\\\n7. Scope and implement a full PoC Dapp\\\\\\\\n\\\\\\\\n#### Definition of Done\\\\\\\\n\\\\\\\\nWe consider the solution as ready for release when it is deployed on a public/available testnet, with released code and artifacts in a state that is ready for audit or early integration. This functionally equates to a testnet release.\\\\\\\\n\\\\\\\\nThis release constitutes a fully delivered project.\\\\\\\\n\\\\\\\\nThe release includes a **working PoC** with demonstrable functionality.\\\\\\\\n\\\\\\\\nThe release does not depend upon audits and integrations with third parties.\\\\\\\\n\\\\\\\\nMOONSTRUCK will be fully committed to assist with any work required to fix any security issues discovered as well as integration to other projects.\\\\\\\\n\\\\\\\\n#### Level of Effort and Timeline \\\\\\\\\\\\\\\\- Development Phase\\\\\\\\n\\\\\\\\nBased on the provisional scope of the project and the expert estimation we are able to provide a provisional engagement for the project with required roles and effort.\\\\\\\\n\\\\\\\\nThis project would be handled by a single Agile pod team with the project being their sole focus during the active development phase. Beyond that, experts will be made available to the pod based on task and project requirements. These team members constitute core and support roles:\\\\\\\\n\\\\\\\\n##### Core Roles\\\\\\\\n\\\\\\\\n| Role | Responsibilities | Effort |\\\\\\\\n| :---- | :---- | :---- |\\\\\\\\n| Project Lead, Blockchain Architect | Leadership, reporting, development | Part Time |\\\\\\\\n| Blockchain Engineer | Development, testing | Full Time |\\\\\\\\n| Blockchain Engineer | Development, testing | Full Time |\\\\\\\\n\\\\\\\\n##### Support Roles\\\\\\\\n\\\\\\\\n| Role | Responsibilities | Effort |\\\\\\\\n| :---- | :---- | :---- |\\\\\\\\n| Engineer in Test | Test automation | Part Time |\\\\\\\\n| Technical Writer | Documentation | Part Time |\\\\\\\\n| Devops | CI/CD, project deployment | Part Time |\\\\\\\\n\\\\\\\\n##### Timeline\\\\\\\\n\\\\\\\\nWe suggest the following timeline for the project, measured in **two week sprints**:\\\\\\\\n\\\\\\\\n| Sprints | Description | Goals |\\\\\\\\n| :---- | :---- | :---- |\\\\\\\\n| 1 | Finish gap analysis, perform spikes and fill backlog | Initial task backlog |\\\\\\\\n| 2, 3 | Perform smoke testing, write test scenarios, write automated tests, set up initial CI/CD, tech debt analysis | Alpha w/ demonstration capability, basic CI/CD pipeline |\\\\\\\\n| 4, 5 | Improved test coverage, tech debt resolution tasks, initial documentation, PoC candidate planning | Basic prototype w/ demonstration capability, documentation, PoC plan |\\\\\\\\n| 6 | PoC development, deployment to testnet, developer documentation, examples | Release Candidate: deployed to testnet w/ working PoC |\\\\\\\\n\\\\\\\\nTotal estimate for delivery of the **proposed scope for V1** amounts to **three months** of effort for the engaged team.\\\\\\\\n\\\\\\\\n##### Release schedule\\\\\\\\n\\\\\\\\n| Release | End of sprint | Goal |\\\\\\\\n| :---- | :---- | :---- |\\\\\\\\n| Alpha | 3 | Local release with a demonstrable happy path available |\\\\\\\\n| RC1 | 6 | Fully featured V1 release deployed to testnet with a working PoC |\\\\\\\\n\\\\\\\\n#### Level of Effort and Timeline \\\\\\\\\\\\\\\\- Support Phase\\\\\\\\n\\\\\\\\nAfter the release, we would assign a maintenance team to support the V1 release, ensuring it is working to spec and assisting other development teams with integration. Maintenance will also cover a certain amount of tech debt resolution from the development phase. This role includes redundant effort to ensure availability of support.\\\\\\\\n\\\\\\\\n##### Support Roles\\\\\\\\n\\\\\\\\n| Role | Responsibilities | Effort |\\\\\\\\n| :---- | :---- | :---- |\\\\\\\\n| Blockchain Engineer | Maintenance and support | Part time |\\\\\\\\n| Blockchain Engineer | Maintenance and support | Part time |\\\\\\\\n\\\\\\\\nWe would commit the core support roles to work on maintenance and support tasks for a period of **nine months**.\\\\\\\\n\\\\\\\\n#### Commentary\\\\\\\\n\\\\\\\\nMoonstruck wishes to engage and own this project long term. Our goal is to support the expansion of this protocol towards V2 and beyond. Therefore one of the primary outcomes of working on V1 is to get the team acquainted with an expert level of understanding of the underlying protocol, technology and concepts.\\\\\\\\n\\\\\\\\nOur hope is to reach a level of understanding towards our provisional scope and best-effort analysis as well as continuous improvements towards the protocol with a close relations\\\\\\\\n\\\\\\\\n## Budget\\\\\\\\n\\\\\\\\n### Budget Total\\\\\\\\n\\\\\\\\nWe have estimated the total budget for the project as:\\\\\\\\n\\\\\\\\n- **USD 98.000** for the development phase (over 3 months)  \\\\\\\\n- **USD 72.000** for the support phase (over 9 months)\\\\\\\\n\\\\\\\\nFor a total of ***USD 170.000*** over a period of 1 year.\\\\\\\\n\\\\\\\\n### Budget Breakdown\\\\\\\\n\\\\\\\\nWe suggest the following budget breakdown and payment structure:\\\\\\\\n\\\\\\\\nFor the development phase we suggest the following payouts:\\\\\\\\n\\\\\\\\n| Milestone | Time of payment (after project start) | Amount |\\\\\\\\n| :---- | :---- | :---- |\\\\\\\\n| Alpha | 1.5 months | USD 50.000 |\\\\\\\\n| RC1 | 3 months | USD 48.000 |\\\\\\\\n\\\\\\\\n| Total | USD 98.000 |\\\\\\\\n| :---- | :---- |\\\\\\\\n\\\\\\\\nFor the support phase we suggest the following retainer for the next ***9 months***.\\\\\\\\n\\\\\\\\n| Item | Recurring | Amount |\\\\\\\\n| :---- | :---- | :---- |\\\\\\\\n| Engineering Support | Monthly (x9) | USD 8000 |\\\\\\\\n\\\\\\\\n| Total | 72.000 |\\\\\\\\n| :---- | :---- |\\\\\\\\n\\\\\\\\n\", \"linked_proposals\": [], \"receiver_account\": \"bb5142ca412fb51a03ae4523f8f3dc77047d29e63c1c9e1ad8c5d019a4b64f3d\", \"requested_sponsor\": \"infrastructure-committee.near\", \"proposal_body_version\": \"V1\", \"requested_sponsorship_usd_amount\": \"170000\", \"requested_sponsorship_paid_in_currency\": \"USDC\"}, \"author_id\": \"bb5142ca412fb51a03ae4523f8f3dc77047d29e63c1c9e1ad8c5d019a4b64f3d\", \"snapshot_history\": [], \"social_db_post_block_height\": \"0\"}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 2.2451757450795e+21
    }
  },
  {
    "id": "8139757147",
    "receipt_id": "4qkWPhoRZVCHtTpjwyCE5315cB5j4jPtBRNHy3Xm1HQP",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "social.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "7dNxwSocvmT34ej6bAspbMjTvnMiYgfi34ppqdSfQzAT",
      "block_height": 127574884,
      "block_timestamp": 1725799209133980400
    },
    "receipt_outcome": {
      "gas_burnt": 3556993987491,
      "tokens_burnt": 355699398749100000000,
      "executor_account_id": "social.near",
      "status": true
    },
    "transaction_hash": "5oJvnkMvD6FPuDoLA4i4CCEfTyLZsWQ5LeYfrXhxN9XD",
    "included_in_block_hash": "AUeTGNBNqJq9z2yWQxTF2D2KdASg5NC8CxQqsXsQcxdi",
    "block_timestamp": "1725799207036503020",
    "block": {
      "block_height": 127574882
    },
    "receipt_conversion_tokens_burnt": "110766771683500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set",
        "deposit": 0,
        "fee": 355699398749100000000,
        "args": "{\"data\": {\"infrastructure-committee.near\": {\"index\": {\"notify\": \"[{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"StrahinjaVukoicic\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"proposal/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"proposal\\\\\\\\\\\\\\\":17,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"bb5142ca412fb51a03ae4523f8f3dc77047d29e63c1c9e1ad8c5d019a4b64f3d\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"moonstruck.io\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"proposal/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"proposal\\\\\\\\\\\\\\\":17,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"bb5142ca412fb51a03ae4523f8f3dc77047d29e63c1c9e1ad8c5d019a4b64f3d\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"proposal/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"proposal\\\\\\\\\\\\\\\":17,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"bb5142ca412fb51a03ae4523f8f3dc77047d29e63c1c9e1ad8c5d019a4b64f3d\\\\\\\\\\\\\\\"}}]\"}}}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 2.2451757450795e+21
    }
  },
  {
    "id": "8139762922",
    "receipt_id": "AZCr5Th1dZkgESkYFa22QS9RHAEQ4CPxkuF1iTBPDWyJ",
    "predecessor_account_id": "bb5142ca412fb51a03ae4523f8f3dc77047d29e63c1c9e1ad8c5d019a4b64f3d",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "8ihJr36917kr5yvfEkZfXMg6e49sBb3GumHoWur5snWo",
      "block_height": 127574893,
      "block_timestamp": 1725799219013017300
    },
    "receipt_outcome": {
      "gas_burnt": 8327839460805,
      "tokens_burnt": 832783946080500000000,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "Dyh6rLZDrWGFroqwMdunDWMYq85dE99ojSJFMFW8p6J4",
    "included_in_block_hash": "FSQZB5ikrjzmZ2gM24YKjT94Pej5czYAeE19HrAn8umk",
    "block_timestamp": "1725799217825300381",
    "block": {
      "block_height": 127574892
    },
    "receipt_conversion_tokens_burnt": "110766771683500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "add_proposal",
        "deposit": 0,
        "fee": 832783946080500000000,
        "args": "{\"body\": {\"name\": \"NEAR x IBC Smart Contracts on NEAR\", \"summary\": \"At Moonstruck, our goal is to bring the existing implementation of NEAR IBC to a working, production ready state and offer maintenance and support for teams looking to integrate. Furthermore, we would love to work with the NEAR and Cosmos ecosystems and communities to further expand upon this foundation towards a future V2 of this protocol.\", \"category\": \"Infrastructure Committee\", \"timeline\": {\"status\": \"DRAFT\"}, \"supervisor\": null, \"description\": \"## Organization\\\\\\\\n\\\\\\\\n### Primary person\\\\\\\\\\\\'s contact information\\\\\\\\n\\\\\\\\n**Strahinja Vukoi\\\\\\\\u{10d}i\\\\\\\\u{107} (CEO)**  \\\\\\\\nTelegram:   @StrahinjaVukoicic  \\\\\\\\nEmail:      strahinja@moonstruck.io\\\\\\\\n\\\\\\\\n### Size of the whole team\\\\\\\\n\\\\\\\\nMOONSTRUCK has a total of 33 employees, not including external contractors (consultants, auditors, UI/UX experts).\\\\\\\\n\\\\\\\\n### Size of the engineering team\\\\\\\\n\\\\\\\\nMOONSTRUCK has a total of 25 engineers available in full time roles.\\\\\\\\n\\\\\\\\n### Team location\\\\\\\\n\\\\\\\\nBelgrade, Serbia\\\\\\\\n\\\\\\\\n### Team background and bios\\\\\\\\n\\\\\\\\nSelected team member CVs:\\\\\\\\n\\\\\\\\n- Pavle Batuta \\\\\\\\\\\\\\\\- [1\\\\\\\\\\\\\\\\. CV - Pavle Batuta.pdf](https://drive.google.com/file/d/1HC35s5Nz1KS7Xr9NIJsBCfE2JScLm1gt/view?usp=sharing)  \\\\\\\\n- Bogdan Ilic \\\\\\\\\\\\\\\\- [2\\\\\\\\\\\\\\\\. CV - Bogdan Ilic\\\\\\\\u{301}.pdf](https://drive.google.com/file/d/12HmM7oMkYx6rbI7U5a6Ds\\\\\\\\\\\\\\\\_QqiKo2qsyT/view?usp=sharing)  \\\\\\\\n- Emil Bob \\\\\\\\\\\\\\\\- [3\\\\\\\\\\\\\\\\. CV - Emil Bob.pdf](https://drive.google.com/file/d/1v5jaqXpRzmbCivydxEyKgiPeGMSPEXN1/view?usp=sharing)  \\\\\\\\n- Stefan Latinovic \\\\\\\\\\\\\\\\- [4\\\\\\\\\\\\\\\\. CV - Stefan Latinovic\\\\\\\\u{301}.pdf](https://drive.google.com/file/d/1E3aahumuXfA\\\\\\\\\\\\\\\\_\\\\\\\\\\\\\\\\_wvdhQbOvjJHjxAl65Tu/view?usp=sharing)\\\\\\\\n\\\\\\\\n### Any affiliations with other NEAR ecosystem partners?\\\\\\\\n\\\\\\\\nMOONSTRUCK has had an open collaboration with NEAR Balkans Hub for almost 3 years, pretty much from the onset, helping to promote NEAR\\\\\\\\u{2019}s technology and ecosystem. Our company facilitated the first ever technical workshop about NEAR for software engineers in Serbia. During the ETH Belgrade and Belgrade Blockchain Week 2023, our company provided a venue for \\\\\\\\u{201c}NEAR Day\\\\\\\\u{201d} and \\\\\\\\u{201c}BOS Workshop\\\\\\\\u{201d} held by NEAR\\\\\\\\u{2019}s experts.\\\\\\\\n\\\\\\\\n## Professional Experience\\\\\\\\n\\\\\\\\n### Examples of relevant experience with NEAR blockchain\\\\\\\\n\\\\\\\\nMOONSTRUCK has not deployed a production-level project on NEAR blockchain; however, 7 engineers from our company have passed the training in BOS and have experience in building BOS components. Team proposed for this project is very familiar with NEAR architecture and latest technical documentation.\\\\\\\\n\\\\\\\\n### Non-technical capabilities:\\\\\\\\n\\\\\\\\nMOONSTRUCK has consistently strived to connect and bring together the Web3 community in the SEE region and participate in various programs to empower teams and individuals, thus cultivating our own talent.\\\\\\\\n\\\\\\\\n**Web3 Supercluster**  \\\\\\\\nMOONSTRUCK is the founding member of Web3 Supercluster, a part of the \\\\\\\\u{201c}Serbia Innovates\\\\\\\\u{201d} program supported by USAID that seeks to strengthen the Serbian economy through R\\\\\\\\\\\\\\\\&D collaboration, education and skills development in the deep tech domain.\\\\\\\\n\\\\\\\\n**Web 2.5 Academy**  \\\\\\\\nMOONSTRUCK holds a Web 2.5 Academy, aimed at enabling the inclusion of a wide range of participants with basic programming skills and directing them towards Web3 technologies, providing intrinsic knowledge in blockchain architecture, consensus mechanism, smart contracts and tooling. For the past 2 years, we have held 3 cohorts and trained more than 400 participants.\\\\\\\\n\\\\\\\\n**Moonwalk**  \\\\\\\\nMOONSTRUCK has a four-month internship program Moonwalk, which is designed to bring out the best from a small group of selected candidates from our yearly educational programs.\\\\\\\\n\\\\\\\\n**Glue**  \\\\\\\\nGlue, our Web3 acceleration program, is the premier launchpad for emerging teams and projects, emphasizing technology excellence and hands-on learning process under guidance of our mentors.\\\\\\\\n\\\\\\\\n**Guesthouse**  \\\\\\\\nGuesthouse by MOONSTRUCK is held every year during Belgrade Blockchain Week. It represents a series of side events that cover relevant topics in the Web3 and Blockchain industry. For the past 2 years, we hosted 25 impactful events, engaging over 300 participants in workshops, discussions, presentations, training, etc. With the support from NEAR, Chainlink, ICP, Sui, Superchain and many other valued partners, we brought the Guesthouse event to life.\\\\\\\\n\\\\\\\\n### Portfolio of relevant work\\\\\\\\n\\\\\\\\n**Swarm** \\\\\\\\\\\\\\\\- Decentralised Storage Service by Ethereum Foundation.\\\\\\\\n\\\\\\\\n**Giveth** \\\\\\\\\\\\\\\\- Cryptocurrency donation platform and DeFi protocol that rewards donors of verified public goods projects.\\\\\\\\n\\\\\\\\n**Bitcoin.com** \\\\\\\\\\\\\\\\- Automated Market Maker (AMM).\\\\\\\\n\\\\\\\\n**Hundrx** \\\\\\\\\\\\\\\\- Web3 extension for Twitter (X) enabling tokenization of profiles and enhanced interaction between influencers and followers via social tokens.\\\\\\\\n\\\\\\\\n**AgAu** \\\\\\\\\\\\\\\\- RWA digital platform for tokenization of investment gold and precious metals with fully collateralized cryptocurrency.\\\\\\\\n\\\\\\\\n**DeFire** \\\\\\\\\\\\\\\\- DEX aggregation platform for transaction optimization.\\\\\\\\n\\\\\\\\n**Tycoon** \\\\\\\\\\\\\\\\- Social crypto trading platform and cryptocurrency.\\\\\\\\n\\\\\\\\n**Renfter** \\\\\\\\\\\\\\\\- Uncollateralized NFT Renting Protocol.\\\\\\\\n\\\\\\\\n**Libertas** \\\\\\\\\\\\\\\\- Infrastructure and Protocol for TSF proof-of-work blockchain (L1).\\\\\\\\n\\\\\\\\n**Disberse** \\\\\\\\\\\\\\\\- Transparency on-chain platform for tracking means of public funding.\\\\\\\\n\\\\\\\\n**Asphodel** \\\\\\\\\\\\\\\\- Metaverse on-chain game.\\\\\\\\n\\\\\\\\n**Kamigotchi World** \\\\\\\\\\\\\\\\- DAO governed on-chain game.\\\\\\\\n\\\\\\\\n**Mirage Protocol** \\\\\\\\\\\\\\\\- Universal multichain asset-mirroring protocol.\\\\\\\\n\\\\\\\\n**TRAKEN** \\\\\\\\\\\\\\\\- Renewable energy aggregation and trading platform for smart electrical grids based on blockchain technology, enabling power purchasing agreements execution in the form of smart contracts.\\\\\\\\n\\\\\\\\n## Body\\\\\\\\n\\\\\\\\nWe propose to inherit the current implementation of the NEAR \\\\\\\\\\\\\\\\- IBC protocol, previously built by [Octopus Network](https://oct.network/) and prepare it for mainnet production as a version 1.0 release candidate. Furthermore, we would like to offer our services, collaborate with the relevant stakeholders in the Cosmos ecosystem and work towards developing further production releases with new features built in tight cooperation. Finally, we would like to commit a team towards long term maintenance and support of the project \\\\\\\\\\\\\\\\- including documentation\\\\\\\\n\\\\\\\\nThe NEAR \\\\\\\\\\\\\\\\- IBC protocol is the NEAR implementation of the IBC protocol transport layer (IBC/TAO). The project integrates the implementation of the IBC protocol based Inter-Blockchain Communication fungible token transfer application (ICS20) to link the NEAR and Cosmos ecosystems, bringing greater composability to the innovation of the entire interchain blockchain Internet.\\\\\\\\n\\\\\\\\nMore information on the original project iteration is available on the accompanying [Octopus network Medium post.](https://medium.com/omnity/introduction-to-near-ibc-how-to-implement-the-ibc-protocol-with-smart-contracts-a8b0e13cb886)\\\\\\\\n\\\\\\\\nOur team has performed an extensive gap analysis and research of the current implementation version and has compiled a [gap analysis report](https://docs.google.com/document/d/1icI44qEgX3srzjx5EJQJs6LJRYy1-H96t4zzwh99\\\\\\\\\\\\\\\\_28/edit?usp=sharing) with our findings.\\\\\\\\n\\\\\\\\nWe intend to release the codebase under a permissive open source license. We intend to discuss with the NEAR foundation and any other relevant stakeholders on the exact choice of the license we will be selecting.\\\\\\\\n\\\\\\\\nThere are currently at least two teams looking to utilize NEAR IBC as a solution. Our goal is to help these initial early adopters to achieve success and build a strong foundation for supporting other teams in the future.\\\\\\\\n\\\\\\\\n## Goals / Milestones\\\\\\\\n\\\\\\\\n### Project Goals\\\\\\\\n\\\\\\\\nWe define two major goals for this proposal: **release** and **maintenance**.\\\\\\\\n\\\\\\\\nOur **primary release goal** is to prepare a mainnet ready **NEAR IBC v1.0 release candidate** and deploy it into production on time and at quality. The release candidate should \\\\\\\\n\\\\\\\\n- implement all of the features of the NEAR IBC protocol spec   \\\\\\\\n- successfully pass a security audit by a reputable team (or platform).\\\\\\\\n\\\\\\\\nOur **secondary release goal(s)** are to support teams looking to integrate NEAR IBC into their products and protocols by well produced and detailed developer documentation as well as a working prototype (proof of concept) console based application as a reference.\\\\\\\\n\\\\\\\\nOur **maintenance goal** is to commit a team to maintain the NEAR IBC project after the release candidate: fix bugs and security issues, prepare new releases, update and maintain documentation and provide first or second line support to teams that are using the protocol as a part of their solutions.\\\\\\\\n\\\\\\\\nBeyond our immediate goals, we wish to extend the current implementation towards a V2 release with the support of teams in the Cosmos ecosystem. With that in mind, we will ensure that the implementation stays clear and extensible towards future features and upgrades.\\\\\\\\n\\\\\\\\nTo that end we propose the project be divided into two phases: active development and maintenance cycle.\\\\\\\\n\\\\\\\\n### Milestones\\\\\\\\n\\\\\\\\nWe propose the following milestones:\\\\\\\\n\\\\\\\\n- Alpha release: constitutes a version with a working happy path that can be tested in a local environment  \\\\\\\\n- V1 release candidate: constitutes a version with a demonstration PoC that is deployed to a testnet environment and is ready for an audit\\\\\\\\n\\\\\\\\nThese milestones are based on our current understanding of the project and objectives and priorities. We invite the infrastructure team and the NEAR Foundation to help us define clearer milestones for delivery based on ecosystem priorities and shared understanding.\\\\\\\\n\\\\\\\\n### Reporting\\\\\\\\n\\\\\\\\nDuring the **release phase** of the project, we suggest regular **2 week** intervals for reporting on the project status, coinciding with the **end of each working sprint**.\\\\\\\\n\\\\\\\\nAs part of the report, the team would present (in agreed upon forum and format) the progress of the project, including any demonstration of functionality that can be performed. The project management team will also open a retrospective of the sprint, with the ability to discuss delivery velocity, risks or potential changes of scope.\\\\\\\\n\\\\\\\\nDuring the **support/maintenance** phase of the project, we suggest **monthly status updates** of work done: security and bug fixes, tech debt resolved, issues reported by the community etc.\\\\\\\\n\\\\\\\\nWe invite the Infrastructure Board and the NEAR Foundation to help us propose a clear and detailed way of reporting for the project.\\\\\\\\n\\\\\\\\n### Engineering Estimation\\\\\\\\n\\\\\\\\nBased on the above gap analysis conclusions, we are able to suggest a provisional delivery scope and provide an expert estimation on engagement with development roles required.\\\\\\\\n\\\\\\\\n#### Provisional Scope\\\\\\\\n\\\\\\\\nWe recommend the following scope of work in order to complete the project into a working solution.\\\\\\\\n\\\\\\\\n##### Required\\\\\\\\n\\\\\\\\n1. Identify any and all components that need to be replaced from the project  \\\\\\\\n2. Determine development/integration/mitigation for the project  \\\\\\\\n3. Bring the project into a working state  \\\\\\\\n4. Implement a minimal testing framework with essential coverage  \\\\\\\\n5. Document a testing procedure for the project and perform smoke testing  \\\\\\\\n6. Upgrade the deployment procedure  \\\\\\\\n7. Provide documentation to changes  \\\\\\\\n8. Deploy solution to testnet  \\\\\\\\n9. Scope and implement a minimal PoC (terminal based)\\\\\\\\n\\\\\\\\n##### Optional\\\\\\\\n\\\\\\\\n1. Implement a full CI/CD release pipeline  \\\\\\\\n2. Implement deployment automation  \\\\\\\\n3. Implement full test coverage  \\\\\\\\n4. Add static analysis in manual or automated form  \\\\\\\\n5. Prepare separate detailed development documentation (for V1)  \\\\\\\\n6. Prepare examples for use  \\\\\\\\n7. Scope and implement a full PoC Dapp\\\\\\\\n\\\\\\\\n#### Definition of Done\\\\\\\\n\\\\\\\\nWe consider the solution as ready for release when it is deployed on a public/available testnet, with released code and artifacts in a state that is ready for audit or early integration. This functionally equates to a testnet release.\\\\\\\\n\\\\\\\\nThis release constitutes a fully delivered project.\\\\\\\\n\\\\\\\\nThe release includes a **working PoC** with demonstrable functionality.\\\\\\\\n\\\\\\\\nThe release does not depend upon audits and integrations with third parties.\\\\\\\\n\\\\\\\\nMOONSTRUCK will be fully committed to assist with any work required to fix any security issues discovered as well as integration to other projects.\\\\\\\\n\\\\\\\\n#### Level of Effort and Timeline \\\\\\\\\\\\\\\\- Development Phase\\\\\\\\n\\\\\\\\nBased on the provisional scope of the project and the expert estimation we are able to provide a provisional engagement for the project with required roles and effort.\\\\\\\\n\\\\\\\\nThis project would be handled by a single Agile pod team with the project being their sole focus during the active development phase. Beyond that, experts will be made available to the pod based on task and project requirements. These team members constitute core and support roles:\\\\\\\\n\\\\\\\\n##### Core Roles\\\\\\\\n\\\\\\\\n| Role | Responsibilities | Effort |\\\\\\\\n| :---- | :---- | :---- |\\\\\\\\n| Project Lead, Blockchain Architect | Leadership, reporting, development | Part Time |\\\\\\\\n| Blockchain Engineer | Development, testing | Full Time |\\\\\\\\n| Blockchain Engineer | Development, testing | Full Time |\\\\\\\\n\\\\\\\\n##### Support Roles\\\\\\\\n\\\\\\\\n| Role | Responsibilities | Effort |\\\\\\\\n| :---- | :---- | :---- |\\\\\\\\n| Engineer in Test | Test automation | Part Time |\\\\\\\\n| Technical Writer | Documentation | Part Time |\\\\\\\\n| Devops | CI/CD, project deployment | Part Time |\\\\\\\\n\\\\\\\\n##### Timeline\\\\\\\\n\\\\\\\\nWe suggest the following timeline for the project, measured in **two week sprints**:\\\\\\\\n\\\\\\\\n| Sprints | Description | Goals |\\\\\\\\n| :---- | :---- | :---- |\\\\\\\\n| 1 | Finish gap analysis, perform spikes and fill backlog | Initial task backlog |\\\\\\\\n| 2, 3 | Perform smoke testing, write test scenarios, write automated tests, set up initial CI/CD, tech debt analysis | Alpha w/ demonstration capability, basic CI/CD pipeline |\\\\\\\\n| 4, 5 | Improved test coverage, tech debt resolution tasks, initial documentation, PoC candidate planning | Basic prototype w/ demonstration capability, documentation, PoC plan |\\\\\\\\n| 6 | PoC development, deployment to testnet, developer documentation, examples | Release Candidate: deployed to testnet w/ working PoC |\\\\\\\\n\\\\\\\\nTotal estimate for delivery of the **proposed scope for V1** amounts to **three months** of effort for the engaged team.\\\\\\\\n\\\\\\\\n##### Release schedule\\\\\\\\n\\\\\\\\n| Release | End of sprint | Goal |\\\\\\\\n| :---- | :---- | :---- |\\\\\\\\n| Alpha | 3 | Local release with a demonstrable happy path available |\\\\\\\\n| RC1 | 6 | Fully featured V1 release deployed to testnet with a working PoC |\\\\\\\\n\\\\\\\\n#### Level of Effort and Timeline \\\\\\\\\\\\\\\\- Support Phase\\\\\\\\n\\\\\\\\nAfter the release, we would assign a maintenance team to support the V1 release, ensuring it is working to spec and assisting other development teams with integration. Maintenance will also cover a certain amount of tech debt resolution from the development phase. This role includes redundant effort to ensure availability of support.\\\\\\\\n\\\\\\\\n##### Support Roles\\\\\\\\n\\\\\\\\n| Role | Responsibilities | Effort |\\\\\\\\n| :---- | :---- | :---- |\\\\\\\\n| Blockchain Engineer | Maintenance and support | Part time |\\\\\\\\n| Blockchain Engineer | Maintenance and support | Part time |\\\\\\\\n\\\\\\\\nWe would commit the core support roles to work on maintenance and support tasks for a period of **nine months**.\\\\\\\\n\\\\\\\\n#### Commentary\\\\\\\\n\\\\\\\\nMoonstruck wishes to engage and own this project long term. Our goal is to support the expansion of this protocol towards V2 and beyond. Therefore one of the primary outcomes of working on V1 is to get the team acquainted with an expert level of understanding of the underlying protocol, technology and concepts.\\\\\\\\n\\\\\\\\nOur hope is to reach a level of understanding towards our provisional scope and best-effort analysis as well as continuous improvements towards the protocol with a close relations\\\\\\\\n\\\\\\\\n## Budget\\\\\\\\n\\\\\\\\n### Budget Total\\\\\\\\n\\\\\\\\nWe have estimated the total budget for the project as:\\\\\\\\n\\\\\\\\n- **USD 98.000** for the development phase (over 3 months)  \\\\\\\\n- **USD 72.000** for the support phase (over 9 months)\\\\\\\\n\\\\\\\\nFor a total of ***USD 170.000*** over a period of 1 year.\\\\\\\\n\\\\\\\\n### Budget Breakdown\\\\\\\\n\\\\\\\\nWe suggest the following budget breakdown and payment structure:\\\\\\\\n\\\\\\\\nFor the development phase we suggest the following payouts:\\\\\\\\n\\\\\\\\n| Milestone | Time of payment (after project start) | Amount |\\\\\\\\n| :---- | :---- | :---- |\\\\\\\\n| Alpha | 1.5 months | USD 50.000 |\\\\\\\\n| RC1 | 3 months | USD 48.000 |\\\\\\\\n\\\\\\\\n| Total | USD 98.000 |\\\\\\\\n| :---- | :---- |\\\\\\\\n\\\\\\\\nFor the support phase we suggest the following retainer for the next ***9 months***.\\\\\\\\n\\\\\\\\n| Item | Recurring | Amount |\\\\\\\\n| :---- | :---- | :---- |\\\\\\\\n| Engineering Support | Monthly (x9) | USD 8000 |\\\\\\\\n\\\\\\\\n| Total | 72.000 |\\\\\\\\n| :---- | :---- |\\\\\\\\n\\\\\\\\n\", \"linked_proposals\": [], \"receiver_account\": \"bb5142ca412fb51a03ae4523f8f3dc77047d29e63c1c9e1ad8c5d019a4b64f3d\", \"requested_sponsor\": \"infrastructure-committee.near\", \"proposal_body_version\": \"V1\", \"requested_sponsorship_usd_amount\": \"170000\", \"requested_sponsorship_paid_in_currency\": \"USDC\"}, \"labels\": [\"Bridges\", \"Other\"]}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 2.231482548348e+21
    }
  },
  {
    "id": "8139764605",
    "receipt_id": "Cib8WxuQxUifV5mQF3swwUsn4ikU9Rz6LkU6Bxo17bd8",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "social.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "C8UQJkt16BLUxmx1ktEBpN6v9FmXAibeUVPgBUJuU8BJ",
      "block_height": 127574894,
      "block_timestamp": 1725799220149315300
    },
    "receipt_outcome": {
      "gas_burnt": 4531533770868,
      "tokens_burnt": 453153377086800000000,
      "executor_account_id": "social.near",
      "status": true
    },
    "transaction_hash": "Dyh6rLZDrWGFroqwMdunDWMYq85dE99ojSJFMFW8p6J4",
    "included_in_block_hash": "FSQZB5ikrjzmZ2gM24YKjT94Pej5czYAeE19HrAn8umk",
    "block_timestamp": "1725799217825300381",
    "block": {
      "block_height": 127574892
    },
    "receipt_conversion_tokens_burnt": "110766771683500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set",
        "deposit": 0,
        "fee": 453153377086800000000,
        "args": "{\"data\": {\"infrastructure-committee.near\": {\"post\": {\"main\": \"{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"md\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"text\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"We have just received a new *Infrastructure Committee* proposal.\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\n\\\\\\\\u{2014}\\\\\\\\u{2014}\\\\\\\\u{2014}\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\n**By**: @bb5142ca412fb51a03ae4523f8f3dc77047d29e63c1c9e1ad8c5d019a4b64f3d\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\n**Title**: \\\\\\\\u{201c}NEAR x IBC Smart Contracts on NEAR\\\\\\\\u{201c}\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\n**Summary**:\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\nAt Moonstruck, our goal is to bring the existing implementation of NEAR IBC to a working, production ready state and offer maintenance and support for teams looking to integrate. Furthermore, we would love to work with the NEAR and Cosmos ecosystems and communities to further expand upon this foundation towards a future V2 of this protocol.\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\n\\\\\\\\u{2014}\\\\\\\\u{2014}\\\\\\\\u{2014}\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\nRead the full proposal and share your feedback on [DevHub](/devhub.near/widget/app?page=proposal&id=18)\\\\\\\\\\\\\\\"}\"}, \"index\": {\"post\": \"{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"main\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"md\\\\\\\\\\\\\\\"}}\"}}}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 2.231482548348e+21
    }
  },
  {
    "id": "8139764607",
    "receipt_id": "53dtrEXm2RSsQjy5XkF57QbQWDqgk7rmACxZGj7sUj8q",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "C8UQJkt16BLUxmx1ktEBpN6v9FmXAibeUVPgBUJuU8BJ",
      "block_height": 127574894,
      "block_timestamp": 1725799220149315300
    },
    "receipt_outcome": {
      "gas_burnt": 4743320710079,
      "tokens_burnt": 474332071007900000000,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "Dyh6rLZDrWGFroqwMdunDWMYq85dE99ojSJFMFW8p6J4",
    "included_in_block_hash": "FSQZB5ikrjzmZ2gM24YKjT94Pej5czYAeE19HrAn8umk",
    "block_timestamp": "1725799217825300381",
    "block": {
      "block_height": 127574892
    },
    "receipt_conversion_tokens_burnt": "110766771683500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set_block_height_callback",
        "deposit": 0,
        "fee": 474332071007900000000,
        "args": "{\"proposal\": {\"id\": 18, \"snapshot\": {\"name\": \"NEAR x IBC Smart Contracts on NEAR\", \"labels\": [\"Bridges\", \"Other\"], \"summary\": \"At Moonstruck, our goal is to bring the existing implementation of NEAR IBC to a working, production ready state and offer maintenance and support for teams looking to integrate. Furthermore, we would love to work with the NEAR and Cosmos ecosystems and communities to further expand upon this foundation towards a future V2 of this protocol.\", \"category\": \"Infrastructure Committee\", \"timeline\": {\"status\": \"DRAFT\"}, \"editor_id\": \"bb5142ca412fb51a03ae4523f8f3dc77047d29e63c1c9e1ad8c5d019a4b64f3d\", \"timestamp\": \"1725799219013017300\", \"linked_rfp\": null, \"supervisor\": null, \"description\": \"## Organization\\\\\\\\n\\\\\\\\n### Primary person\\\\\\\\\\\\'s contact information\\\\\\\\n\\\\\\\\n**Strahinja Vukoi\\\\\\\\u{10d}i\\\\\\\\u{107} (CEO)**  \\\\\\\\nTelegram:   @StrahinjaVukoicic  \\\\\\\\nEmail:      strahinja@moonstruck.io\\\\\\\\n\\\\\\\\n### Size of the whole team\\\\\\\\n\\\\\\\\nMOONSTRUCK has a total of 33 employees, not including external contractors (consultants, auditors, UI/UX experts).\\\\\\\\n\\\\\\\\n### Size of the engineering team\\\\\\\\n\\\\\\\\nMOONSTRUCK has a total of 25 engineers available in full time roles.\\\\\\\\n\\\\\\\\n### Team location\\\\\\\\n\\\\\\\\nBelgrade, Serbia\\\\\\\\n\\\\\\\\n### Team background and bios\\\\\\\\n\\\\\\\\nSelected team member CVs:\\\\\\\\n\\\\\\\\n- Pavle Batuta \\\\\\\\\\\\\\\\- [1\\\\\\\\\\\\\\\\. CV - Pavle Batuta.pdf](https://drive.google.com/file/d/1HC35s5Nz1KS7Xr9NIJsBCfE2JScLm1gt/view?usp=sharing)  \\\\\\\\n- Bogdan Ilic \\\\\\\\\\\\\\\\- [2\\\\\\\\\\\\\\\\. CV - Bogdan Ilic\\\\\\\\u{301}.pdf](https://drive.google.com/file/d/12HmM7oMkYx6rbI7U5a6Ds\\\\\\\\\\\\\\\\_QqiKo2qsyT/view?usp=sharing)  \\\\\\\\n- Emil Bob \\\\\\\\\\\\\\\\- [3\\\\\\\\\\\\\\\\. CV - Emil Bob.pdf](https://drive.google.com/file/d/1v5jaqXpRzmbCivydxEyKgiPeGMSPEXN1/view?usp=sharing)  \\\\\\\\n- Stefan Latinovic \\\\\\\\\\\\\\\\- [4\\\\\\\\\\\\\\\\. CV - Stefan Latinovic\\\\\\\\u{301}.pdf](https://drive.google.com/file/d/1E3aahumuXfA\\\\\\\\\\\\\\\\_\\\\\\\\\\\\\\\\_wvdhQbOvjJHjxAl65Tu/view?usp=sharing)\\\\\\\\n\\\\\\\\n### Any affiliations with other NEAR ecosystem partners?\\\\\\\\n\\\\\\\\nMOONSTRUCK has had an open collaboration with NEAR Balkans Hub for almost 3 years, pretty much from the onset, helping to promote NEAR\\\\\\\\u{2019}s technology and ecosystem. Our company facilitated the first ever technical workshop about NEAR for software engineers in Serbia. During the ETH Belgrade and Belgrade Blockchain Week 2023, our company provided a venue for \\\\\\\\u{201c}NEAR Day\\\\\\\\u{201d} and \\\\\\\\u{201c}BOS Workshop\\\\\\\\u{201d} held by NEAR\\\\\\\\u{2019}s experts.\\\\\\\\n\\\\\\\\n## Professional Experience\\\\\\\\n\\\\\\\\n### Examples of relevant experience with NEAR blockchain\\\\\\\\n\\\\\\\\nMOONSTRUCK has not deployed a production-level project on NEAR blockchain; however, 7 engineers from our company have passed the training in BOS and have experience in building BOS components. Team proposed for this project is very familiar with NEAR architecture and latest technical documentation.\\\\\\\\n\\\\\\\\n### Non-technical capabilities:\\\\\\\\n\\\\\\\\nMOONSTRUCK has consistently strived to connect and bring together the Web3 community in the SEE region and participate in various programs to empower teams and individuals, thus cultivating our own talent.\\\\\\\\n\\\\\\\\n**Web3 Supercluster**  \\\\\\\\nMOONSTRUCK is the founding member of Web3 Supercluster, a part of the \\\\\\\\u{201c}Serbia Innovates\\\\\\\\u{201d} program supported by USAID that seeks to strengthen the Serbian economy through R\\\\\\\\\\\\\\\\&D collaboration, education and skills development in the deep tech domain.\\\\\\\\n\\\\\\\\n**Web 2.5 Academy**  \\\\\\\\nMOONSTRUCK holds a Web 2.5 Academy, aimed at enabling the inclusion of a wide range of participants with basic programming skills and directing them towards Web3 technologies, providing intrinsic knowledge in blockchain architecture, consensus mechanism, smart contracts and tooling. For the past 2 years, we have held 3 cohorts and trained more than 400 participants.\\\\\\\\n\\\\\\\\n**Moonwalk**  \\\\\\\\nMOONSTRUCK has a four-month internship program Moonwalk, which is designed to bring out the best from a small group of selected candidates from our yearly educational programs.\\\\\\\\n\\\\\\\\n**Glue**  \\\\\\\\nGlue, our Web3 acceleration program, is the premier launchpad for emerging teams and projects, emphasizing technology excellence and hands-on learning process under guidance of our mentors.\\\\\\\\n\\\\\\\\n**Guesthouse**  \\\\\\\\nGuesthouse by MOONSTRUCK is held every year during Belgrade Blockchain Week. It represents a series of side events that cover relevant topics in the Web3 and Blockchain industry. For the past 2 years, we hosted 25 impactful events, engaging over 300 participants in workshops, discussions, presentations, training, etc. With the support from NEAR, Chainlink, ICP, Sui, Superchain and many other valued partners, we brought the Guesthouse event to life.\\\\\\\\n\\\\\\\\n### Portfolio of relevant work\\\\\\\\n\\\\\\\\n**Swarm** \\\\\\\\\\\\\\\\- Decentralised Storage Service by Ethereum Foundation.\\\\\\\\n\\\\\\\\n**Giveth** \\\\\\\\\\\\\\\\- Cryptocurrency donation platform and DeFi protocol that rewards donors of verified public goods projects.\\\\\\\\n\\\\\\\\n**Bitcoin.com** \\\\\\\\\\\\\\\\- Automated Market Maker (AMM).\\\\\\\\n\\\\\\\\n**Hundrx** \\\\\\\\\\\\\\\\- Web3 extension for Twitter (X) enabling tokenization of profiles and enhanced interaction between influencers and followers via social tokens.\\\\\\\\n\\\\\\\\n**AgAu** \\\\\\\\\\\\\\\\- RWA digital platform for tokenization of investment gold and precious metals with fully collateralized cryptocurrency.\\\\\\\\n\\\\\\\\n**DeFire** \\\\\\\\\\\\\\\\- DEX aggregation platform for transaction optimization.\\\\\\\\n\\\\\\\\n**Tycoon** \\\\\\\\\\\\\\\\- Social crypto trading platform and cryptocurrency.\\\\\\\\n\\\\\\\\n**Renfter** \\\\\\\\\\\\\\\\- Uncollateralized NFT Renting Protocol.\\\\\\\\n\\\\\\\\n**Libertas** \\\\\\\\\\\\\\\\- Infrastructure and Protocol for TSF proof-of-work blockchain (L1).\\\\\\\\n\\\\\\\\n**Disberse** \\\\\\\\\\\\\\\\- Transparency on-chain platform for tracking means of public funding.\\\\\\\\n\\\\\\\\n**Asphodel** \\\\\\\\\\\\\\\\- Metaverse on-chain game.\\\\\\\\n\\\\\\\\n**Kamigotchi World** \\\\\\\\\\\\\\\\- DAO governed on-chain game.\\\\\\\\n\\\\\\\\n**Mirage Protocol** \\\\\\\\\\\\\\\\- Universal multichain asset-mirroring protocol.\\\\\\\\n\\\\\\\\n**TRAKEN** \\\\\\\\\\\\\\\\- Renewable energy aggregation and trading platform for smart electrical grids based on blockchain technology, enabling power purchasing agreements execution in the form of smart contracts.\\\\\\\\n\\\\\\\\n## Body\\\\\\\\n\\\\\\\\nWe propose to inherit the current implementation of the NEAR \\\\\\\\\\\\\\\\- IBC protocol, previously built by [Octopus Network](https://oct.network/) and prepare it for mainnet production as a version 1.0 release candidate. Furthermore, we would like to offer our services, collaborate with the relevant stakeholders in the Cosmos ecosystem and work towards developing further production releases with new features built in tight cooperation. Finally, we would like to commit a team towards long term maintenance and support of the project \\\\\\\\\\\\\\\\- including documentation\\\\\\\\n\\\\\\\\nThe NEAR \\\\\\\\\\\\\\\\- IBC protocol is the NEAR implementation of the IBC protocol transport layer (IBC/TAO). The project integrates the implementation of the IBC protocol based Inter-Blockchain Communication fungible token transfer application (ICS20) to link the NEAR and Cosmos ecosystems, bringing greater composability to the innovation of the entire interchain blockchain Internet.\\\\\\\\n\\\\\\\\nMore information on the original project iteration is available on the accompanying [Octopus network Medium post.](https://medium.com/omnity/introduction-to-near-ibc-how-to-implement-the-ibc-protocol-with-smart-contracts-a8b0e13cb886)\\\\\\\\n\\\\\\\\nOur team has performed an extensive gap analysis and research of the current implementation version and has compiled a [gap analysis report](https://docs.google.com/document/d/1icI44qEgX3srzjx5EJQJs6LJRYy1-H96t4zzwh99\\\\\\\\\\\\\\\\_28/edit?usp=sharing) with our findings.\\\\\\\\n\\\\\\\\nWe intend to release the codebase under a permissive open source license. We intend to discuss with the NEAR foundation and any other relevant stakeholders on the exact choice of the license we will be selecting.\\\\\\\\n\\\\\\\\nThere are currently at least two teams looking to utilize NEAR IBC as a solution. Our goal is to help these initial early adopters to achieve success and build a strong foundation for supporting other teams in the future.\\\\\\\\n\\\\\\\\n## Goals / Milestones\\\\\\\\n\\\\\\\\n### Project Goals\\\\\\\\n\\\\\\\\nWe define two major goals for this proposal: **release** and **maintenance**.\\\\\\\\n\\\\\\\\nOur **primary release goal** is to prepare a mainnet ready **NEAR IBC v1.0 release candidate** and deploy it into production on time and at quality. The release candidate should \\\\\\\\n\\\\\\\\n- implement all of the features of the NEAR IBC protocol spec   \\\\\\\\n- successfully pass a security audit by a reputable team (or platform).\\\\\\\\n\\\\\\\\nOur **secondary release goal(s)** are to support teams looking to integrate NEAR IBC into their products and protocols by well produced and detailed developer documentation as well as a working prototype (proof of concept) console based application as a reference.\\\\\\\\n\\\\\\\\nOur **maintenance goal** is to commit a team to maintain the NEAR IBC project after the release candidate: fix bugs and security issues, prepare new releases, update and maintain documentation and provide first or second line support to teams that are using the protocol as a part of their solutions.\\\\\\\\n\\\\\\\\nBeyond our immediate goals, we wish to extend the current implementation towards a V2 release with the support of teams in the Cosmos ecosystem. With that in mind, we will ensure that the implementation stays clear and extensible towards future features and upgrades.\\\\\\\\n\\\\\\\\nTo that end we propose the project be divided into two phases: active development and maintenance cycle.\\\\\\\\n\\\\\\\\n### Milestones\\\\\\\\n\\\\\\\\nWe propose the following milestones:\\\\\\\\n\\\\\\\\n- Alpha release: constitutes a version with a working happy path that can be tested in a local environment  \\\\\\\\n- V1 release candidate: constitutes a version with a demonstration PoC that is deployed to a testnet environment and is ready for an audit\\\\\\\\n\\\\\\\\nThese milestones are based on our current understanding of the project and objectives and priorities. We invite the infrastructure team and the NEAR Foundation to help us define clearer milestones for delivery based on ecosystem priorities and shared understanding.\\\\\\\\n\\\\\\\\n### Reporting\\\\\\\\n\\\\\\\\nDuring the **release phase** of the project, we suggest regular **2 week** intervals for reporting on the project status, coinciding with the **end of each working sprint**.\\\\\\\\n\\\\\\\\nAs part of the report, the team would present (in agreed upon forum and format) the progress of the project, including any demonstration of functionality that can be performed. The project management team will also open a retrospective of the sprint, with the ability to discuss delivery velocity, risks or potential changes of scope.\\\\\\\\n\\\\\\\\nDuring the **support/maintenance** phase of the project, we suggest **monthly status updates** of work done: security and bug fixes, tech debt resolved, issues reported by the community etc.\\\\\\\\n\\\\\\\\nWe invite the Infrastructure Board and the NEAR Foundation to help us propose a clear and detailed way of reporting for the project.\\\\\\\\n\\\\\\\\n### Engineering Estimation\\\\\\\\n\\\\\\\\nBased on the above gap analysis conclusions, we are able to suggest a provisional delivery scope and provide an expert estimation on engagement with development roles required.\\\\\\\\n\\\\\\\\n#### Provisional Scope\\\\\\\\n\\\\\\\\nWe recommend the following scope of work in order to complete the project into a working solution.\\\\\\\\n\\\\\\\\n##### Required\\\\\\\\n\\\\\\\\n1. Identify any and all components that need to be replaced from the project  \\\\\\\\n2. Determine development/integration/mitigation for the project  \\\\\\\\n3. Bring the project into a working state  \\\\\\\\n4. Implement a minimal testing framework with essential coverage  \\\\\\\\n5. Document a testing procedure for the project and perform smoke testing  \\\\\\\\n6. Upgrade the deployment procedure  \\\\\\\\n7. Provide documentation to changes  \\\\\\\\n8. Deploy solution to testnet  \\\\\\\\n9. Scope and implement a minimal PoC (terminal based)\\\\\\\\n\\\\\\\\n##### Optional\\\\\\\\n\\\\\\\\n1. Implement a full CI/CD release pipeline  \\\\\\\\n2. Implement deployment automation  \\\\\\\\n3. Implement full test coverage  \\\\\\\\n4. Add static analysis in manual or automated form  \\\\\\\\n5. Prepare separate detailed development documentation (for V1)  \\\\\\\\n6. Prepare examples for use  \\\\\\\\n7. Scope and implement a full PoC Dapp\\\\\\\\n\\\\\\\\n#### Definition of Done\\\\\\\\n\\\\\\\\nWe consider the solution as ready for release when it is deployed on a public/available testnet, with released code and artifacts in a state that is ready for audit or early integration. This functionally equates to a testnet release.\\\\\\\\n\\\\\\\\nThis release constitutes a fully delivered project.\\\\\\\\n\\\\\\\\nThe release includes a **working PoC** with demonstrable functionality.\\\\\\\\n\\\\\\\\nThe release does not depend upon audits and integrations with third parties.\\\\\\\\n\\\\\\\\nMOONSTRUCK will be fully committed to assist with any work required to fix any security issues discovered as well as integration to other projects.\\\\\\\\n\\\\\\\\n#### Level of Effort and Timeline \\\\\\\\\\\\\\\\- Development Phase\\\\\\\\n\\\\\\\\nBased on the provisional scope of the project and the expert estimation we are able to provide a provisional engagement for the project with required roles and effort.\\\\\\\\n\\\\\\\\nThis project would be handled by a single Agile pod team with the project being their sole focus during the active development phase. Beyond that, experts will be made available to the pod based on task and project requirements. These team members constitute core and support roles:\\\\\\\\n\\\\\\\\n##### Core Roles\\\\\\\\n\\\\\\\\n| Role | Responsibilities | Effort |\\\\\\\\n| :---- | :---- | :---- |\\\\\\\\n| Project Lead, Blockchain Architect | Leadership, reporting, development | Part Time |\\\\\\\\n| Blockchain Engineer | Development, testing | Full Time |\\\\\\\\n| Blockchain Engineer | Development, testing | Full Time |\\\\\\\\n\\\\\\\\n##### Support Roles\\\\\\\\n\\\\\\\\n| Role | Responsibilities | Effort |\\\\\\\\n| :---- | :---- | :---- |\\\\\\\\n| Engineer in Test | Test automation | Part Time |\\\\\\\\n| Technical Writer | Documentation | Part Time |\\\\\\\\n| Devops | CI/CD, project deployment | Part Time |\\\\\\\\n\\\\\\\\n##### Timeline\\\\\\\\n\\\\\\\\nWe suggest the following timeline for the project, measured in **two week sprints**:\\\\\\\\n\\\\\\\\n| Sprints | Description | Goals |\\\\\\\\n| :---- | :---- | :---- |\\\\\\\\n| 1 | Finish gap analysis, perform spikes and fill backlog | Initial task backlog |\\\\\\\\n| 2, 3 | Perform smoke testing, write test scenarios, write automated tests, set up initial CI/CD, tech debt analysis | Alpha w/ demonstration capability, basic CI/CD pipeline |\\\\\\\\n| 4, 5 | Improved test coverage, tech debt resolution tasks, initial documentation, PoC candidate planning | Basic prototype w/ demonstration capability, documentation, PoC plan |\\\\\\\\n| 6 | PoC development, deployment to testnet, developer documentation, examples | Release Candidate: deployed to testnet w/ working PoC |\\\\\\\\n\\\\\\\\nTotal estimate for delivery of the **proposed scope for V1** amounts to **three months** of effort for the engaged team.\\\\\\\\n\\\\\\\\n##### Release schedule\\\\\\\\n\\\\\\\\n| Release | End of sprint | Goal |\\\\\\\\n| :---- | :---- | :---- |\\\\\\\\n| Alpha | 3 | Local release with a demonstrable happy path available |\\\\\\\\n| RC1 | 6 | Fully featured V1 release deployed to testnet with a working PoC |\\\\\\\\n\\\\\\\\n#### Level of Effort and Timeline \\\\\\\\\\\\\\\\- Support Phase\\\\\\\\n\\\\\\\\nAfter the release, we would assign a maintenance team to support the V1 release, ensuring it is working to spec and assisting other development teams with integration. Maintenance will also cover a certain amount of tech debt resolution from the development phase. This role includes redundant effort to ensure availability of support.\\\\\\\\n\\\\\\\\n##### Support Roles\\\\\\\\n\\\\\\\\n| Role | Responsibilities | Effort |\\\\\\\\n| :---- | :---- | :---- |\\\\\\\\n| Blockchain Engineer | Maintenance and support | Part time |\\\\\\\\n| Blockchain Engineer | Maintenance and support | Part time |\\\\\\\\n\\\\\\\\nWe would commit the core support roles to work on maintenance and support tasks for a period of **nine months**.\\\\\\\\n\\\\\\\\n#### Commentary\\\\\\\\n\\\\\\\\nMoonstruck wishes to engage and own this project long term. Our goal is to support the expansion of this protocol towards V2 and beyond. Therefore one of the primary outcomes of working on V1 is to get the team acquainted with an expert level of understanding of the underlying protocol, technology and concepts.\\\\\\\\n\\\\\\\\nOur hope is to reach a level of understanding towards our provisional scope and best-effort analysis as well as continuous improvements towards the protocol with a close relations\\\\\\\\n\\\\\\\\n## Budget\\\\\\\\n\\\\\\\\n### Budget Total\\\\\\\\n\\\\\\\\nWe have estimated the total budget for the project as:\\\\\\\\n\\\\\\\\n- **USD 98.000** for the development phase (over 3 months)  \\\\\\\\n- **USD 72.000** for the support phase (over 9 months)\\\\\\\\n\\\\\\\\nFor a total of ***USD 170.000*** over a period of 1 year.\\\\\\\\n\\\\\\\\n### Budget Breakdown\\\\\\\\n\\\\\\\\nWe suggest the following budget breakdown and payment structure:\\\\\\\\n\\\\\\\\nFor the development phase we suggest the following payouts:\\\\\\\\n\\\\\\\\n| Milestone | Time of payment (after project start) | Amount |\\\\\\\\n| :---- | :---- | :---- |\\\\\\\\n| Alpha | 1.5 months | USD 50.000 |\\\\\\\\n| RC1 | 3 months | USD 48.000 |\\\\\\\\n\\\\\\\\n| Total | USD 98.000 |\\\\\\\\n| :---- | :---- |\\\\\\\\n\\\\\\\\nFor the support phase we suggest the following retainer for the next ***9 months***.\\\\\\\\n\\\\\\\\n| Item | Recurring | Amount |\\\\\\\\n| :---- | :---- | :---- |\\\\\\\\n| Engineering Support | Monthly (x9) | USD 8000 |\\\\\\\\n\\\\\\\\n| Total | 72.000 |\\\\\\\\n| :---- | :---- |\\\\\\\\n\\\\\\\\n\", \"linked_proposals\": [], \"receiver_account\": \"bb5142ca412fb51a03ae4523f8f3dc77047d29e63c1c9e1ad8c5d019a4b64f3d\", \"requested_sponsor\": \"infrastructure-committee.near\", \"proposal_body_version\": \"V1\", \"requested_sponsorship_usd_amount\": \"170000\", \"requested_sponsorship_paid_in_currency\": \"USDC\"}, \"author_id\": \"bb5142ca412fb51a03ae4523f8f3dc77047d29e63c1c9e1ad8c5d019a4b64f3d\", \"snapshot_history\": [], \"social_db_post_block_height\": \"0\"}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 2.231482548348e+21
    }
  },
  {
    "id": "8139764609",
    "receipt_id": "8TYavLcR9v592FdbvYD8VQgvoDJJnkzXgFQHnSHWSntG",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "social.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "C8UQJkt16BLUxmx1ktEBpN6v9FmXAibeUVPgBUJuU8BJ",
      "block_height": 127574894,
      "block_timestamp": 1725799220149315300
    },
    "receipt_outcome": {
      "gas_burnt": 3604463824893,
      "tokens_burnt": 360446382489300000000,
      "executor_account_id": "social.near",
      "status": true
    },
    "transaction_hash": "Dyh6rLZDrWGFroqwMdunDWMYq85dE99ojSJFMFW8p6J4",
    "included_in_block_hash": "FSQZB5ikrjzmZ2gM24YKjT94Pej5czYAeE19HrAn8umk",
    "block_timestamp": "1725799217825300381",
    "block": {
      "block_height": 127574892
    },
    "receipt_conversion_tokens_burnt": "110766771683500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set",
        "deposit": 0,
        "fee": 360446382489300000000,
        "args": "{\"data\": {\"infrastructure-committee.near\": {\"index\": {\"notify\": \"[{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"StrahinjaVukoicic\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"proposal/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"proposal\\\\\\\\\\\\\\\":18,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"bb5142ca412fb51a03ae4523f8f3dc77047d29e63c1c9e1ad8c5d019a4b64f3d\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"moonstruck.io\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"proposal/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"proposal\\\\\\\\\\\\\\\":18,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"bb5142ca412fb51a03ae4523f8f3dc77047d29e63c1c9e1ad8c5d019a4b64f3d\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"proposal/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"proposal\\\\\\\\\\\\\\\":18,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"bb5142ca412fb51a03ae4523f8f3dc77047d29e63c1c9e1ad8c5d019a4b64f3d\\\\\\\\\\\\\\\"}}]\"}}}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 2.231482548348e+21
    }
  },
  {
    "id": "8165219353",
    "receipt_id": "DTKfiTDdQabhYcjFU8FNy1wF7mvpMJ7zSYse38C2P5W4",
    "predecessor_account_id": "bb5142ca412fb51a03ae4523f8f3dc77047d29e63c1c9e1ad8c5d019a4b64f3d",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "8sUdamnY5pXJzpbPjYFfgkREpdLBUSumHQtS1o2zpMzv",
      "block_height": 127643690,
      "block_timestamp": 1725875750266501400
    },
    "receipt_outcome": {
      "gas_burnt": 7632947063363,
      "tokens_burnt": 763294706336300000000,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "AJvN4kUD9SuJAycUtPgpVci4FgqV1JpJ4u5M7iXWPEUn",
    "included_in_block_hash": "C2xyj2RfdDRRa96PUJduqadzrATCsjM6SZFAuFW3ZVXG",
    "block_timestamp": "1725875749149936545",
    "block": {
      "block_height": 127643689
    },
    "receipt_conversion_tokens_burnt": "31444911781000000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "edit_proposal_timeline",
        "deposit": 0,
        "fee": 763294706336300000000,
        "args": "{\"id\": 17, \"timeline\": {\"status\": \"REVIEW\", \"sponsor_requested_review\": false, \"reviewer_completed_attestation\": false}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.1506282968542e+21
    }
  },
  {
    "id": "8165219709",
    "receipt_id": "EauFS7sbAj1GH2ggz27NpFxAuoqYSksd6UWBipWdapJj",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "social.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "7pehziBWD3bajHJLMMXFBZDDwtGBcyVu5v7mrtpyYPob",
      "block_height": 127643691,
      "block_timestamp": 1725875751298496800
    },
    "receipt_outcome": {
      "gas_burnt": 3558886787369,
      "tokens_burnt": 355888678736900000000,
      "executor_account_id": "social.near",
      "status": true
    },
    "transaction_hash": "AJvN4kUD9SuJAycUtPgpVci4FgqV1JpJ4u5M7iXWPEUn",
    "included_in_block_hash": "C2xyj2RfdDRRa96PUJduqadzrATCsjM6SZFAuFW3ZVXG",
    "block_timestamp": "1725875749149936545",
    "block": {
      "block_height": 127643689
    },
    "receipt_conversion_tokens_burnt": "31444911781000000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set",
        "deposit": 0,
        "fee": 355888678736900000000,
        "args": "{\"data\": {\"infrastructure-committee.near\": {\"index\": {\"notify\": \"{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"bb5142ca412fb51a03ae4523f8f3dc77047d29e63c1c9e1ad8c5d019a4b64f3d\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"proposal/edit\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"proposal\\\\\\\\\\\\\\\":17,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"bb5142ca412fb51a03ae4523f8f3dc77047d29e63c1c9e1ad8c5d019a4b64f3d\\\\\\\\\\\\\\\"}}\"}}}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.1506282968542e+21
    }
  },
  {
    "id": "8165231519",
    "receipt_id": "BCBdKhfZKJatsgf12s6YSRqZ4767Fz2btFLj3uK5Xkz8",
    "predecessor_account_id": "bb5142ca412fb51a03ae4523f8f3dc77047d29e63c1c9e1ad8c5d019a4b64f3d",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "crbeGWHDiCa5qqqMaGL3DWqztRBvuNghtEiFTTTsPGu",
      "block_height": 127643747,
      "block_timestamp": 1725875812495182600
    },
    "receipt_outcome": {
      "gas_burnt": 5191844789197,
      "tokens_burnt": 519184478919700000000,
      "executor_account_id": "infrastructure-committee.near",
      "status": false
    },
    "transaction_hash": "kvUHMX4WpJxowAmqobhY4EMJBPnstNcBV61kJUnwzLk",
    "included_in_block_hash": "24a7dm5rfVzDJC5TqXVMdQGrHWjaPv6ZTWEyUU5BUa6c",
    "block_timestamp": "1725875811564535173",
    "block": {
      "block_height": 127643746
    },
    "receipt_conversion_tokens_burnt": "31444911781000000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "edit_proposal_timeline",
        "deposit": 0,
        "fee": 519184478919700000000,
        "args": "{\"id\": 17, \"timeline\": {\"status\": \"REVIEW\", \"sponsor_requested_review\": false, \"reviewer_completed_attestation\": false}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": false
    },
    "outcomes_agg": {
      "transaction_fee": 550629390700700000000
    }
  },
  {
    "id": "8165240620",
    "receipt_id": "3yBhMMkiAEgirwjn9MjCbCKebsjJffsnLRJg2ydrbLh2",
    "predecessor_account_id": "bb5142ca412fb51a03ae4523f8f3dc77047d29e63c1c9e1ad8c5d019a4b64f3d",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "67zhatUFTofss2Qqv5HsoPbFP1epRb1Vu19GZ9FSnRtd",
      "block_height": 127643791,
      "block_timestamp": 1725875860426423600
    },
    "receipt_outcome": {
      "gas_burnt": 8094436687464,
      "tokens_burnt": 809443668746400000000,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "2tHx77RLYKm9zN7H6871ZaatCSmud7qXeba2jK7dqaHh",
    "included_in_block_hash": "3e6Qq5ZFLm9TULt3S6X18zH2xjpTMAhJQyPyWb68jAV5",
    "block_timestamp": "1725875859186914303",
    "block": {
      "block_height": 127643790
    },
    "receipt_conversion_tokens_burnt": "111172083261000000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "edit_proposal",
        "deposit": 0,
        "fee": 809443668746400000000,
        "args": "{\"id\": 18, \"body\": {\"name\": \"NEAR x IBC Smart Contracts on NEAR\", \"summary\": \"At Moonstruck, our goal is to bring the existing implementation of NEAR IBC to a working, production ready state and offer maintenance and support for teams looking to integrate. Furthermore, we would love to work with the NEAR and Cosmos ecosystems and communities to further expand upon this foundation towards a future V2 of this protocol.\", \"category\": \"Infrastructure Committee\", \"timeline\": {\"status\": \"CANCELLED\", \"sponsor_requested_review\": false, \"reviewer_completed_attestation\": false}, \"supervisor\": null, \"description\": \"## Organization\\\\\\\\n\\\\\\\\n### Primary person\\\\\\\\\\\\'s contact information\\\\\\\\n\\\\\\\\n**Strahinja Vukoi\\\\\\\\u{10d}i\\\\\\\\u{107} (CEO)**  \\\\\\\\nTelegram:   @StrahinjaVukoicic  \\\\\\\\nEmail:      strahinja@moonstruck.io\\\\\\\\n\\\\\\\\n### Size of the whole team\\\\\\\\n\\\\\\\\nMOONSTRUCK has a total of 33 employees, not including external contractors (consultants, auditors, UI/UX experts).\\\\\\\\n\\\\\\\\n### Size of the engineering team\\\\\\\\n\\\\\\\\nMOONSTRUCK has a total of 25 engineers available in full time roles.\\\\\\\\n\\\\\\\\n### Team location\\\\\\\\n\\\\\\\\nBelgrade, Serbia\\\\\\\\n\\\\\\\\n### Team background and bios\\\\\\\\n\\\\\\\\nSelected team member CVs:\\\\\\\\n\\\\\\\\n- Pavle Batuta \\\\\\\\\\\\\\\\- [1\\\\\\\\\\\\\\\\. CV - Pavle Batuta.pdf](https://drive.google.com/file/d/1HC35s5Nz1KS7Xr9NIJsBCfE2JScLm1gt/view?usp=sharing)  \\\\\\\\n- Bogdan Ilic \\\\\\\\\\\\\\\\- [2\\\\\\\\\\\\\\\\. CV - Bogdan Ilic\\\\\\\\u{301}.pdf](https://drive.google.com/file/d/12HmM7oMkYx6rbI7U5a6Ds\\\\\\\\\\\\\\\\_QqiKo2qsyT/view?usp=sharing)  \\\\\\\\n- Emil Bob \\\\\\\\\\\\\\\\- [3\\\\\\\\\\\\\\\\. CV - Emil Bob.pdf](https://drive.google.com/file/d/1v5jaqXpRzmbCivydxEyKgiPeGMSPEXN1/view?usp=sharing)  \\\\\\\\n- Stefan Latinovic \\\\\\\\\\\\\\\\- [4\\\\\\\\\\\\\\\\. CV - Stefan Latinovic\\\\\\\\u{301}.pdf](https://drive.google.com/file/d/1E3aahumuXfA\\\\\\\\\\\\\\\\_\\\\\\\\\\\\\\\\_wvdhQbOvjJHjxAl65Tu/view?usp=sharing)\\\\\\\\n\\\\\\\\n### Any affiliations with other NEAR ecosystem partners?\\\\\\\\n\\\\\\\\nMOONSTRUCK has had an open collaboration with NEAR Balkans Hub for almost 3 years, pretty much from the onset, helping to promote NEAR\\\\\\\\u{2019}s technology and ecosystem. Our company facilitated the first ever technical workshop about NEAR for software engineers in Serbia. During the ETH Belgrade and Belgrade Blockchain Week 2023, our company provided a venue for \\\\\\\\u{201c}NEAR Day\\\\\\\\u{201d} and \\\\\\\\u{201c}BOS Workshop\\\\\\\\u{201d} held by NEAR\\\\\\\\u{2019}s experts.\\\\\\\\n\\\\\\\\n## Professional Experience\\\\\\\\n\\\\\\\\n### Examples of relevant experience with NEAR blockchain\\\\\\\\n\\\\\\\\nMOONSTRUCK has not deployed a production-level project on NEAR blockchain; however, 7 engineers from our company have passed the training in BOS and have experience in building BOS components. Team proposed for this project is very familiar with NEAR architecture and latest technical documentation.\\\\\\\\n\\\\\\\\n### Non-technical capabilities:\\\\\\\\n\\\\\\\\nMOONSTRUCK has consistently strived to connect and bring together the Web3 community in the SEE region and participate in various programs to empower teams and individuals, thus cultivating our own talent.\\\\\\\\n\\\\\\\\n**Web3 Supercluster**  \\\\\\\\nMOONSTRUCK is the founding member of Web3 Supercluster, a part of the \\\\\\\\u{201c}Serbia Innovates\\\\\\\\u{201d} program supported by USAID that seeks to strengthen the Serbian economy through R\\\\\\\\\\\\\\\\&D collaboration, education and skills development in the deep tech domain.\\\\\\\\n\\\\\\\\n**Web 2.5 Academy**  \\\\\\\\nMOONSTRUCK holds a Web 2.5 Academy, aimed at enabling the inclusion of a wide range of participants with basic programming skills and directing them towards Web3 technologies, providing intrinsic knowledge in blockchain architecture, consensus mechanism, smart contracts and tooling. For the past 2 years, we have held 3 cohorts and trained more than 400 participants.\\\\\\\\n\\\\\\\\n**Moonwalk**  \\\\\\\\nMOONSTRUCK has a four-month internship program Moonwalk, which is designed to bring out the best from a small group of selected candidates from our yearly educational programs.\\\\\\\\n\\\\\\\\n**Glue**  \\\\\\\\nGlue, our Web3 acceleration program, is the premier launchpad for emerging teams and projects, emphasizing technology excellence and hands-on learning process under guidance of our mentors.\\\\\\\\n\\\\\\\\n**Guesthouse**  \\\\\\\\nGuesthouse by MOONSTRUCK is held every year during Belgrade Blockchain Week. It represents a series of side events that cover relevant topics in the Web3 and Blockchain industry. For the past 2 years, we hosted 25 impactful events, engaging over 300 participants in workshops, discussions, presentations, training, etc. With the support from NEAR, Chainlink, ICP, Sui, Superchain and many other valued partners, we brought the Guesthouse event to life.\\\\\\\\n\\\\\\\\n### Portfolio of relevant work\\\\\\\\n\\\\\\\\n**Swarm** \\\\\\\\\\\\\\\\- Decentralised Storage Service by Ethereum Foundation.\\\\\\\\n\\\\\\\\n**Giveth** \\\\\\\\\\\\\\\\- Cryptocurrency donation platform and DeFi protocol that rewards donors of verified public goods projects.\\\\\\\\n\\\\\\\\n**Bitcoin.com** \\\\\\\\\\\\\\\\- Automated Market Maker (AMM).\\\\\\\\n\\\\\\\\n**Hundrx** \\\\\\\\\\\\\\\\- Web3 extension for Twitter (X) enabling tokenization of profiles and enhanced interaction between influencers and followers via social tokens.\\\\\\\\n\\\\\\\\n**AgAu** \\\\\\\\\\\\\\\\- RWA digital platform for tokenization of investment gold and precious metals with fully collateralized cryptocurrency.\\\\\\\\n\\\\\\\\n**DeFire** \\\\\\\\\\\\\\\\- DEX aggregation platform for transaction optimization.\\\\\\\\n\\\\\\\\n**Tycoon** \\\\\\\\\\\\\\\\- Social crypto trading platform and cryptocurrency.\\\\\\\\n\\\\\\\\n**Renfter** \\\\\\\\\\\\\\\\- Uncollateralized NFT Renting Protocol.\\\\\\\\n\\\\\\\\n**Libertas** \\\\\\\\\\\\\\\\- Infrastructure and Protocol for TSF proof-of-work blockchain (L1).\\\\\\\\n\\\\\\\\n**Disberse** \\\\\\\\\\\\\\\\- Transparency on-chain platform for tracking means of public funding.\\\\\\\\n\\\\\\\\n**Asphodel** \\\\\\\\\\\\\\\\- Metaverse on-chain game.\\\\\\\\n\\\\\\\\n**Kamigotchi World** \\\\\\\\\\\\\\\\- DAO governed on-chain game.\\\\\\\\n\\\\\\\\n**Mirage Protocol** \\\\\\\\\\\\\\\\- Universal multichain asset-mirroring protocol.\\\\\\\\n\\\\\\\\n**TRAKEN** \\\\\\\\\\\\\\\\- Renewable energy aggregation and trading platform for smart electrical grids based on blockchain technology, enabling power purchasing agreements execution in the form of smart contracts.\\\\\\\\n\\\\\\\\n## Body\\\\\\\\n\\\\\\\\nWe propose to inherit the current implementation of the NEAR \\\\\\\\\\\\\\\\- IBC protocol, previously built by [Octopus Network](https://oct.network/) and prepare it for mainnet production as a version 1.0 release candidate. Furthermore, we would like to offer our services, collaborate with the relevant stakeholders in the Cosmos ecosystem and work towards developing further production releases with new features built in tight cooperation. Finally, we would like to commit a team towards long term maintenance and support of the project \\\\\\\\\\\\\\\\- including documentation\\\\\\\\n\\\\\\\\nThe NEAR \\\\\\\\\\\\\\\\- IBC protocol is the NEAR implementation of the IBC protocol transport layer (IBC/TAO). The project integrates the implementation of the IBC protocol based Inter-Blockchain Communication fungible token transfer application (ICS20) to link the NEAR and Cosmos ecosystems, bringing greater composability to the innovation of the entire interchain blockchain Internet.\\\\\\\\n\\\\\\\\nMore information on the original project iteration is available on the accompanying [Octopus network Medium post.](https://medium.com/omnity/introduction-to-near-ibc-how-to-implement-the-ibc-protocol-with-smart-contracts-a8b0e13cb886)\\\\\\\\n\\\\\\\\nOur team has performed an extensive gap analysis and research of the current implementation version and has compiled a [gap analysis report](https://docs.google.com/document/d/1icI44qEgX3srzjx5EJQJs6LJRYy1-H96t4zzwh99\\\\\\\\\\\\\\\\_28/edit?usp=sharing) with our findings.\\\\\\\\n\\\\\\\\nWe intend to release the codebase under a permissive open source license. We intend to discuss with the NEAR foundation and any other relevant stakeholders on the exact choice of the license we will be selecting.\\\\\\\\n\\\\\\\\nThere are currently at least two teams looking to utilize NEAR IBC as a solution. Our goal is to help these initial early adopters to achieve success and build a strong foundation for supporting other teams in the future.\\\\\\\\n\\\\\\\\n## Goals / Milestones\\\\\\\\n\\\\\\\\n### Project Goals\\\\\\\\n\\\\\\\\nWe define two major goals for this proposal: **release** and **maintenance**.\\\\\\\\n\\\\\\\\nOur **primary release goal** is to prepare a mainnet ready **NEAR IBC v1.0 release candidate** and deploy it into production on time and at quality. The release candidate should \\\\\\\\n\\\\\\\\n- implement all of the features of the NEAR IBC protocol spec   \\\\\\\\n- successfully pass a security audit by a reputable team (or platform).\\\\\\\\n\\\\\\\\nOur **secondary release goal(s)** are to support teams looking to integrate NEAR IBC into their products and protocols by well produced and detailed developer documentation as well as a working prototype (proof of concept) console based application as a reference.\\\\\\\\n\\\\\\\\nOur **maintenance goal** is to commit a team to maintain the NEAR IBC project after the release candidate: fix bugs and security issues, prepare new releases, update and maintain documentation and provide first or second line support to teams that are using the protocol as a part of their solutions.\\\\\\\\n\\\\\\\\nBeyond our immediate goals, we wish to extend the current implementation towards a V2 release with the support of teams in the Cosmos ecosystem. With that in mind, we will ensure that the implementation stays clear and extensible towards future features and upgrades.\\\\\\\\n\\\\\\\\nTo that end we propose the project be divided into two phases: active development and maintenance cycle.\\\\\\\\n\\\\\\\\n### Milestones\\\\\\\\n\\\\\\\\nWe propose the following milestones:\\\\\\\\n\\\\\\\\n- Alpha release: constitutes a version with a working happy path that can be tested in a local environment  \\\\\\\\n- V1 release candidate: constitutes a version with a demonstration PoC that is deployed to a testnet environment and is ready for an audit\\\\\\\\n\\\\\\\\nThese milestones are based on our current understanding of the project and objectives and priorities. We invite the infrastructure team and the NEAR Foundation to help us define clearer milestones for delivery based on ecosystem priorities and shared understanding.\\\\\\\\n\\\\\\\\n### Reporting\\\\\\\\n\\\\\\\\nDuring the **release phase** of the project, we suggest regular **2 week** intervals for reporting on the project status, coinciding with the **end of each working sprint**.\\\\\\\\n\\\\\\\\nAs part of the report, the team would present (in agreed upon forum and format) the progress of the project, including any demonstration of functionality that can be performed. The project management team will also open a retrospective of the sprint, with the ability to discuss delivery velocity, risks or potential changes of scope.\\\\\\\\n\\\\\\\\nDuring the **support/maintenance** phase of the project, we suggest **monthly status updates** of work done: security and bug fixes, tech debt resolved, issues reported by the community etc.\\\\\\\\n\\\\\\\\nWe invite the Infrastructure Board and the NEAR Foundation to help us propose a clear and detailed way of reporting for the project.\\\\\\\\n\\\\\\\\n### Engineering Estimation\\\\\\\\n\\\\\\\\nBased on the above gap analysis conclusions, we are able to suggest a provisional delivery scope and provide an expert estimation on engagement with development roles required.\\\\\\\\n\\\\\\\\n#### Provisional Scope\\\\\\\\n\\\\\\\\nWe recommend the following scope of work in order to complete the project into a working solution.\\\\\\\\n\\\\\\\\n##### Required\\\\\\\\n\\\\\\\\n1. Identify any and all components that need to be replaced from the project  \\\\\\\\n2. Determine development/integration/mitigation for the project  \\\\\\\\n3. Bring the project into a working state  \\\\\\\\n4. Implement a minimal testing framework with essential coverage  \\\\\\\\n5. Document a testing procedure for the project and perform smoke testing  \\\\\\\\n6. Upgrade the deployment procedure  \\\\\\\\n7. Provide documentation to changes  \\\\\\\\n8. Deploy solution to testnet  \\\\\\\\n9. Scope and implement a minimal PoC (terminal based)\\\\\\\\n\\\\\\\\n##### Optional\\\\\\\\n\\\\\\\\n1. Implement a full CI/CD release pipeline  \\\\\\\\n2. Implement deployment automation  \\\\\\\\n3. Implement full test coverage  \\\\\\\\n4. Add static analysis in manual or automated form  \\\\\\\\n5. Prepare separate detailed development documentation (for V1)  \\\\\\\\n6. Prepare examples for use  \\\\\\\\n7. Scope and implement a full PoC Dapp\\\\\\\\n\\\\\\\\n#### Definition of Done\\\\\\\\n\\\\\\\\nWe consider the solution as ready for release when it is deployed on a public/available testnet, with released code and artifacts in a state that is ready for audit or early integration. This functionally equates to a testnet release.\\\\\\\\n\\\\\\\\nThis release constitutes a fully delivered project.\\\\\\\\n\\\\\\\\nThe release includes a **working PoC** with demonstrable functionality.\\\\\\\\n\\\\\\\\nThe release does not depend upon audits and integrations with third parties.\\\\\\\\n\\\\\\\\nMOONSTRUCK will be fully committed to assist with any work required to fix any security issues discovered as well as integration to other projects.\\\\\\\\n\\\\\\\\n#### Level of Effort and Timeline \\\\\\\\\\\\\\\\- Development Phase\\\\\\\\n\\\\\\\\nBased on the provisional scope of the project and the expert estimation we are able to provide a provisional engagement for the project with required roles and effort.\\\\\\\\n\\\\\\\\nThis project would be handled by a single Agile pod team with the project being their sole focus during the active development phase. Beyond that, experts will be made available to the pod based on task and project requirements. These team members constitute core and support roles:\\\\\\\\n\\\\\\\\n##### Core Roles\\\\\\\\n\\\\\\\\n| Role | Responsibilities | Effort |\\\\\\\\n| :---- | :---- | :---- |\\\\\\\\n| Project Lead, Blockchain Architect | Leadership, reporting, development | Part Time |\\\\\\\\n| Blockchain Engineer | Development, testing | Full Time |\\\\\\\\n| Blockchain Engineer | Development, testing | Full Time |\\\\\\\\n\\\\\\\\n##### Support Roles\\\\\\\\n\\\\\\\\n| Role | Responsibilities | Effort |\\\\\\\\n| :---- | :---- | :---- |\\\\\\\\n| Engineer in Test | Test automation | Part Time |\\\\\\\\n| Technical Writer | Documentation | Part Time |\\\\\\\\n| Devops | CI/CD, project deployment | Part Time |\\\\\\\\n\\\\\\\\n##### Timeline\\\\\\\\n\\\\\\\\nWe suggest the following timeline for the project, measured in **two week sprints**:\\\\\\\\n\\\\\\\\n| Sprints | Description | Goals |\\\\\\\\n| :---- | :---- | :---- |\\\\\\\\n| 1 | Finish gap analysis, perform spikes and fill backlog | Initial task backlog |\\\\\\\\n| 2, 3 | Perform smoke testing, write test scenarios, write automated tests, set up initial CI/CD, tech debt analysis | Alpha w/ demonstration capability, basic CI/CD pipeline |\\\\\\\\n| 4, 5 | Improved test coverage, tech debt resolution tasks, initial documentation, PoC candidate planning | Basic prototype w/ demonstration capability, documentation, PoC plan |\\\\\\\\n| 6 | PoC development, deployment to testnet, developer documentation, examples | Release Candidate: deployed to testnet w/ working PoC |\\\\\\\\n\\\\\\\\nTotal estimate for delivery of the **proposed scope for V1** amounts to **three months** of effort for the engaged team.\\\\\\\\n\\\\\\\\n##### Release schedule\\\\\\\\n\\\\\\\\n| Release | End of sprint | Goal |\\\\\\\\n| :---- | :---- | :---- |\\\\\\\\n| Alpha | 3 | Local release with a demonstrable happy path available |\\\\\\\\n| RC1 | 6 | Fully featured V1 release deployed to testnet with a working PoC |\\\\\\\\n\\\\\\\\n#### Level of Effort and Timeline \\\\\\\\\\\\\\\\- Support Phase\\\\\\\\n\\\\\\\\nAfter the release, we would assign a maintenance team to support the V1 release, ensuring it is working to spec and assisting other development teams with integration. Maintenance will also cover a certain amount of tech debt resolution from the development phase. This role includes redundant effort to ensure availability of support.\\\\\\\\n\\\\\\\\n##### Support Roles\\\\\\\\n\\\\\\\\n| Role | Responsibilities | Effort |\\\\\\\\n| :---- | :---- | :---- |\\\\\\\\n| Blockchain Engineer | Maintenance and support | Part time |\\\\\\\\n| Blockchain Engineer | Maintenance and support | Part time |\\\\\\\\n\\\\\\\\nWe would commit the core support roles to work on maintenance and support tasks for a period of **nine months**.\\\\\\\\n\\\\\\\\n#### Commentary\\\\\\\\n\\\\\\\\nMoonstruck wishes to engage and own this project long term. Our goal is to support the expansion of this protocol towards V2 and beyond. Therefore one of the primary outcomes of working on V1 is to get the team acquainted with an expert level of understanding of the underlying protocol, technology and concepts.\\\\\\\\n\\\\\\\\nOur hope is to reach a level of understanding towards our provisional scope and best-effort analysis as well as continuous improvements towards the protocol with a close relations\\\\\\\\n\\\\\\\\n## Budget\\\\\\\\n\\\\\\\\n### Budget Total\\\\\\\\n\\\\\\\\nWe have estimated the total budget for the project as:\\\\\\\\n\\\\\\\\n- **USD 98.000** for the development phase (over 3 months)  \\\\\\\\n- **USD 72.000** for the support phase (over 9 months)\\\\\\\\n\\\\\\\\nFor a total of ***USD 170.000*** over a period of 1 year.\\\\\\\\n\\\\\\\\n### Budget Breakdown\\\\\\\\n\\\\\\\\nWe suggest the following budget breakdown and payment structure:\\\\\\\\n\\\\\\\\nFor the development phase we suggest the following payouts:\\\\\\\\n\\\\\\\\n| Milestone | Time of payment (after project start) | Amount |\\\\\\\\n| :---- | :---- | :---- |\\\\\\\\n| Alpha | 1.5 months | USD 50.000 |\\\\\\\\n| RC1 | 3 months | USD 48.000 |\\\\\\\\n\\\\\\\\n| Total | USD 98.000 |\\\\\\\\n| :---- | :---- |\\\\\\\\n\\\\\\\\nFor the support phase we suggest the following retainer for the next ***9 months***.\\\\\\\\n\\\\\\\\n| Item | Recurring | Amount |\\\\\\\\n| :---- | :---- | :---- |\\\\\\\\n| Engineering Support | Monthly (x9) | USD 8000 |\\\\\\\\n\\\\\\\\n| Total | 72.000 |\\\\\\\\n| :---- | :---- |\\\\\\\\n\\\\\\\\n\", \"linked_proposals\": [], \"receiver_account\": \"bb5142ca412fb51a03ae4523f8f3dc77047d29e63c1c9e1ad8c5d019a4b64f3d\", \"requested_sponsor\": \"infrastructure-committee.near\", \"proposal_body_version\": \"V1\", \"requested_sponsorship_usd_amount\": \"170000\", \"requested_sponsorship_paid_in_currency\": \"USDC\"}, \"labels\": [\"Bridges\", \"Other\"]}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.2738564705035e+21
    }
  },
  {
    "id": "8165240954",
    "receipt_id": "Hrb2APFoUZAyS31Q7mP2Z2ioGcwnqjWu8FMDyqiGviLE",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "social.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "5D5r9VBNauLEH4vxsrbb24kkxJzTFib5WPvcJfC9r9kW",
      "block_height": 127643792,
      "block_timestamp": 1725875861598256000
    },
    "receipt_outcome": {
      "gas_burnt": 3532407184961,
      "tokens_burnt": 353240718496100000000,
      "executor_account_id": "social.near",
      "status": true
    },
    "transaction_hash": "2tHx77RLYKm9zN7H6871ZaatCSmud7qXeba2jK7dqaHh",
    "included_in_block_hash": "3e6Qq5ZFLm9TULt3S6X18zH2xjpTMAhJQyPyWb68jAV5",
    "block_timestamp": "1725875859186914303",
    "block": {
      "block_height": 127643790
    },
    "receipt_conversion_tokens_burnt": "111172083261000000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set",
        "deposit": 0,
        "fee": 353240718496100000000,
        "args": "{\"data\": {\"infrastructure-committee.near\": {\"index\": {\"notify\": \"{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"bb5142ca412fb51a03ae4523f8f3dc77047d29e63c1c9e1ad8c5d019a4b64f3d\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"proposal/edit\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"proposal\\\\\\\\\\\\\\\":18,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"bb5142ca412fb51a03ae4523f8f3dc77047d29e63c1c9e1ad8c5d019a4b64f3d\\\\\\\\\\\\\\\"}}\"}}}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.2738564705035e+21
    }
  },
  {
    "id": "8170617743",
    "receipt_id": "H2qZ7ScE5gRKTnLJUn8JTyRzHtnM5GgyL1PVCACwbe6c",
    "predecessor_account_id": "7b060e2e85dbdfbd1ad55e735c4b28da904f7df9f9d409bb0c422923010ac99c",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "54dgCLfasSnEYagmpukCijA6P75weDpLAZDcD5jJ4s4y",
      "block_height": 127659377,
      "block_timestamp": 1725893165211934200
    },
    "receipt_outcome": {
      "gas_burnt": 10691625648251,
      "tokens_burnt": 1.0691625648251e+21,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "2JNSLV7xzPtxmrqEvLuduHpWxSzfsJ5F2b5AXtCQnU4k",
    "included_in_block_hash": "AFzu3YBpPUnVFxJz88rqq6zmYa1gxKZ5kuSiY77Kkh82",
    "block_timestamp": "1725893164169683821",
    "block": {
      "block_height": 127659376
    },
    "receipt_conversion_tokens_burnt": "31444911781000000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "edit_proposal_timeline",
        "deposit": 0,
        "fee": 1.0691625648251e+21,
        "args": "{\"id\": 15, \"timeline\": {\"status\": \"REVIEW\", \"sponsor_requested_review\": false, \"reviewer_completed_attestation\": false}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.4538481951022e+21
    }
  },
  {
    "id": "8170618266",
    "receipt_id": "ALRD95egD1qYZhULCYrCKwD5sySB2TZPzqg4ASbz4GnC",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "social.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "7VWvR1353h6YBa1iFD8riXVpSknr5rKcxoMTyGxwSvJq",
      "block_height": 127659378,
      "block_timestamp": 1725893166419925500
    },
    "receipt_outcome": {
      "gas_burnt": 3532407184961,
      "tokens_burnt": 353240718496100000000,
      "executor_account_id": "social.near",
      "status": true
    },
    "transaction_hash": "2JNSLV7xzPtxmrqEvLuduHpWxSzfsJ5F2b5AXtCQnU4k",
    "included_in_block_hash": "AFzu3YBpPUnVFxJz88rqq6zmYa1gxKZ5kuSiY77Kkh82",
    "block_timestamp": "1725893164169683821",
    "block": {
      "block_height": 127659376
    },
    "receipt_conversion_tokens_burnt": "31444911781000000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set",
        "deposit": 0,
        "fee": 353240718496100000000,
        "args": "{\"data\": {\"infrastructure-committee.near\": {\"index\": {\"notify\": \"{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"7b060e2e85dbdfbd1ad55e735c4b28da904f7df9f9d409bb0c422923010ac99c\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"proposal/edit\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"proposal\\\\\\\\\\\\\\\":15,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"7b060e2e85dbdfbd1ad55e735c4b28da904f7df9f9d409bb0c422923010ac99c\\\\\\\\\\\\\\\"}}\"}}}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.4538481951022e+21
    }
  }
]