[
  {
    "id": "8603645729",
    "receipt_id": "CwbP9eP1rNTq4V92ajFFouWUbHNUz2Upo1Z5919godNU",
    "predecessor_account_id": "trechriron71.near",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "5HtBax1cUhR9bZR4D4cuJdABCdyLoyTxa2BMLmBCwmND",
      "block_height": 128747455,
      "block_timestamp": 1727127748146974200
    },
    "receipt_outcome": {
      "gas_burnt": 3353693879124,
      "tokens_burnt": 335369387912400000000,
      "executor_account_id": "infrastructure-committee.near",
      "status": false
    },
    "transaction_hash": "B935EtRj1Q25AzQtxpQvCwBtHyn1pVGa2LqFAgP3kqy2",
    "included_in_block_hash": "HiiJ14vsArVHvV6vACYi9zV4qK7xroqMdUk5QiKtqb1j",
    "block_timestamp": "1727127746999654444",
    "block": {
      "block_height": 128747454
    },
    "receipt_conversion_tokens_burnt": "121047380637500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "add_rfp",
        "deposit": 0,
        "fee": 335369387912400000000,
        "args": "{\"body\": {\"name\": \"New Operator for near.org RPC Service\", \"summary\": \"As [Pagoda winds down its services](https://docs.near.org/blog/2024-08-13-pagoda-services) and critical infrastructure, there is a need to transition the management and development of the near.org RPC service, which is being used as a public good in the ecosystem, with a clear service level agreement for the chosen vendor.\", \"description\": \"## Overview\\\\\\\\n\\\\\\\\nAs [Pagoda winds down its services](https://docs.near.org/blog/2024-08-13-pagoda-services) and critical infrastructure, there is a need to transition the management and development of the near.org RPC service, which is being used as a public good in the ecosystem, with a clear service level agreement for the chosen vendor.\\\\\\\\n\\\\\\\\nnear.org RPC currently operates as a high-capacity NEAR RPC service, entirely subsidized by the NEAR Foundation. It is used by countless applications and wallets, including some of the most popular NEAR applications. However, we recognize that, by being hosted on near.org and offered at no cost to developers, the service contributes to unwanted centralization of the NEAR ecosystem.  \\\\\\\\n\\\\\\\\nNear.org RPC will become a heavily rate-limited \\\\\\\\u{201c}free tier\\\\\\\\u{201d} or demo-only service, maintaining backward compatibility with existing dev tooling and low-traffic applications.  High-traffic applications will be responsible for migrating their RPC usage to an alternative provider.  As part of this RFP, the new operator for this rate-limited near.org RPC service will be allowed to advertise their related commercial offering to these users, with the limits described below.\\\\\\\\n\\\\\\\\n## Technical Overview\\\\\\\\n\\\\\\\\nThe Infrastructure Committee (IC) seeks a new operator for these four URLs during or after the transformation into a free-tier-only service:\\\\\\\\n\\\\\\\\n* [https://rpc.mainnet.near.org](https://rpc.mainnet.near.org)\\\\\\\\n* [https://rpc.testnet.near.org](https://rpc.testnet.near.org)\\\\\\\\n* [https://archival-rpc.mainnet.near.org](https://archival-rpc.mainnet.near.org)\\\\\\\\n* [https://archival-rpc.testnet.near.org](https://archival-rpc.testnet.near.org)\\\\\\\\n\\\\\\\\nThe current implementation of near.org RPC relies primarily on [Read-RPC](https://github.com/near/read-rpc/), a specially optimized backend server, and a ScyllaDB database built to handle NEAR RPC queries at scale. Some requests are routed to a scaled fleet of standard or archival [NEAR RPC nodes](https://near-nodes.io/rpc) running on Google Cloud. All underlying systems conform to the [NEAR RPC API regardless of where a request is routed](https://docs.near.org/api/rpc/introduction).\\\\\\\\n\\\\\\\\nThe new operator is welcome to use any or all of the current setups or their own. However, they must establish new relationships with the necessary cloud service providers.\\\\\\\\n\\\\\\\\n### Current Rate Limits\\\\\\\\n\\\\\\\\nThese are the existing rate limits applied by Pagoda (current maintainers).\\\\\\\\n\\\\\\\\n* RPC\\\\\\\\n  * 9000 requests/10s (27000 requests/30s) per IP (mainnet)\\\\\\\\n  * 2000 requests/30s per IP (testnet)\\\\\\\\n* Archival-RPC\\\\\\\\n  * 1000 requests/30s per IP (mainnet)\\\\\\\\n  * 2000 requests/30s per IP (testnet)\\\\\\\\n\\\\\\\\nNote: There is no authentication on these RPC endpoints.\\\\\\\\n\\\\\\\\nA few NEAR Foundation partners (dApps) are exempt from the rate limits above, consume a high load of RPC services, and receive white glove service provided by the Pagoda SRE team. They\\\\\\\\u{2019}re identified by using special Referer headers in their requests. These partners have been notified that this level of service will be ending, and they have been encouraged to move out to alternative RPC providers that meet their production demands. After 01-Feb-2025, if they choose to remain on near.org RPC, they will be subject to the same rate limits as everyone else.\\\\\\\\n\\\\\\\\n### Transformation into Demo Environment\\\\\\\\n\\\\\\\\nAs mentioned above, we seek to turn near.org RPC into a free-tier / demo environment only by gradually lowering rate limits until the beginning of February.\\\\\\\\n\\\\\\\\nPagoda will execute this transformation according to the schedule below until the new operator takes over; at this point, they will be expected to continue that transformation. The Infrastructure Committee will prioritize proposals for an earlier transition to the new operator instead of waiting for the Pagoda team to finish lowering the rate limits.\\\\\\\\n\\\\\\\\nThis RFP aims to ensure that the special partners using near.org RPC for high-traffic loads are not adversely affected during and after this transition period. Near Foundation will work with the Pagoda SRE team and the new operator to ensure that their workload seamlessly migrates to the new RPC provider of their choice.\\\\\\\\n\\\\\\\\nOctober 15th:\\\\\\\\n\\\\\\\\n* **RPC Mainnet:** 15000 requests/30s per IP\\\\\\\\n* **RPC Testnet:** 1500 requests/30s per IP\\\\\\\\n* **Archival-RPC Mainnet:** 800 requests/30s per IP\\\\\\\\n* **Archival-RPC Testnet:** 1500 requests/30s per IP\\\\\\\\n\\\\\\\\nNovember 1st\\\\\\\\n\\\\\\\\n* **RPC Mainnet**: 5000 requests/30s per IP **or referrer**\\\\\\\\n* **RPC Testnet**: 1200 requests/30s per IP **or referrer**\\\\\\\\n* **Archival-RPC Mainnet**: 400 requests/30s per IP **or referrer**\\\\\\\\n* **Archival-RPC Testnet**: 800 requests/30s per IP **or referrer**\\\\\\\\n\\\\\\\\nDecember 1st\\\\\\\\n\\\\\\\\n* **RPC Mainnet**: 2000 requests/30s per IP or referrer\\\\\\\\n* **RPC Testnet**: 900 requests/30s per IP or referrer\\\\\\\\n* **Archival-RPC Mainnet**: 200 requests/30s IP or referrer\\\\\\\\n* **Archival-RPC Testnet**: 400 requests/30s per IP or referrer\\\\\\\\n\\\\\\\\nJanuary 1:\\\\\\\\n\\\\\\\\n* **RPC Mainnet**: 500 requests/30s per IP or referrer\\\\\\\\n* **RPC Testnet**: 600 requests/30s per IP or referrer\\\\\\\\n* **Archival-RPC Mainnet**: 100 requests/30s per IP or referrer\\\\\\\\n* **Archival-RPC Testnet**: 200 requests/30s per IP or referrer\\\\\\\\n\\\\\\\\nFebruary 1st\\\\\\\\n\\\\\\\\n* **RPC Mainnet**: 150 req/30s per IP or referrer\\\\\\\\n* **RPC Testnet**: 300 requests/30s per IP or referrer\\\\\\\\n* **Archival-RPC Mainnet**: 20 requests/30s per IP or referrer\\\\\\\\n* **Archival-RPC Testnet**: 100 requests/30s per IP or referrer\\\\\\\\n\\\\\\\\nNote: Rate limits will be applied by IP or by the HTTP \\\\\\\\u{201c}Referer\\\\\\\\u{201d} header, whichever hits first. Frontend applications will likely be rate-limited by the referrer, while backend applications will likely be rate-limited by the IP address.\\\\\\\\n\\\\\\\\n## Requirements\\\\\\\\n\\\\\\\\nThe maintenance requirements of this RPC service are listed below:\\\\\\\\n\\\\\\\\n* Collaborate with Pagoda SRE for any knowledge transfer and handover of the current endpoints\\\\\\\\n  * The current load balancer maintained by the Pagoda SRE team allows for a gradual transition. This will help ensure a smoother transition and better downtime management during the transition phase.\\\\\\\\n  * 100% target date before 01-Feb-2025, but we encourage an earlier transition during the rate limit decrease (as mentioned above), especially for overflow business\\\\\\\\n* Timely nearcore upgrades. There is a five-day time frame for deploying the latest [nearcore releases](https://github.com/near/nearcore/releases).\\\\\\\\n* Maintain monitoring and alerting system, showing the health of RPC systems\\\\\\\\n* Maintain external-facing status page (for example, [Helius Network](https://helius.statuspage.io/)) showing incidents and uptimes, and communicate across company social platforms and relevant partners.\\\\\\\\n\\\\\\\\n### Security\\\\\\\\n\\\\\\\\n* Proposals must include a comprehensive security plan, including DDoS protection measures, IP whitelisting capabilities, and detailed logging and monitoring strategies.\\\\\\\\n* Vendors must provide a detailed disaster recovery and business continuity plan, including regular backup procedures and a strategy for quick service restoration in case of major outages.\\\\\\\\n\\\\\\\\n### Service Level Agreement\\\\\\\\n\\\\\\\\n1. **Availability**\\\\\\\\n    * **Uptime Guarantee**: 99.9% monthly uptime\\\\\\\\n    * **Downtime Allowance**: Up to 44 minutes of downtime per month\\\\\\\\n\\\\\\\\n2. **Performance**\\\\\\\\n    * These are tracked internally and shared with the Infrastructure Committee (IC)**\\\\\\\\n    * **Response Time**:\\\\\\\\n    * **Mainnet RPC**: Average response time of \\\\\\\\u{2264} 1 second\\\\\\\\n    * **Testnet RPC**: Average response time of \\\\\\\\u{2264} 1.5 seconds\\\\\\\\n    * **Archival-RPC**: Average response time of \\\\\\\\u{2264} 2 seconds\\\\\\\\n    * **Rate Limiting**:\\\\\\\\n    * 150 req/30s\\\\\\\\n    * **Rate Limit Enforcement**: Strict enforcement with immediate rate limit application once thresholds are reached\\\\\\\\n    * Note: It would be good to have an external dashboard with these stats and historical data for the last 30 days.\\\\\\\\n\\\\\\\\n3. **Pricing**\\\\\\\\n    * The new RPC service provider must not accept payments for RPC services on near.org. However, it can advertise its service as a separate paid RPC with higher rate limits, as described below.\\\\\\\\n\\\\\\\\n4. **Advertising**\\\\\\\\n    * If you serve GET requests or a homepage at any of the RPC URLs above, that page can advertise your associated services, but it must:\\\\\\\\n    * Make it clear in postings or advertisements that your services are not directly affiliated with or operated by NEAR or the NEAR Foundation.\\\\\\\\n    * Include a prominent link to [https://docs.near.org/api/rpc/providers](https://docs.near.org/api/rpc/providers).  \\\\\\\\n\\\\\\\\n5. When a user is rate-limited, you must return an HTTP 429 response.\\\\\\\\n    * The response body is up to you and can also be used to advertise your associated services.  But if you do so, that response body must also contain the URL [https://docs.near.org/api/rpc/providers](https://docs.near.org/api/rpc/providers).\\\\\\\\n        * For instance, an acceptable response body is <code>{\\\\\\\\\\\\\\\"jsonrpc\\\\\\\\\\\\\\\": \\\\\\\\\\\\\\\"2.0\\\\\\\\\\\\\\\", \\\\\\\\\\\\\\\"error\\\\\\\\\\\\\\\": {\\\\\\\\\\\\\\\"code\\\\\\\\\\\\\\\": -429, \\\\\\\\\\\\\\\"message\\\\\\\\\\\\\\\": \\\\\\\\\\\\\\\"Rate limits exceeded. For higher rate limits, try [http://myrpcprovider.example](http://myrpcprovider.example) or other RPC providers at [https://docs.near.org/api/rpc/providers](https://docs.near.org/api/rpc/providers).\\\\\\\\\\\\\\\"}, \\\\\\\\\\\\\\\"id\\\\\\\\\\\\\\\": \\\\\\\\\\\\\\\"1\\\\\\\\\\\\\\\"}</code>.\\\\\\\\n\\\\\\\\n6. The Infrastructure Committee may from time to time evaluate any advertising on the near.org RPC service and demand changes within reason to conform to the guidelines above.\\\\\\\\n\\\\\\\\n7. **Support**\\\\\\\\n    * **Support Availability**: Community-based support only (e.g., through online help desk, forums, GitHub issues, or a developer community Slack/Telegram/Discord channel)\\\\\\\\n    * **Response Time**: No guaranteed response time, but best-effort responses within 24-48 hours for generic services.\\\\\\\\n\\\\\\\\n8. **Data Integrity**\\\\\\\\n    * **Data Consistency**: Standard (non-archival) RPC nodes must always serve five-time epochs. Both RPC and Archival nodes track all NEAR shards.\\\\\\\\n\\\\\\\\n9. **Updates and Changes**\\\\\\\\n    * **Notice for Breaking Changes**: At least seven days\\\\\\\\\\\\' notice for any breaking changes in the API or infrastructure\\\\\\\\n\\\\\\\\n10. **Limitations**\\\\\\\\n    * **Compensation for Outages:** There are no financial credits or compensation for outages or performance issues for free public good services. However, if there are partners who utilize your paid service, they should agree on separate customized SLAs with the RPC provider directly.\\\\\\\\n    * **Fair Use Policy**: Provide Explicit statements about the intended use for development and the prohibition of production workloads\\\\\\\\n\\\\\\\\n11. **Termination Rights**: The right to suspend or terminate the service for users who exceed fair use or misuse the service. IC must be informed about these.\\\\\\\\n\\\\\\\\n12. **Failure to Perform:** If vendor RPC services fall below the performance benchmarks mentioned above, the Infrastructure Committee has the right to transition this public good to another vendor. The current maintainer will be required to facilitate the transition.\\\\\\\\n\\\\\\\\n### Technology Guidelines\\\\\\\\n\\\\\\\\nPreferences\\\\\\\\n\\\\\\\\n* Proposers are encouraged to use current technology (load balancers, readrpc, nodes) and optimize performance to save on costs.\\\\\\\\n* Preference (not requirement) to decentralized RPC\\\\\\\\n\\\\\\\\n### Expertise Guidelines\\\\\\\\n\\\\\\\\n* Already operating current NEAR RPC nodes\\\\\\\\n* Preference (not requirement) Pagoda ex-employees, including SREs that previously maintained this infrastructure or other existing NEAR ecosystem partners\\\\\\\\n\\\\\\\\n## Transition steps for the selected vendor\\\\\\\\n\\\\\\\\n1. Set up necessary access and permissions for the new team for DNS records and any other associated infrastructure related to DNS service (for example - load balancers)\\\\\\\\n2. Conduct knowledge transfer sessions with the current Pagoda team, including one on [ReadRPC,](https://github.com/near/read-rpc) in case the vendor wants to inherit that tech.\\\\\\\\n3. Implement and test any necessary changes or improvements to the infrastructure.\\\\\\\\n4. Perform thorough testing to ensure data integrity and system performance.\\\\\\\\n5. Gain access to relevant documentation.\\\\\\\\n6. Establish new support channels and processes.\\\\\\\\n7. Conduct a final review and handover with the Infrastructure Committee.\\\\\\\\n8. Conduct official communications on your channels and with the NEAR Developer ecosystems and relevant stakeholders.\\\\\\\\n\\\\\\\\n### Budget Guidelines\\\\\\\\n\\\\\\\\n#### Budget\\\\\\\\n\\\\\\\\nProposals should outline a detailed budget with a clear breakdown of costs, including development, testing, documentation, maintenance and support, infrastructure, third-party services, and external API costs. Maintenance costs should be calculated accurately based on provided usage information and existing software costs. Properly assessing a budget based on usage is a significant factor in qualifying legitimate entities.\\\\\\\\n\\\\\\\\n#### Milestones\\\\\\\\n\\\\\\\\nPlease highlight the details of the various milestones in your development plan and the relevant budgets attached to each milestone. Any metrics around the milestone\\\\\\\\\\\\'s success (acceptance criterion) should also be included. Milestone examples include signing the agreement, the official transition, a 6-month or 12-month billing period, etc.\\\\\\\\n\\\\\\\\n#### Contingency\\\\\\\\n\\\\\\\\nInclude a contingency plan for potential overruns or unexpected expenses. Suppose expenses for providing free services or public goods to the NEAR ecosystem exceed previous budgets. In that case, a clear policy should be to report expenses incurred by NEAR usage to cover additional costs and prove that costs exceeded previous budgets.\\\\\\\\n\\\\\\\\n## Current Usage\\\\\\\\n\\\\\\\\nBelow are some of the statistics related to the current usage of RPC services provided by the Pagoda SRE team:\\\\\\\\n\\\\\\\\n* RPC Mainnet - 6k requests/s\\\\\\\\n* RPC-Archival Mainnet - 2k requests/s\\\\\\\\n* RPC Testnet - 400 requests/s\\\\\\\\n* RPC-Archival Testnet - 150 requests/s\\\\\\\\n\\\\\\\\nRequests have been stagnant, fluctuating from a steady 10k RPS to peaks of 25k RPS.\\\\\\\\n\\\\\\\\n## Evaluation Criteria\\\\\\\\n\\\\\\\\n### Technical Expertise and Experience\\\\\\\\n\\\\\\\\n* Demonstrated expertise in building and maintaining high-performance RPC infrastructure for blockchain networks\\\\\\\\n* Minimum two years of experience working with blockchain RPC systems\\\\\\\\n* Strong understanding of NEAR protocol architecture and technical specifications\\\\\\\\n* Proven track record of handling high transaction volumes and ensuring low latency\\\\\\\\n* Experience with scalable and fault-tolerant distributed systems\\\\\\\\n\\\\\\\\n### Past Performance\\\\\\\\n\\\\\\\\n* Completed at least one similar RPC infrastructure project for blockchain networks\\\\\\\\n* Positive references from previous blockchain clients or projects\\\\\\\\n* Demonstrated ability to meet or exceed service level agreements (SLAs) for uptime and performance\\\\\\\\n\\\\\\\\n### Pricing Structure\\\\\\\\n\\\\\\\\n* A clear breakdown of costs for implementation, maintenance, and scaling\\\\\\\\n* Willingness to consider performance-based pricing incentives\\\\\\\\n\\\\\\\\n### Alignment with Web3 and NEAR Values\\\\\\\\n\\\\\\\\n* Commitment to decentralization and open-source principles\\\\\\\\n* Demonstrated support for blockchain interoperability and cross-chain communication\\\\\\\\n* Alignment with NEAR\\\\\\\\\\\\'s vision of empowering developers and users\\\\\\\\n* Commitment to privacy and data protection in line with Web3 ethos\\\\\\\\n\\\\\\\\n### Governance Structure\\\\\\\\n\\\\\\\\n* Clear and transparent decision-making processes within the organization\\\\\\\\n* Defined roles and responsibilities for project management and technical leadership\\\\\\\\n* Commitment to regular communication and reporting to NEAR stakeholders\\\\\\\\n* Willingness to participate in NEAR\\\\\\\\\\\\'s governance processes and community discussions\\\\\\\\n\\\\\\\\n## Resources\\\\\\\\n\\\\\\\\nImportant - All NEAR-related RPC information can be found at [https://docs.near.org/api/rpc/providers](https://docs.near.org/api/rpc/providers) (it is also important to note that many of these providers also offer free RPC service)\\\\\\\\n\\\\\\\\n## Process\\\\\\\\n\\\\\\\\n[//]: # (Boilerplate)\\\\\\\\n\\\\\\\\n**[Proposal Process](https://docs.google.com/document/d/1F7iAT9tWngik9JPS_GadCCEB5nZtA2AiL2yWZoBGMFM/pub)**\\\\\\\\n\\\\\\\\nYou should submit a proposal in response to this RFP on the Infrastructure Committee Portal. [Here](https://docs.google.com/document/d/1TVvPXPJhZfaFwfA2UMW6c3pO2kis45SJ1Np1XOkkhnA/edit?usp=sharing) is a standard (+ [markup](https://docs.google.com/document/d/1UZRfOE1JAOhsnSmp-RmL2hY7KPJbpBImKZVvPV4YJmA/edit?usp=sharing)) template you can use as a starting point.\\\\\\\\n\\\\\\\\nMarketing materials, presentations, and images can be attached as needed as external links. An easy way to do this is to start a discussion under the Proposals category on the Infrastructure Working Group GitHub repository [here](https://github.com/near/Infrastructure-Working-Group/discussions/categories/proposals), publish, edit the post, and finally copy the links generated for the files you uploaded.\\\\\\\\n\\\\\\\\n### Proposal Submission Dates\\\\\\\\n\\\\\\\\nThe deadline for proposal submission is **Monday, October 7th** (giving applicants approximately two weeks), with a Q&A period on the proposal itself.\\\\\\\\n\\\\\\\\n### Selection Process\\\\\\\\n\\\\\\\\nAfter reviewing the proposals, the committee will vote on the best one. Generally, this process takes two working weeks to complete and will be discussed and voted on at the regular bi-weekly meeting.\\\\\\\\n\\\\\\\\n### Voting Dates\\\\\\\\n\\\\\\\\nThe estimate for voting completion is **two weeks** after the proposal submission date.\\\\\\\\n\\\\\\\\n### Transition Process\\\\\\\\n\\\\\\\\nThe estimated transition time is one week, not considering any KYC or KYB blockers.  \\\\\\\\n\\\\\\\\n### Funding Process\\\\\\\\n\\\\\\\\nThe Infrastructure Committee governs funding with assistance from the NEAR Foundation. If selected, your proposal enters the funding pipeline. You are required to:\\\\\\\\n\\\\\\\\n* Complete the KYC/B process conducted by the NEAR Foundation, including verification by IDVerify.\\\\\\\\n* Sign a legal agreement regarding the work as outlined in the proposal conducted by the NEAR Foundation.\\\\\\\\n* Submit an invoice to NEAR Foundation Finance outlining how you want funds disbursed, to what wallets or banks, and in the agreed-upon amounts.\\\\\\\\n* Complete a test transaction to verify target wallets (when requesting funds in cryptocurrency).\\\\\\\\n\\\\\\\\n### Funding Dates\\\\\\\\n\\\\\\\\nThe funding process is generally completed in one working week if the proposal does not require clarifications in the budget, work approach, legal agreement, or invoicing terms.\\\\\\\\n\\\\\\\\n### Communication\\\\\\\\n\\\\\\\\nPlease direct all communications to the thread where the RFP started beneath the submitted proposal. Please direct confidential or sensitive communications to the Telegram group set up between the committee and the organization/entity/team. If you don\\\\\\\\\\\\'t have a private Telegram group between your team and the Infrastructure Committee, please request one in this thread.\\\\\\\\n\", \"rfp_body_version\": \"V0\", \"submission_deadline\": \"1728259200000000000\"}, \"labels\": [\"RPC Nodes\"]}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": false
    },
    "outcomes_agg": {
      "transaction_fee": 456416768549900000000
    }
  },
  {
    "id": "8620598250",
    "receipt_id": "4jGUtDRYX5iHHoUnAyifpxywtchJn8BikhQDWJoUz8Nf",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "social.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "AeW3cRZk7qDK3SH8LGvF9dvfVkS4jpL9HAXmuNk7ktv7",
      "block_height": 128787549,
      "block_timestamp": 1727177422469428200
    },
    "receipt_outcome": {
      "gas_burnt": 7981286029365,
      "tokens_burnt": 798128602936500000000,
      "executor_account_id": "social.near",
      "status": true
    },
    "transaction_hash": "5gXTZGHjmPWAF1KwtFdfFzqGpQU4rgAdSD2R5Qc9Ue89",
    "included_in_block_hash": "HcqkCSQGDdsEQcAg3iYprZU5ek9hWbE7oLF8LadrMfkH",
    "block_timestamp": "1727177421156188726",
    "block": {
      "block_height": 128787548
    },
    "receipt_conversion_tokens_burnt": "147592904778000000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set",
        "deposit": 0,
        "fee": 798128602936500000000,
        "args": "{\"data\": {\"infrastructure-committee.near\": {\"widget\": {\"components.rfps.Editor\": {\"\": \"const { RFP_TIMELINE_STATUS, parseJSON } = VM.require(\\\\\\\\n  `infrastructure-committee.near/widget/core.common`\\\\\\\\n) || { RFP_TIMELINE_STATUS: {}, parseJSON: () => {} };\\\\\\\\nconst { href } = VM.require(`devhub.near/widget/core.lib.url`);\\\\\\\\nconst draftKey = \\\\\\\\\\\\\\\"INFRA_RFP_EDIT\\\\\\\\\\\\\\\";\\\\\\\\nhref || (href = () => {});\\\\\\\\nconst { getGlobalLabels } = VM.require(\\\\\\\\n  `infrastructure-committee.near/widget/components.core.lib.contract`\\\\\\\\n) || { getGlobalLabels: () => {} };\\\\\\\\nconst { id, timestamp } = props;\\\\\\\\nconst isEditPage = typeof id === \\\\\\\\\\\\\\\"string\\\\\\\\\\\\\\\";\\\\\\\\nconst author = context.accountId;\\\\\\\\nconst FundingDocs =\\\\\\\\n  \\\\\\\\\\\\\\\"https://github.com/near/Infrastructure-Working-Group/wiki/Funding-Process-%E2%80%90-Company\\\\\\\\\\\\\\\";\\\\\\\\nconst CoCDocs =\\\\\\\\n  \\\\\\\\\\\\\\\"https://github.com/near/Infrastructure-Working-Group/wiki/Code-Of-Conduct\\\\\\\\\\\\\\\";\\\\\\\\nconst rfpLabelOptions = getGlobalLabels();\\\\\\\\nconst isAllowedToWriteRfp = Near.view(\\\\\\\\n  \\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\n  \\\\\\\\\\\\\\\"is_allowed_to_write_rfps\\\\\\\\\\\\\\\",\\\\\\\\n  {\\\\\\\\n    editor: context.accountId,\\\\\\\\n  }\\\\\\\\n);\\\\\\\\nif (!author || !isAllowedToWriteRfp) {\\\\\\\\n  return (\\\\\\\\n    <Widget src={`devhub.near/widget/devhub.entity.proposal.LoginScreen`} />\\\\\\\\n  );\\\\\\\\n}\\\\\\\\nlet editRfpData = null;\\\\\\\\nlet draftRfpData = null;\\\\\\\\nif (isEditPage) {\\\\\\\\n  editRfpData = Near.view(`infrastructure-committee.near`, \\\\\\\\\\\\\\\"get_rfp\\\\\\\\\\\\\\\", {\\\\\\\\n    rfp_id: parseInt(id),\\\\\\\\n  });\\\\\\\\n}\\\\\\\\nconst Container = styled.div`\\\\\\\\n  input {\\\\\\\\n    font-size: 14px !important;\\\\\\\\n  }\\\\\\\\n  .card.no-border {\\\\\\\\n    border-left: none !important;\\\\\\\\n    border-right: none !important;\\\\\\\\n    margin-bottom: -3.5rem;\\\\\\\\n  }\\\\\\\\n  textarea {\\\\\\\\n    font-size: 14px !important;\\\\\\\\n  }\\\\\\\\n  .full-width-div {\\\\\\\\n    width: 100vw;\\\\\\\\n    position: relative;\\\\\\\\n    left: 50%;\\\\\\\\n    right: 50%;\\\\\\\\n    margin-left: -50vw;\\\\\\\\n    margin-right: -50vw;\\\\\\\\n  }\\\\\\\\n  .text-sm {\\\\\\\\n    font-size: 13px;\\\\\\\\n  }\\\\\\\\n  .h5 {\\\\\\\\n    font-size: 18px !important;\\\\\\\\n  }\\\\\\\\n  @media screen and (max-width: 768px) {\\\\\\\\n    .h6 {\\\\\\\\n      font-size: 14px !important;\\\\\\\\n    }\\\\\\\\n    .h5 {\\\\\\\\n      font-size: 16px !important;\\\\\\\\n    }\\\\\\\\n    .text-sm {\\\\\\\\n      font-size: 11px;\\\\\\\\n    }\\\\\\\\n    .gap-6 {\\\\\\\\n      gap: 0.5rem !important;\\\\\\\\n    }\\\\\\\\n  }\\\\\\\\n  .border-bottom {\\\\\\\\n    border-bottom: var(--bs-card-border-width) solid var(--bs-card-border-color);\\\\\\\\n  }\\\\\\\\n  .text-xs {\\\\\\\\n    font-size: 10px;\\\\\\\\n  }\\\\\\\\n  .flex-2 {\\\\\\\\n    flex: 2;\\\\\\\\n  }\\\\\\\\n  .flex-1 {\\\\\\\\n    flex: 1;\\\\\\\\n  }\\\\\\\\n  .bg-grey {\\\\\\\\n    background-color: #f4f4f4;\\\\\\\\n  }\\\\\\\\n  .border-bottom {\\\\\\\\n    border-bottom: 1px solid grey;\\\\\\\\n  }\\\\\\\\n  .cursor-pointer {\\\\\\\\n    cursor: pointer;\\\\\\\\n  }\\\\\\\\n  .border-1 {\\\\\\\\n    border: 1px solid #e2e6ec;\\\\\\\\n  }\\\\\\\\n  .black-btn {\\\\\\\\n    background-color: #000 !important;\\\\\\\\n    border: none;\\\\\\\\n    color: white;\\\\\\\\n    &:active {\\\\\\\\n      color: white;\\\\\\\\n    }\\\\\\\\n  }\\\\\\\\n  .dropdown-toggle:after {\\\\\\\\n    position: absolute;\\\\\\\\n    top: 46%;\\\\\\\\n    right: 5%;\\\\\\\\n  }\\\\\\\\n  .drop-btn {\\\\\\\\n    max-width: none !important;\\\\\\\\n  }\\\\\\\\n  .dropdown-menu {\\\\\\\\n    width: 100%;\\\\\\\\n    border-radius: 0.375rem !important;\\\\\\\\n  }\\\\\\\\n  .input-icon {\\\\\\\\n    display: flex;\\\\\\\\n    height: 100%;\\\\\\\\n    align-items: center;\\\\\\\\n    border-right: 1px solid #dee2e6;\\\\\\\\n    padding-right: 10px;\\\\\\\\n  }\\\\\\\\n  /* Tooltip container */\\\\\\\\n  .custom-tooltip {\\\\\\\\n    position: relative;\\\\\\\\n    display: inline-block;\\\\\\\\n  }\\\\\\\\n  /* Tooltip text */\\\\\\\\n  .custom-tooltip .tooltiptext {\\\\\\\\n    visibility: hidden;\\\\\\\\n    width: 250px;\\\\\\\\n    background-color: #fff;\\\\\\\\n    color: #6c757d;\\\\\\\\n    text-align: center;\\\\\\\\n    padding: 10px;\\\\\\\\n    border-radius: 6px;\\\\\\\\n    font-size: 12px;\\\\\\\\n    border: 0.2px solid #6c757d;\\\\\\\\n    /* Position the tooltip text */\\\\\\\\n    position: absolute;\\\\\\\\n    z-index: 1;\\\\\\\\n    bottom: 125%;\\\\\\\\n    left: -30px;\\\\\\\\n    /* Fade in tooltip */\\\\\\\\n    opacity: 0;\\\\\\\\n    transition: opacity 0.3s;\\\\\\\\n  }\\\\\\\\n  /* Tooltip arrow */\\\\\\\\n  .custom-tooltip .tooltiptext::after {\\\\\\\\n    content: \\\\\\\\\\\\\\\"\\\\\\\\\\\\\\\";\\\\\\\\n    position: absolute;\\\\\\\\n    top: 100%;\\\\\\\\n    left: 15%;\\\\\\\\n    margin-left: -5px;\\\\\\\\n    border-width: 5px;\\\\\\\\n    border-style: solid;\\\\\\\\n    border-color: #555 transparent transparent transparent;\\\\\\\\n  }\\\\\\\\n  /* Show the tooltip text when you mouse over the tooltip container */\\\\\\\\n  .custom-tooltip:hover .tooltiptext {\\\\\\\\n    visibility: visible;\\\\\\\\n    opacity: 1;\\\\\\\\n  }\\\\\\\\n  .form-check-input:checked {\\\\\\\\n    background-color: #04a46e !important;\\\\\\\\n    border-color: #04a46e !important;\\\\\\\\n  }\\\\\\\\n  .gap-6 {\\\\\\\\n    gap: 2.5rem;\\\\\\\\n  }\\\\\\\\n  a.no-space {\\\\\\\\n    display: inline-block;\\\\\\\\n  }\\\\\\\\n  .fw-light-bold {\\\\\\\\n    font-weight: 600 !important;\\\\\\\\n  }\\\\\\\\n  .disabled .circle {\\\\\\\\n    opacity: 0.5;\\\\\\\\n  }\\\\\\\\n  .circle {\\\\\\\\n    width: 6px;\\\\\\\\n    height: 6px;\\\\\\\\n    border-radius: 50%;\\\\\\\\n  }\\\\\\\\n  .grey {\\\\\\\\n    background-color: #818181;\\\\\\\\n  }\\\\\\\\n  @media screen and (max-width: 970px) {\\\\\\\\n    .gap-6 {\\\\\\\\n      gap: 1.5rem !important;\\\\\\\\n    }\\\\\\\\n  }\\\\\\\\n  @media screen and (max-width: 570px) {\\\\\\\\n    .gap-6 {\\\\\\\\n      gap: 0.5rem !important;\\\\\\\\n    }\\\\\\\\n  }\\\\\\\\n`;\\\\\\\\nconst Heading = styled.div`\\\\\\\\n  font-size: 24px;\\\\\\\\n  font-weight: 700;\\\\\\\\n  @media screen and (max-width: 768px) {\\\\\\\\n    font-size: 18px;\\\\\\\\n  }\\\\\\\\n`;\\\\\\\\nfunction getTimestamp(date) {\\\\\\\\n  // in nanoseconds\\\\\\\\n  const parsedDate = date ? new Date(date) : new Date();\\\\\\\\n  return Math.floor(parsedDate.getTime() * 1000000).toString();\\\\\\\\n}\\\\\\\\nfunction getDate(timestamp) {\\\\\\\\n  const stamp =\\\\\\\\n    !timestamp || timestamp === \\\\\\\\\\\\\\\"0\\\\\\\\\\\\\\\" || timestamp === \\\\\\\\\\\\\\\"NaN\\\\\\\\\\\\\\\" ? null : timestamp;\\\\\\\\n  return new Date(parseFloat(stamp / 1000000)).toISOString().split(\\\\\\\\\\\\\\\"T\\\\\\\\\\\\\\\")[0];\\\\\\\\n}\\\\\\\\nconst [labels, setLabels] = useState([]);\\\\\\\\nconst [title, setTitle] = useState(null);\\\\\\\\nconst [description, setDescription] = useState(null);\\\\\\\\nconst [summary, setSummary] = useState(null);\\\\\\\\nconst [consent, setConsent] = useState({ coc: false });\\\\\\\\nconst [submissionDeadline, setSubmissionDeadline] = useState(null);\\\\\\\\nconst [allowDraft, setAllowDraft] = useState(true);\\\\\\\\nconst [loading, setLoading] = useState(true);\\\\\\\\nconst [disabledSubmitBtn, setDisabledSubmitBtn] = useState(false);\\\\\\\\nconst [isDraftBtnOpen, setDraftBtnOpen] = useState(false);\\\\\\\\nconst [showRfpViewModal, setShowRfpViewModal] = useState(false); // when user creates/edit a RFP and confirm the txn, this is true\\\\\\\\nconst [rfpId, setRfpId] = useState(null);\\\\\\\\nconst [rfpIdsArray, setRfpIdsArray] = useState(null);\\\\\\\\nconst [isTxnCreated, setCreateTxn] = useState(false);\\\\\\\\nconst [oldRfpData, setOldRfpData] = useState(null);\\\\\\\\nconst [timeline, setTimeline] = useState({\\\\\\\\n  status: RFP_TIMELINE_STATUS.ACCEPTING_SUBMISSIONS,\\\\\\\\n});\\\\\\\\nconst [isCancelModalOpen, setCancelModal] = useState(false);\\\\\\\\nif (allowDraft) {\\\\\\\\n  draftRfpData = Storage.privateGet(draftKey);\\\\\\\\n}\\\\\\\\nconst memoizedDraftData = useMemo(\\\\\\\\n  () => ({\\\\\\\\n    id: editRfpData.id ?? null,\\\\\\\\n    snapshot: {\\\\\\\\n      name: title,\\\\\\\\n      description: description,\\\\\\\\n      labels: labels,\\\\\\\\n      summary: summary,\\\\\\\\n      submission_deadline: getTimestamp(submissionDeadline),\\\\\\\\n    },\\\\\\\\n  }),\\\\\\\\n  [title, summary, description, submissionDeadline, labels]\\\\\\\\n);\\\\\\\\nuseEffect(() => {\\\\\\\\n  if (allowDraft) {\\\\\\\\n    let data = editRfpData || JSON.parse(draftRfpData);\\\\\\\\n    let snapshot = data.snapshot;\\\\\\\\n    if (data) {\\\\\\\\n      if (timestamp) {\\\\\\\\n        snapshot =\\\\\\\\n          data.snapshot_history.find((item) => item.timestamp === timestamp) ??\\\\\\\\n          data.snapshot;\\\\\\\\n      }\\\\\\\\n      if (\\\\\\\\n        draftRfpData &&\\\\\\\\n        editRfpData &&\\\\\\\\n        editRfpData.id === JSON.parse(draftRfpData).id\\\\\\\\n      ) {\\\\\\\\n        snapshot = {\\\\\\\\n          ...editRfpData.snapshot,\\\\\\\\n          ...JSON.parse(draftRfpData).snapshot,\\\\\\\\n        };\\\\\\\\n      }\\\\\\\\n      setRfpId(data.id);\\\\\\\\n      setLabels(snapshot.labels);\\\\\\\\n      setTitle(snapshot.name);\\\\\\\\n      setSummary(snapshot.summary);\\\\\\\\n      setDescription(snapshot.description);\\\\\\\\n      setSubmissionDeadline(getDate(snapshot.submission_deadline));\\\\\\\\n      setTimeline(parseJSON(snapshot.timeline));\\\\\\\\n      if (isEditPage) {\\\\\\\\n        setConsent({ coc: true });\\\\\\\\n      }\\\\\\\\n    }\\\\\\\\n  }\\\\\\\\n}, [editRfpData, draftRfpData, allowDraft]);\\\\\\\\n// show loader until LS data is set in state\\\\\\\\nuseEffect(() => {\\\\\\\\n  const handler = setTimeout(() => {\\\\\\\\n    setAllowDraft(false);\\\\\\\\n    setLoading(false);\\\\\\\\n  }, 200);\\\\\\\\n  return () => clearTimeout(handler);\\\\\\\\n}, []);\\\\\\\\nuseEffect(() => {\\\\\\\\n  if (showRfpViewModal) {\\\\\\\\n    return;\\\\\\\\n  }\\\\\\\\n  setDisabledSubmitBtn(\\\\\\\\n    !title ||\\\\\\\\n      !description ||\\\\\\\\n      !summary ||\\\\\\\\n      !(labels ?? []).length ||\\\\\\\\n      !submissionDeadline ||\\\\\\\\n      !consent.coc\\\\\\\\n  );\\\\\\\\n  const handler = setTimeout(() => {\\\\\\\\n    Storage.privateSet(draftKey, JSON.stringify(memoizedDraftData));\\\\\\\\n  }, 10000);\\\\\\\\n  return () => clearTimeout(handler);\\\\\\\\n}, [\\\\\\\\n  memoizedDraftData,\\\\\\\\n  draftKey,\\\\\\\\n  draftRfpData,\\\\\\\\n  consent,\\\\\\\\n  isTxnCreated,\\\\\\\\n  showRfpViewModal,\\\\\\\\n]);\\\\\\\\nconst InputContainer = ({ heading, description, children }) => {\\\\\\\\n  return (\\\\\\\\n    <div className=\\\\\\\\\\\\\\\"d-flex flex-column gap-1 gap-sm-2 w-100\\\\\\\\\\\\\\\">\\\\\\\\n      <b className=\\\\\\\\\\\\\\\"h6 mb-0\\\\\\\\\\\\\\\">{heading}</b>\\\\\\\\n      {description && (\\\\\\\\n        <div className=\\\\\\\\\\\\\\\"text-muted w-100 text-sm\\\\\\\\\\\\\\\">{description}</div>\\\\\\\\n      )}\\\\\\\\n      {children}\\\\\\\\n    </div>\\\\\\\\n  );\\\\\\\\n};\\\\\\\\nfunction cleanDraft() {\\\\\\\\n  Storage.privateSet(draftKey, null);\\\\\\\\n}\\\\\\\\n// show RFP created after txn approval for popup wallet\\\\\\\\nuseEffect(() => {\\\\\\\\n  if (isTxnCreated) {\\\\\\\\n    if (editRfpData) {\\\\\\\\n      setOldRfpData(editRfpData);\\\\\\\\n      if (\\\\\\\\n        editRfpData &&\\\\\\\\n        typeof editRfpData === \\\\\\\\\\\\\\\"object\\\\\\\\\\\\\\\" &&\\\\\\\\n        oldRfpData &&\\\\\\\\n        typeof oldRfpData === \\\\\\\\\\\\\\\"object\\\\\\\\\\\\\\\" &&\\\\\\\\n        JSON.stringify(editRfpData) !== JSON.stringify(oldRfpData)\\\\\\\\n      ) {\\\\\\\\n        cleanDraft();\\\\\\\\n        setCreateTxn(false);\\\\\\\\n        setRfpId(editRfpData.id);\\\\\\\\n        setShowRfpViewModal(true);\\\\\\\\n      }\\\\\\\\n    } else {\\\\\\\\n      const rfpIds = Near.view(\\\\\\\\n        \\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\n        \\\\\\\\\\\\\\\"get_all_rfp_ids\\\\\\\\\\\\\\\"\\\\\\\\n      );\\\\\\\\n      if (Array.isArray(rfpIds) && !rfpIdsArray) {\\\\\\\\n        setRfpIdsArray(rfpIds);\\\\\\\\n      }\\\\\\\\n      if (\\\\\\\\n        Array.isArray(rfpIds) &&\\\\\\\\n        Array.isArray(rfpIdsArray) &&\\\\\\\\n        rfpIds.length !== rfpIdsArray.length\\\\\\\\n      ) {\\\\\\\\n        cleanDraft();\\\\\\\\n        setCreateTxn(false);\\\\\\\\n        setRfpId(rfpIds[rfpIds.length - 1]);\\\\\\\\n        setShowRfpViewModal(true);\\\\\\\\n      }\\\\\\\\n    }\\\\\\\\n  }\\\\\\\\n});\\\\\\\\nuseEffect(() => {\\\\\\\\n  if (props.transactionHashes) {\\\\\\\\n    setLoading(true);\\\\\\\\n    useCache(\\\\\\\\n      () =>\\\\\\\\n        asyncFetch(\\\\\\\\\\\\\\\"https://rpc.mainnet.near.org\\\\\\\\\\\\\\\", {\\\\\\\\n          method: \\\\\\\\\\\\\\\"POST\\\\\\\\\\\\\\\",\\\\\\\\n          headers: {\\\\\\\\n            \\\\\\\\\\\\\\\"content-type\\\\\\\\\\\\\\\": \\\\\\\\\\\\\\\"application/json\\\\\\\\\\\\\\\",\\\\\\\\n          },\\\\\\\\n          body: JSON.stringify({\\\\\\\\n            jsonrpc: \\\\\\\\\\\\\\\"2.0\\\\\\\\\\\\\\\",\\\\\\\\n            id: \\\\\\\\\\\\\\\"dontcare\\\\\\\\\\\\\\\",\\\\\\\\n            method: \\\\\\\\\\\\\\\"tx\\\\\\\\\\\\\\\",\\\\\\\\n            params: [props.transactionHashes, context.accountId],\\\\\\\\n          }),\\\\\\\\n        }).then((transaction) => {\\\\\\\\n          const transaction_method_name =\\\\\\\\n            transaction?.body?.result?.transaction?.actions[0].FunctionCall\\\\\\\\n              .method_name;\\\\\\\\n          const is_edit_or_add_rfp_transaction =\\\\\\\\n            transaction_method_name == \\\\\\\\\\\\\\\"add_rfp\\\\\\\\\\\\\\\" ||\\\\\\\\n            transaction_method_name == \\\\\\\\\\\\\\\"edit_rfp\\\\\\\\\\\\\\\";\\\\\\\\n          if (is_edit_or_add_rfp_transaction) {\\\\\\\\n            cleanDraft();\\\\\\\\n            setShowRfpViewModal(true);\\\\\\\\n          }\\\\\\\\n          // show the latest created rfp to user\\\\\\\\n          if (transaction_method_name == \\\\\\\\\\\\\\\"add_rfp\\\\\\\\\\\\\\\") {\\\\\\\\n            useCache(\\\\\\\\n              () =>\\\\\\\\n                Near.asyncView(\\\\\\\\n                  \\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\n                  \\\\\\\\\\\\\\\"get_all_rfp_ids\\\\\\\\\\\\\\\"\\\\\\\\n                ).then((rfpIdsArray) => {\\\\\\\\n                  setRfpId(rfpIdsArray?.[rfpIdsArray?.length - 1]);\\\\\\\\n                }),\\\\\\\\n              props.transactionHashes + \\\\\\\\\\\\\\\"rfpIds\\\\\\\\\\\\\\\",\\\\\\\\n              { subscribe: false }\\\\\\\\n            );\\\\\\\\n          } else {\\\\\\\\n            setRfpId(id);\\\\\\\\n          }\\\\\\\\n          setLoading(false);\\\\\\\\n        }),\\\\\\\\n      props.transactionHashes + context.accountId,\\\\\\\\n      { subscribe: false }\\\\\\\\n    );\\\\\\\\n  } else {\\\\\\\\n    if (showRfpViewModal) {\\\\\\\\n      setShowRfpViewModal(false);\\\\\\\\n    }\\\\\\\\n  }\\\\\\\\n}, [props.transactionHashes]);\\\\\\\\nconst LoadingButtonSpinner = (\\\\\\\\n  <span\\\\\\\\n    className=\\\\\\\\\\\\\\\"submit-rfp-loading-indicator spinner-border spinner-border-sm\\\\\\\\\\\\\\\"\\\\\\\\n    role=\\\\\\\\\\\\\\\"status\\\\\\\\\\\\\\\"\\\\\\\\n    aria-hidden=\\\\\\\\\\\\\\\"true\\\\\\\\\\\\\\\"\\\\\\\\n  ></span>\\\\\\\\n);\\\\\\\\nconst onSubmit = () => {\\\\\\\\n  setCreateTxn(true);\\\\\\\\n  const body = {\\\\\\\\n    rfp_body_version: \\\\\\\\\\\\\\\"V0\\\\\\\\\\\\\\\",\\\\\\\\n    name: title,\\\\\\\\n    description: description,\\\\\\\\n    summary: summary,\\\\\\\\n    submission_deadline: getTimestamp(submissionDeadline),\\\\\\\\n    timeline:\\\\\\\\n      Object.keys(timeline || {}).length > 0\\\\\\\\n        ? timeline\\\\\\\\n        : { status: RFP_TIMELINE_STATUS.ACCEPTING_SUBMISSIONS },\\\\\\\\n  };\\\\\\\\n  const args = { labels: (labels ?? []).map((i) => i.value), body: body };\\\\\\\\n  if (isEditPage) {\\\\\\\\n    args[\\\\\\\\\\\\\\\"id\\\\\\\\\\\\\\\"] = editRfpData.id;\\\\\\\\n  }\\\\\\\\n  Near.call([\\\\\\\\n    {\\\\\\\\n      contractName: \\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\n      methodName: isEditPage ? \\\\\\\\\\\\\\\"edit_rfp\\\\\\\\\\\\\\\" : \\\\\\\\\\\\\\\"add_rfp\\\\\\\\\\\\\\\",\\\\\\\\n      args: args,\\\\\\\\n      gas: 270000000000000,\\\\\\\\n    },\\\\\\\\n  ]);\\\\\\\\n};\\\\\\\\nif (loading) {\\\\\\\\n  return (\\\\\\\\n    <div\\\\\\\\n      style={{ height: \\\\\\\\\\\\\\\"50vh\\\\\\\\\\\\\\\" }}\\\\\\\\n      className=\\\\\\\\\\\\\\\"d-flex justify-content-center align-items-center w-100\\\\\\\\\\\\\\\"\\\\\\\\n    >\\\\\\\\n      <Widget src={`devhub.near/widget/devhub.components.molecule.Spinner`} />\\\\\\\\n    </div>\\\\\\\\n  );\\\\\\\\n}\\\\\\\\nconst [collapseState, setCollapseState] = useState({});\\\\\\\\nconst CollapsibleContainer = ({ title, children, noPaddingTop }) => {\\\\\\\\n  return (\\\\\\\\n    <div\\\\\\\\n      className={\\\\\\\\n        \\\\\\\\\\\\\\\"border-bottom py-4 \\\\\\\\\\\\\\\" +\\\\\\\\n        (noPaddingTop && \\\\\\\\\\\\\\\"pt-0 \\\\\\\\\\\\\\\") +\\\\\\\\n        (collapseState[title] && \\\\\\\\\\\\\\\" pb-0\\\\\\\\\\\\\\\")\\\\\\\\n      }\\\\\\\\n    >\\\\\\\\n      <div className={\\\\\\\\\\\\\\\"d-flex justify-content-between \\\\\\\\\\\\\\\"}>\\\\\\\\n        <div className=\\\\\\\\\\\\\\\"h5 text-muted mb-2 mb-sm-3\\\\\\\\\\\\\\\">{title}</div>\\\\\\\\n        <div\\\\\\\\n          className=\\\\\\\\\\\\\\\"d-flex d-sm-none cursor-pointer\\\\\\\\\\\\\\\"\\\\\\\\n          onClick={() =>\\\\\\\\n            setCollapseState((prevState) => ({\\\\\\\\n              ...prevState,\\\\\\\\n              [title]: !prevState[title],\\\\\\\\n            }))\\\\\\\\n          }\\\\\\\\n        >\\\\\\\\n          {!collapseState[title] ? (\\\\\\\\n            <i className=\\\\\\\\\\\\\\\"bi bi-chevron-up h4\\\\\\\\\\\\\\\"></i>\\\\\\\\n          ) : (\\\\\\\\n            <i className=\\\\\\\\\\\\\\\"bi bi-chevron-down h4\\\\\\\\\\\\\\\"></i>\\\\\\\\n          )}\\\\\\\\n        </div>\\\\\\\\n      </div>\\\\\\\\n      <div className={!collapseState[title] ? \\\\\\\\\\\\\\\"\\\\\\\\\\\\\\\" : \\\\\\\\\\\\\\\"d-none\\\\\\\\\\\\\\\"}>{children}</div>\\\\\\\\n    </div>\\\\\\\\n  );\\\\\\\\n};\\\\\\\\nconst CategoryDropdown = useMemo(() => {\\\\\\\\n  return (\\\\\\\\n    <Widget\\\\\\\\n      src={`infrastructure-committee.near/widget/components.molecule.MultiSelectCategoryDropdown`}\\\\\\\\n      props={{\\\\\\\\n        selected: labels,\\\\\\\\n        onChange: (v) => setLabels(v),\\\\\\\\n        disabled: false,\\\\\\\\n        availableOptions: rfpLabelOptions,\\\\\\\\n      }}\\\\\\\\n    />\\\\\\\\n  );\\\\\\\\n}, [draftRfpData]);\\\\\\\\nconst TitleComponent = useMemo(() => {\\\\\\\\n  return (\\\\\\\\n    <Widget\\\\\\\\n      src={`devhub.near/widget/devhub.components.molecule.Input`}\\\\\\\\n      props={{\\\\\\\\n        className: \\\\\\\\\\\\\\\"flex-grow-1\\\\\\\\\\\\\\\",\\\\\\\\n        value: title,\\\\\\\\n        onBlur: (e) => {\\\\\\\\n          setTitle(e.target.value);\\\\\\\\n        },\\\\\\\\n        skipPaddingGap: true,\\\\\\\\n        inputProps: {\\\\\\\\n          max: 80,\\\\\\\\n        },\\\\\\\\n      }}\\\\\\\\n    />\\\\\\\\n  );\\\\\\\\n}, [draftRfpData]);\\\\\\\\nconst SummaryComponent = useMemo(() => {\\\\\\\\n  return (\\\\\\\\n    <Widget\\\\\\\\n      src={`devhub.near/widget/devhub.components.molecule.Input`}\\\\\\\\n      props={{\\\\\\\\n        className: \\\\\\\\\\\\\\\"flex-grow-1\\\\\\\\\\\\\\\",\\\\\\\\n        value: summary,\\\\\\\\n        multiline: true,\\\\\\\\n        onBlur: (e) => {\\\\\\\\n          setSummary(e.target.value);\\\\\\\\n        },\\\\\\\\n        skipPaddingGap: true,\\\\\\\\n        inputProps: {\\\\\\\\n          max: 500,\\\\\\\\n        },\\\\\\\\n      }}\\\\\\\\n    />\\\\\\\\n  );\\\\\\\\n}, [draftRfpData]);\\\\\\\\nconst DescriptionComponent = useMemo(() => {\\\\\\\\n  return (\\\\\\\\n    <Widget\\\\\\\\n      src={`infrastructure-committee.near/widget/components.molecule.Compose`}\\\\\\\\n      props={{\\\\\\\\n        data: description,\\\\\\\\n        onChange: setDescription,\\\\\\\\n        autocompleteEnabled: true,\\\\\\\\n        autoFocus: false,\\\\\\\\n      }}\\\\\\\\n    />\\\\\\\\n  );\\\\\\\\n}, [draftRfpData]);\\\\\\\\nconst ConsentComponent = useMemo(() => {\\\\\\\\n  return (\\\\\\\\n    <div className=\\\\\\\\\\\\\\\"d-flex flex-column gap-2\\\\\\\\\\\\\\\">\\\\\\\\n      <Widget\\\\\\\\n        src={`devhub.near/widget/devhub.components.molecule.Checkbox`}\\\\\\\\n        props={{\\\\\\\\n          value: \\\\\\\\\\\\\\\"coc\\\\\\\\\\\\\\\",\\\\\\\\n          label: (\\\\\\\\n            <>\\\\\\\\n              I\\\\\\\\u{2019}ve read{\\\\\\\\\\\\\\\" \\\\\\\\\\\\\\\"}\\\\\\\\n              <a\\\\\\\\n                href={CoCDocs}\\\\\\\\n                className=\\\\\\\\\\\\\\\"text-decoration-underline\\\\\\\\\\\\\\\"\\\\\\\\n                target=\\\\\\\\\\\\\\\"_blank\\\\\\\\\\\\\\\"\\\\\\\\n                rel=\\\\\\\\\\\\\\\"noopener noreferrer\\\\\\\\\\\\\\\"\\\\\\\\n              >\\\\\\\\n                Code of Conduct\\\\\\\\n              </a>\\\\\\\\n              and commit to honoring it\\\\\\\\n            </>\\\\\\\\n          ),\\\\\\\\n          isChecked: consent.coc,\\\\\\\\n          onClick: (value) =>\\\\\\\\n            setConsent((prevConsent) => ({\\\\\\\\n              ...prevConsent,\\\\\\\\n              coc: value,\\\\\\\\n            })),\\\\\\\\n        }}\\\\\\\\n      />\\\\\\\\n    </div>\\\\\\\\n  );\\\\\\\\n}, [draftRfpData]);\\\\\\\\nconst SubmissionDeadline = useMemo(() => {\\\\\\\\n  return (\\\\\\\\n    <Widget\\\\\\\\n      src={`devhub.near/widget/devhub.components.molecule.Input`}\\\\\\\\n      props={{\\\\\\\\n        className: \\\\\\\\\\\\\\\"flex-grow-1\\\\\\\\\\\\\\\",\\\\\\\\n        value: submissionDeadline,\\\\\\\\n        onBlur: (e) => {\\\\\\\\n          setSubmissionDeadline(e.target.value);\\\\\\\\n        },\\\\\\\\n        skipPaddingGap: true,\\\\\\\\n        type: \\\\\\\\\\\\\\\"date\\\\\\\\\\\\\\\",\\\\\\\\n        inputProps: {\\\\\\\\n          required: true,\\\\\\\\n        },\\\\\\\\n      }}\\\\\\\\n    />\\\\\\\\n  );\\\\\\\\n}, [draftRfpData]);\\\\\\\\nreturn (\\\\\\\\n  <Container className=\\\\\\\\\\\\\\\"w-100 py-2 px-0 px-sm-2 d-flex flex-column gap-3\\\\\\\\\\\\\\\">\\\\\\\\n    <Widget\\\\\\\\n      src={`infrastructure-committee.near/widget/components.rfps.ViewRfpModal`}\\\\\\\\n      props={{\\\\\\\\n        isOpen: showRfpViewModal,\\\\\\\\n        isEdit: isEditPage,\\\\\\\\n        rfpId: rfpId,\\\\\\\\n      }}\\\\\\\\n    />\\\\\\\\n    <Widget\\\\\\\\n      src={`infrastructure-committee.near/widget/components.rfps.ConfirmCancelModal`}\\\\\\\\n      props={{\\\\\\\\n        isOpen: isCancelModalOpen,\\\\\\\\n        onCancelClick: () => {\\\\\\\\n          setCancelModal(false);\\\\\\\\n          setTimeline({ status: RFP_TIMELINE_STATUS.EVALUATION });\\\\\\\\n        },\\\\\\\\n        onConfirmClick: (value) => {\\\\\\\\n          setCancelModal(false);\\\\\\\\n          onCancelRFP(value);\\\\\\\\n        },\\\\\\\\n        linkedProposalIds: editRfpData.snapshot.linked_proposals,\\\\\\\\n      }}\\\\\\\\n    />\\\\\\\\n    <Widget\\\\\\\\n      src={`infrastructure-committee.near/widget/components.rfps.WarningModal`}\\\\\\\\n      props={{\\\\\\\\n        isOpen: isWarningModalOpen,\\\\\\\\n        onConfirmClick: () => {\\\\\\\\n          setWarningModal(false);\\\\\\\\n          setTimeline({ status: RFP_TIMELINE_STATUS.EVALUATION });\\\\\\\\n        },\\\\\\\\n      }}\\\\\\\\n    />\\\\\\\\n    <Heading className=\\\\\\\\\\\\\\\"px-2 px-sm-0\\\\\\\\\\\\\\\">\\\\\\\\n      {isEditPage ? \\\\\\\\\\\\\\\"Edit\\\\\\\\\\\\\\\" : \\\\\\\\\\\\\\\"Create\\\\\\\\\\\\\\\"} RFP\\\\\\\\n    </Heading>\\\\\\\\n    <div className=\\\\\\\\\\\\\\\"card no-border rounded-0 px-2 p-lg-0 full-width-div\\\\\\\\\\\\\\\">\\\\\\\\n      <div className=\\\\\\\\\\\\\\\"container-xl py-4 d-flex flex-wrap gap-6 w-100\\\\\\\\\\\\\\\">\\\\\\\\n        <div\\\\\\\\n          style={{ minWidth: \\\\\\\\\\\\\\\"350px\\\\\\\\\\\\\\\" }}\\\\\\\\n          className=\\\\\\\\\\\\\\\"flex-2 w-100 order-2 order-md-1\\\\\\\\\\\\\\\"\\\\\\\\n        >\\\\\\\\n          <div className=\\\\\\\\\\\\\\\"d-flex gap-3 w-100\\\\\\\\\\\\\\\">\\\\\\\\n            <div className=\\\\\\\\\\\\\\\"d-none d-sm-flex\\\\\\\\\\\\\\\">\\\\\\\\n              <img\\\\\\\\n                src={\\\\\\\\n                  \\\\\\\\\\\\\\\"https://ipfs.near.social/ipfs/bafkreicbygt4kajytlxij24jj6tkg2ppc2dw3dlqhkermkjjfgdfnlizzy\\\\\\\\\\\\\\\"\\\\\\\\n                }\\\\\\\\n                height={35}\\\\\\\\n                width={35}\\\\\\\\n              />\\\\\\\\n            </div>\\\\\\\\n            <div className=\\\\\\\\\\\\\\\"d-flex flex-column gap-4 w-100\\\\\\\\\\\\\\\">\\\\\\\\n              <InputContainer\\\\\\\\n                heading=\\\\\\\\\\\\\\\"Category\\\\\\\\\\\\\\\"\\\\\\\\n                description={\\\\\\\\n                  <>\\\\\\\\n                    Select the relevant categories to help users quickly\\\\\\\\n                    understand the nature of the need. Need guidance? See{\\\\\\\\\\\\\\\" \\\\\\\\\\\\\\\"}\\\\\\\\n                    <a\\\\\\\\n                      href={FundingDocs}\\\\\\\\n                      className=\\\\\\\\\\\\\\\"text-decoration-underline no-space\\\\\\\\\\\\\\\"\\\\\\\\n                      target=\\\\\\\\\\\\\\\"_blank\\\\\\\\\\\\\\\"\\\\\\\\n                      rel=\\\\\\\\\\\\\\\"noopener noreferrer\\\\\\\\\\\\\\\"\\\\\\\\n                    >\\\\\\\\n                      Funding Docs\\\\\\\\n                    </a>\\\\\\\\n                    .\\\\\\\\n                  </>\\\\\\\\n                }\\\\\\\\n              >\\\\\\\\n                {CategoryDropdown}\\\\\\\\n              </InputContainer>\\\\\\\\n              <InputContainer\\\\\\\\n                heading=\\\\\\\\\\\\\\\"Title\\\\\\\\\\\\\\\"\\\\\\\\n                description=\\\\\\\\\\\\\\\"Highlight the essence of your RFP in a few words. This will appear on your RFP\\\\\\\\u{2019}s detail page and the main RFP feed. Keep it short, please :)\\\\\\\\\\\\\\\"\\\\\\\\n              >\\\\\\\\n                {TitleComponent}\\\\\\\\n              </InputContainer>\\\\\\\\n              <InputContainer\\\\\\\\n                heading=\\\\\\\\\\\\\\\"Summary\\\\\\\\\\\\\\\"\\\\\\\\n                description=\\\\\\\\\\\\\\\"Explain your RFP briefly. What is the problem or need, desired outcome, and benefit to the NEAR developer community.\\\\\\\\\\\\\\\"\\\\\\\\n              >\\\\\\\\n                {SummaryComponent}\\\\\\\\n              </InputContainer>\\\\\\\\n              <InputContainer\\\\\\\\n                heading=\\\\\\\\\\\\\\\"Description\\\\\\\\\\\\\\\"\\\\\\\\n                description={\\\\\\\\n                  \\\\\\\\\\\\\\\"Expand on your summary with any relevant details like a detailed explanation of the problem and the expected solution, scope, and deliverables. Also include an estimate range for the project if you have a specific budget. And the selection criteria.\\\\\\\\\\\\\\\"\\\\\\\\n                }\\\\\\\\n              >\\\\\\\\n                {DescriptionComponent}\\\\\\\\n              </InputContainer>\\\\\\\\n              <InputContainer heading=\\\\\\\\\\\\\\\"Final Consent\\\\\\\\\\\\\\\">\\\\\\\\n                {ConsentComponent}\\\\\\\\n              </InputContainer>\\\\\\\\n              <div className=\\\\\\\\\\\\\\\"d-flex justify-content-end gap-2 align-items-center\\\\\\\\\\\\\\\">\\\\\\\\n                <Link\\\\\\\\n                  to={\\\\\\\\n                    isEditPage\\\\\\\\n                      ? href({\\\\\\\\n                          widgetSrc: `infrastructure-committee.near/widget/app`,\\\\\\\\n                          params: {\\\\\\\\n                            page: \\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\",\\\\\\\\n                            id: parseInt(id),\\\\\\\\n                          },\\\\\\\\n                        })\\\\\\\\n                      : href({\\\\\\\\n                          widgetSrc: `infrastructure-committee.near/widget/app`,\\\\\\\\n                          params: {\\\\\\\\n                            page: \\\\\\\\\\\\\\\"rfps\\\\\\\\\\\\\\\",\\\\\\\\n                          },\\\\\\\\n                        })\\\\\\\\n                  }\\\\\\\\n                >\\\\\\\\n                  <Widget\\\\\\\\n                    src={`devhub.near/widget/devhub.components.molecule.Button`}\\\\\\\\n                    props={{\\\\\\\\n                      classNames: {\\\\\\\\n                        root: \\\\\\\\\\\\\\\"d-flex h-100 text-muted fw-bold btn-outline shadow-none border-0 btn-sm\\\\\\\\\\\\\\\",\\\\\\\\n                      },\\\\\\\\n                      label: \\\\\\\\\\\\\\\"Discard Changes\\\\\\\\\\\\\\\",\\\\\\\\n                      onClick: cleanDraft,\\\\\\\\n                    }}\\\\\\\\n                  />\\\\\\\\n                </Link>\\\\\\\\n                <Widget\\\\\\\\n                  src={`devhub.near/widget/devhub.components.molecule.Button`}\\\\\\\\n                  props={{\\\\\\\\n                    classNames: {\\\\\\\\n                      root: \\\\\\\\\\\\\\\"d-flex h-100 fw-light-bold btn-outline shadow-none border-1\\\\\\\\\\\\\\\",\\\\\\\\n                    },\\\\\\\\n                    label: (\\\\\\\\n                      <div className=\\\\\\\\\\\\\\\"d-flex align-items-center gap-2\\\\\\\\\\\\\\\">\\\\\\\\n                        <div className=\\\\\\\\\\\\\\\"circle grey\\\\\\\\\\\\\\\"></div> <div>Submit</div>\\\\\\\\n                      </div>\\\\\\\\n                    ),\\\\\\\\n                    onClick: onSubmit,\\\\\\\\n                    disabled: disabledSubmitBtn,\\\\\\\\n                  }}\\\\\\\\n                />\\\\\\\\n              </div>\\\\\\\\n            </div>\\\\\\\\n          </div>\\\\\\\\n        </div>\\\\\\\\n        <div\\\\\\\\n          style={{ minWidth: \\\\\\\\\\\\\\\"350px\\\\\\\\\\\\\\\" }}\\\\\\\\n          className=\\\\\\\\\\\\\\\"flex-1 w-100 order-1 order-md-2\\\\\\\\\\\\\\\"\\\\\\\\n        >\\\\\\\\n          <CollapsibleContainer noPaddingTop={true}>\\\\\\\\n            <div className=\\\\\\\\\\\\\\\"d-flex flex-column gap-3 gap-sm-4\\\\\\\\\\\\\\\">\\\\\\\\n              <InputContainer\\\\\\\\n                heading=\\\\\\\\\\\\\\\"Submission Deadline\\\\\\\\\\\\\\\"\\\\\\\\n                description=\\\\\\\\\\\\\\\"Enter the deadline for submitting proposals.\\\\\\\\\\\\\\\"\\\\\\\\n              >\\\\\\\\n                {SubmissionDeadline}\\\\\\\\n              </InputContainer>\\\\\\\\n            </div>\\\\\\\\n          </CollapsibleContainer>\\\\\\\\n          <div className=\\\\\\\\\\\\\\\"my-2\\\\\\\\\\\\\\\">\\\\\\\\n            <CollapsibleContainer title=\\\\\\\\\\\\\\\"Timeline\\\\\\\\\\\\\\\">\\\\\\\\n              <Widget\\\\\\\\n                src={`infrastructure-committee.near/widget/components.rfps.TimelineConfigurator`}\\\\\\\\n                props={{\\\\\\\\n                  timeline: timeline,\\\\\\\\n                  setTimeline: (v) => {\\\\\\\\n                    if (editRfpData.snapshot.timeline.status === v.status) {\\\\\\\\n                      return;\\\\\\\\n                    }\\\\\\\\n                    // if proposal selected timeline is selected and no approved proposals exist, show warning\\\\\\\\n                    if (\\\\\\\\n                      v.status === RFP_TIMELINE_STATUS.PROPOSAL_SELECTED &&\\\\\\\\n                      Array.isArray(approvedProposals) &&\\\\\\\\n                      !approvedProposals.length\\\\\\\\n                    ) {\\\\\\\\n                      setWarningModal(true);\\\\\\\\n                    }\\\\\\\\n                    if (v.status === RFP_TIMELINE_STATUS.CANCELLED) {\\\\\\\\n                      setCancelModal(true);\\\\\\\\n                    }\\\\\\\\n                    setTimeline(v);\\\\\\\\n                  },\\\\\\\\n                  disabled: isEditPage ? false : true,\\\\\\\\n                }}\\\\\\\\n              />\\\\\\\\n            </CollapsibleContainer>\\\\\\\\n          </div>\\\\\\\\n        </div>\\\\\\\\n      </div>\\\\\\\\n    </div>\\\\\\\\n  </Container>\\\\\\\\n);\\\\\\\\n\"}}}}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 945721507714500000000
    }
  },
  {
    "id": "8620599370",
    "receipt_id": "GoG5czryqpvrEQGWKo8t847PZTq8FxHmQh9G1D8bygfy",
    "predecessor_account_id": "system",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "7r4TsMSBmKFfyWxegBcwddLbe1cPx17yEfMdE4CsMQaj",
      "block_height": 128787550,
      "block_timestamp": 1727177423761924000
    },
    "receipt_outcome": {
      "gas_burnt": 223182562500,
      "tokens_burnt": 0,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "5gXTZGHjmPWAF1KwtFdfFzqGpQU4rgAdSD2R5Qc9Ue89",
    "included_in_block_hash": "HcqkCSQGDdsEQcAg3iYprZU5ek9hWbE7oLF8LadrMfkH",
    "block_timestamp": "1727177421156188726",
    "block": {
      "block_height": 128787548
    },
    "receipt_conversion_tokens_burnt": "147592904778000000000",
    "actions": [
      {
        "action": "TRANSFER",
        "method": null,
        "deposit": 1.8730322522119936e+23,
        "fee": 0,
        "args": null
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 945721507714500000000
    }
  },
  {
    "id": "8623768184",
    "receipt_id": "3ikKMS8coTZRSbctYpUmPyuEdDucSQjVXUrj8qzvK3GT",
    "predecessor_account_id": "trechriron71.near",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "EA3xDgP9MMmvZpBGrrekyt1VUsaknTDq4owg3tZbLott",
      "block_height": 128795057,
      "block_timestamp": 1727186784806478600
    },
    "receipt_outcome": {
      "gas_burnt": 8498190200767,
      "tokens_burnt": 849819020076700000000,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "G9WkXeqzEDbFZvQn5XkVtwxM8Xpqmy4aUJFeycKLAckC",
    "included_in_block_hash": "GupJc8B3p4oy9iUbC8t2zGrfqNBBZf9G8t7WGqamvdHM",
    "block_timestamp": "1727186783474290917",
    "block": {
      "block_height": 128795056
    },
    "receipt_conversion_tokens_burnt": "121223810383000000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "add_rfp",
        "deposit": 0,
        "fee": 849819020076700000000,
        "args": "{\"body\": {\"name\": \"New Operator for near.org RPC Service\", \"summary\": \"As [Pagoda winds down its services](https://docs.near.org/blog/2024-08-13-pagoda-services) and critical infrastructure, there is a need to transition the management and development of the near.org RPC service, which is being used as a public good in the ecosystem, with a clear service level agreement for the chosen vendor.\", \"timeline\": {\"status\": \"ACCEPTING_SUBMISSIONS\"}, \"description\": \"## Overview\\\\\\\\n\\\\\\\\nAs [Pagoda winds down its services](https://docs.near.org/blog/2024-08-13-pagoda-services) and critical infrastructure, there is a need to transition the management and development of the near.org RPC service, which is being used as a public good in the ecosystem, with a clear service level agreement for the chosen vendor.\\\\\\\\n\\\\\\\\nnear.org RPC currently operates as a high-capacity NEAR RPC service, entirely subsidized by the NEAR Foundation. It is used by countless applications and wallets, including some of the most popular NEAR applications. However, we recognize that, by being hosted on near.org and offered at no cost to developers, the service contributes to unwanted centralization of the NEAR ecosystem.  \\\\\\\\n\\\\\\\\nNear.org RPC will become a heavily rate-limited \\\\\\\\u{201c}free tier\\\\\\\\u{201d} or demo-only service, maintaining backward compatibility with existing dev tooling and low-traffic applications.  High-traffic applications will be responsible for migrating their RPC usage to an alternative provider.  As part of this RFP, the new operator for this rate-limited near.org RPC service will be allowed to advertise their related commercial offering to these users, with the limits described below.\\\\\\\\n\\\\\\\\n## Technical Overview\\\\\\\\n\\\\\\\\nThe Infrastructure Committee (IC) seeks a new operator for these four URLs during or after the transformation into a free-tier-only service:\\\\\\\\n\\\\\\\\n* [https://rpc.mainnet.near.org](https://rpc.mainnet.near.org)\\\\\\\\n* [https://rpc.testnet.near.org](https://rpc.testnet.near.org)\\\\\\\\n* [https://archival-rpc.mainnet.near.org](https://archival-rpc.mainnet.near.org)\\\\\\\\n* [https://archival-rpc.testnet.near.org](https://archival-rpc.testnet.near.org)\\\\\\\\n\\\\\\\\nThe current implementation of near.org RPC relies primarily on [Read-RPC](https://github.com/near/read-rpc/), a specially optimized backend server, and a ScyllaDB database built to handle NEAR RPC queries at scale. Some requests are routed to a scaled fleet of standard or archival [NEAR RPC nodes](https://near-nodes.io/rpc) running on Google Cloud. All underlying systems conform to the [NEAR RPC API regardless of where a request is routed](https://docs.near.org/api/rpc/introduction).\\\\\\\\n\\\\\\\\nThe new operator is welcome to use any or all of the current setups or their own. However, they must establish new relationships with the necessary cloud service providers.\\\\\\\\n\\\\\\\\n### Current Rate Limits\\\\\\\\n\\\\\\\\nThese are the existing rate limits applied by Pagoda (current maintainers).\\\\\\\\n\\\\\\\\n* RPC\\\\\\\\n  * 9000 requests/10s (27000 requests/30s) per IP (mainnet)\\\\\\\\n  * 2000 requests/30s per IP (testnet)\\\\\\\\n* Archival-RPC\\\\\\\\n  * 1000 requests/30s per IP (mainnet)\\\\\\\\n  * 2000 requests/30s per IP (testnet)\\\\\\\\n\\\\\\\\nNote: There is no authentication on these RPC endpoints.\\\\\\\\n\\\\\\\\nA few NEAR Foundation partners (dApps) are exempt from the rate limits above, consume a high load of RPC services, and receive white glove service provided by the Pagoda SRE team. They\\\\\\\\u{2019}re identified by using special Referrer headers in their requests. These partners have been notified that this level of service will be ending, and they have been encouraged to move out to alternative RPC providers that meet their production demands. After 01-Feb-2025, if they choose to remain on near.org RPC, they will be subject to the same rate limits as everyone else.\\\\\\\\n\\\\\\\\n### Transformation into Demo Environment\\\\\\\\n\\\\\\\\nAs mentioned above, we seek to turn near.org RPC into a free-tier / demo environment only by gradually lowering rate limits until the beginning of February.\\\\\\\\n\\\\\\\\nPagoda will execute this transformation according to the schedule below until the new operator takes over; at this point, they will be expected to continue that transformation. The Infrastructure Committee will prioritize proposals for an earlier transition to the new operator instead of waiting for the Pagoda team to finish lowering the rate limits.\\\\\\\\n\\\\\\\\nThis RFP aims to ensure that the special partners using near.org RPC for high-traffic loads are not adversely affected during and after this transition period. Near Foundation will work with the Pagoda SRE team and the new operator to ensure that their workload seamlessly migrates to the new RPC provider of their choice.\\\\\\\\n\\\\\\\\nOctober 15th:\\\\\\\\n\\\\\\\\n* **RPC Mainnet:** 15000 requests/30s per IP\\\\\\\\n* **RPC Testnet:** 1500 requests/30s per IP\\\\\\\\n* **Archival-RPC Mainnet:** 800 requests/30s per IP\\\\\\\\n* **Archival-RPC Testnet:** 1500 requests/30s per IP\\\\\\\\n\\\\\\\\nNovember 1st\\\\\\\\n\\\\\\\\n* **RPC Mainnet**: 5000 requests/30s per IP **or referrer**\\\\\\\\n* **RPC Testnet**: 1200 requests/30s per IP **or referrer**\\\\\\\\n* **Archival-RPC Mainnet**: 400 requests/30s per IP **or referrer**\\\\\\\\n* **Archival-RPC Testnet**: 800 requests/30s per IP **or referrer**\\\\\\\\n\\\\\\\\nDecember 1st\\\\\\\\n\\\\\\\\n* **RPC Mainnet**: 2000 requests/30s per IP or referrer\\\\\\\\n* **RPC Testnet**: 900 requests/30s per IP or referrer\\\\\\\\n* **Archival-RPC Mainnet**: 200 requests/30s IP or referrer\\\\\\\\n* **Archival-RPC Testnet**: 400 requests/30s per IP or referrer\\\\\\\\n\\\\\\\\nJanuary 1:\\\\\\\\n\\\\\\\\n* **RPC Mainnet**: 500 requests/30s per IP or referrer\\\\\\\\n* **RPC Testnet**: 600 requests/30s per IP or referrer\\\\\\\\n* **Archival-RPC Mainnet**: 100 requests/30s per IP or referrer\\\\\\\\n* **Archival-RPC Testnet**: 200 requests/30s per IP or referrer\\\\\\\\n\\\\\\\\nFebruary 1st\\\\\\\\n\\\\\\\\n* **RPC Mainnet**: 150 req/30s per IP or referrer\\\\\\\\n* **RPC Testnet**: 300 requests/30s per IP or referrer\\\\\\\\n* **Archival-RPC Mainnet**: 20 requests/30s per IP or referrer\\\\\\\\n* **Archival-RPC Testnet**: 100 requests/30s per IP or referrer\\\\\\\\n\\\\\\\\nNote: Rate limits will be applied by IP or by the HTTP \\\\\\\\u{201c}Referer\\\\\\\\u{201d} header, whichever hits first. Frontend applications will likely be rate-limited by the referrer, while backend applications will likely be rate-limited by the IP address.\\\\\\\\n\\\\\\\\n## Requirements\\\\\\\\n\\\\\\\\nThe maintenance requirements of this RPC service are listed below:\\\\\\\\n\\\\\\\\n* Collaborate with Pagoda SRE for any knowledge transfer and handover of the current endpoints\\\\\\\\n  * The current load balancer maintained by the Pagoda SRE team allows for a gradual transition. This will help ensure a smoother transition and better downtime management during the transition phase.\\\\\\\\n  * 100% target date before 01-Feb-2025, but we encourage an earlier transition during the rate limit decrease (as mentioned above), especially for overflow business\\\\\\\\n* Timely nearcore upgrades. There is a five-day time frame for deploying the latest [nearcore releases](https://github.com/near/nearcore/releases).\\\\\\\\n* Maintain monitoring and alerting system, showing the health of RPC systems\\\\\\\\n* Maintain external-facing status page (for example, [Helius Network](https://helius.statuspage.io/)) showing incidents and uptimes, and communicate across company social platforms and relevant partners.\\\\\\\\n\\\\\\\\n### Security\\\\\\\\n\\\\\\\\n* Proposals must include a comprehensive security plan, including DDoS protection measures, IP whitelisting capabilities, and detailed logging and monitoring strategies.\\\\\\\\n* Vendors must provide a detailed disaster recovery and business continuity plan, including regular backup procedures and a strategy for quick service restoration in case of major outages.\\\\\\\\n\\\\\\\\n### Service Level Agreement\\\\\\\\n\\\\\\\\n1. **Availability**\\\\\\\\n    * **Uptime Guarantee**: 99.9% monthly uptime\\\\\\\\n    * **Downtime Allowance**: Up to 44 minutes of downtime per month\\\\\\\\n\\\\\\\\n2. **Performance**\\\\\\\\n    * These are tracked internally and shared with the Infrastructure Committee (IC)**\\\\\\\\n    * **Response Time**:\\\\\\\\n    * **Mainnet RPC**: Average response time of \\\\\\\\u{2264} 1 second\\\\\\\\n    * **Testnet RPC**: Average response time of \\\\\\\\u{2264} 1.5 seconds\\\\\\\\n    * **Archival-RPC**: Average response time of \\\\\\\\u{2264} 2 seconds\\\\\\\\n    * **Rate Limiting**:\\\\\\\\n    * 150 req/30s\\\\\\\\n    * **Rate Limit Enforcement**: Strict enforcement with immediate rate limit application once thresholds are reached\\\\\\\\n    * Note: It would be good to have an external dashboard with these stats and historical data for the last 30 days.\\\\\\\\n\\\\\\\\n3. **Pricing**\\\\\\\\n    * The new RPC service provider must not accept payments for RPC services on near.org. However, it can advertise its service as a separate paid RPC with higher rate limits, as described below.\\\\\\\\n\\\\\\\\n4. **Advertising**\\\\\\\\n    * If you serve GET requests or a homepage at any of the RPC URLs above, that page can advertise your associated services, but it must:\\\\\\\\n    * Make it clear in postings or advertisements that your services are not directly affiliated with or operated by NEAR or the NEAR Foundation.\\\\\\\\n    * Include a prominent link to [https://docs.near.org/api/rpc/providers](https://docs.near.org/api/rpc/providers).  \\\\\\\\n\\\\\\\\n5. When a user is rate-limited, you must return an HTTP 429 response.\\\\\\\\n    * The response body is up to you and can also be used to advertise your associated services.  But if you do so, that response body must also contain the URL [https://docs.near.org/api/rpc/providers](https://docs.near.org/api/rpc/providers).\\\\\\\\n        * For instance, an acceptable response body is `{\\\\\\\\\\\\\\\"jsonrpc\\\\\\\\\\\\\\\": \\\\\\\\\\\\\\\"2.0\\\\\\\\\\\\\\\", \\\\\\\\\\\\\\\"error\\\\\\\\\\\\\\\": {\\\\\\\\\\\\\\\"code\\\\\\\\\\\\\\\": -429, \\\\\\\\\\\\\\\"message\\\\\\\\\\\\\\\": \\\\\\\\\\\\\\\"Rate limits exceeded. For higher rate limits, try [http://myrpcprovider.example](http://myrpcprovider.example) or other RPC providers at [https://docs.near.org/api/rpc/providers](https://docs.near.org/api/rpc/providers).\\\\\\\\\\\\\\\"}, \\\\\\\\\\\\\\\"id\\\\\\\\\\\\\\\": \\\\\\\\\\\\\\\"1\\\\\\\\\\\\\\\"}`.\\\\\\\\n\\\\\\\\n6. The Infrastructure Committee may from time to time evaluate any advertising on the near.org RPC service and demand changes within reason to conform to the guidelines above.\\\\\\\\n\\\\\\\\n7. **Support**\\\\\\\\n    * **Support Availability**: Community-based support only (e.g., through online help desk, forums, GitHub issues, or a developer community Slack/Telegram/Discord channel)\\\\\\\\n    * **Response Time**: No guaranteed response time, but best-effort responses within 24-48 hours for generic services.\\\\\\\\n\\\\\\\\n8. **Data Integrity**\\\\\\\\n    * **Data Consistency**: Standard (non-archival) RPC nodes must always serve five-time epochs. Both RPC and Archival nodes track all NEAR shards.\\\\\\\\n\\\\\\\\n9. **Updates and Changes**\\\\\\\\n    * **Notice for Breaking Changes**: At least seven days\\\\\\\\\\\\' notice for any breaking changes in the API or infrastructure\\\\\\\\n\\\\\\\\n10. **Limitations**\\\\\\\\n    * **Compensation for Outages:** There are no financial credits or compensation for outages or performance issues for free public good services. However, if there are partners who utilize your paid service, they should agree on separate customized SLAs with the RPC provider directly.\\\\\\\\n    * **Fair Use Policy**: Provide Explicit statements about the intended use for development and the prohibition of production workloads\\\\\\\\n\\\\\\\\n11. **Termination Rights**: The right to suspend or terminate the service for users who exceed fair use or misuse the service. IC must be informed about these.\\\\\\\\n\\\\\\\\n12. **Failure to Perform:** If vendor RPC services fall below the performance benchmarks mentioned above, the Infrastructure Committee has the right to transition this public good to another vendor. The current maintainer will be required to facilitate the transition.\\\\\\\\n\\\\\\\\n### Technology Guidelines\\\\\\\\n\\\\\\\\nPreferences\\\\\\\\n\\\\\\\\n* Proposers are encouraged to use current technology (load balancers, readrpc, nodes) and optimize performance to save on costs.\\\\\\\\n* Preference (not requirement) to decentralized RPC\\\\\\\\n\\\\\\\\n### Expertise Guidelines\\\\\\\\n\\\\\\\\n* Already operating current NEAR RPC nodes\\\\\\\\n* Preference (not requirement) Pagoda ex-employees, including SREs that previously maintained this infrastructure or other existing NEAR ecosystem partners\\\\\\\\n\\\\\\\\n## Transition steps for the selected vendor\\\\\\\\n\\\\\\\\n1. Set up necessary access and permissions for the new team for DNS records and any other associated infrastructure related to DNS service (for example - load balancers)\\\\\\\\n2. Conduct knowledge transfer sessions with the current Pagoda team, including one on [ReadRPC,](https://github.com/near/read-rpc) in case the vendor wants to inherit that tech.\\\\\\\\n3. Implement and test any necessary changes or improvements to the infrastructure.\\\\\\\\n4. Perform thorough testing to ensure data integrity and system performance.\\\\\\\\n5. Gain access to relevant documentation.\\\\\\\\n6. Establish new support channels and processes.\\\\\\\\n7. Conduct a final review and handover with the Infrastructure Committee.\\\\\\\\n8. Conduct official communications on your channels and with the NEAR Developer ecosystems and relevant stakeholders.\\\\\\\\n\\\\\\\\n### Budget Guidelines\\\\\\\\n\\\\\\\\n#### Budget\\\\\\\\n\\\\\\\\nProposals should outline a detailed budget with a clear breakdown of costs, including development, testing, documentation, maintenance and support, infrastructure, third-party services, and external API costs. Maintenance costs should be calculated accurately based on provided usage information and existing software costs. Properly assessing a budget based on usage is a significant factor in qualifying legitimate entities.\\\\\\\\n\\\\\\\\n#### Milestones\\\\\\\\n\\\\\\\\nPlease highlight the details of the various milestones in your development plan and the relevant budgets attached to each milestone. Any metrics around the milestone\\\\\\\\\\\\'s success (acceptance criterion) should also be included. Milestone examples include signing the agreement, the official transition, a 6-month or 12-month billing period, etc.\\\\\\\\n\\\\\\\\n#### Contingency\\\\\\\\n\\\\\\\\nInclude a contingency plan for potential overruns or unexpected expenses. Suppose expenses for providing free services or public goods to the NEAR ecosystem exceed previous budgets. In that case, a clear policy should be to report expenses incurred by NEAR usage to cover additional costs and prove that costs exceeded previous budgets.\\\\\\\\n\\\\\\\\n## Current Usage\\\\\\\\n\\\\\\\\nBelow are some of the statistics related to the current usage of RPC services provided by the Pagoda SRE team:\\\\\\\\n\\\\\\\\n* RPC Mainnet - 6k requests/s\\\\\\\\n* RPC-Archival Mainnet - 2k requests/s\\\\\\\\n* RPC Testnet - 400 requests/s\\\\\\\\n* RPC-Archival Testnet - 150 requests/s\\\\\\\\n\\\\\\\\nRequests have been stagnant, fluctuating from a steady 10k RPS to peaks of 25k RPS.\\\\\\\\n\\\\\\\\n## Evaluation Criteria\\\\\\\\n\\\\\\\\n### Technical Expertise and Experience\\\\\\\\n\\\\\\\\n* Demonstrated expertise in building and maintaining high-performance RPC infrastructure for blockchain networks\\\\\\\\n* Minimum two years of experience working with blockchain RPC systems\\\\\\\\n* Strong understanding of NEAR protocol architecture and technical specifications\\\\\\\\n* Proven track record of handling high transaction volumes and ensuring low latency\\\\\\\\n* Experience with scalable and fault-tolerant distributed systems\\\\\\\\n\\\\\\\\n### Past Performance\\\\\\\\n\\\\\\\\n* Completed at least one similar RPC infrastructure project for blockchain networks\\\\\\\\n* Positive references from previous blockchain clients or projects\\\\\\\\n* Demonstrated ability to meet or exceed service level agreements (SLAs) for uptime and performance\\\\\\\\n\\\\\\\\n### Pricing Structure\\\\\\\\n\\\\\\\\n* A clear breakdown of costs for implementation, maintenance, and scaling\\\\\\\\n* Willingness to consider performance-based pricing incentives\\\\\\\\n\\\\\\\\n### Alignment with Web3 and NEAR Values\\\\\\\\n\\\\\\\\n* Commitment to decentralization and open-source principles\\\\\\\\n* Demonstrated support for blockchain interoperability and cross-chain communication\\\\\\\\n* Alignment with NEAR\\\\\\\\\\\\'s vision of empowering developers and users\\\\\\\\n* Commitment to privacy and data protection in line with Web3 ethos\\\\\\\\n\\\\\\\\n### Governance Structure\\\\\\\\n\\\\\\\\n* Clear and transparent decision-making processes within the organization\\\\\\\\n* Defined roles and responsibilities for project management and technical leadership\\\\\\\\n* Commitment to regular communication and reporting to NEAR stakeholders\\\\\\\\n* Willingness to participate in NEAR\\\\\\\\\\\\'s governance processes and community discussions\\\\\\\\n\\\\\\\\n## Resources\\\\\\\\n\\\\\\\\nImportant - All NEAR-related RPC information can be found at [https://docs.near.org/api/rpc/providers](https://docs.near.org/api/rpc/providers) (it is also important to note that many of these providers also offer free RPC service)\\\\\\\\n\\\\\\\\n## Process\\\\\\\\n\\\\\\\\n[//]: # (Boilerplate)\\\\\\\\n\\\\\\\\n**[Proposal Process](https://docs.google.com/document/d/1F7iAT9tWngik9JPS_GadCCEB5nZtA2AiL2yWZoBGMFM/pub)**\\\\\\\\n\\\\\\\\nYou should submit a proposal in response to this RFP on the Infrastructure Committee Portal. [Here](https://docs.google.com/document/d/1TVvPXPJhZfaFwfA2UMW6c3pO2kis45SJ1Np1XOkkhnA/edit?usp=sharing) is a standard (+ [markup](https://docs.google.com/document/d/1UZRfOE1JAOhsnSmp-RmL2hY7KPJbpBImKZVvPV4YJmA/edit?usp=sharing)) template you can use as a starting point.\\\\\\\\n\\\\\\\\nMarketing materials, presentations, and images can be attached as needed as external links. An easy way to do this is to start a discussion under the Proposals category on the Infrastructure Working Group GitHub repository [here](https://github.com/near/Infrastructure-Working-Group/discussions/categories/proposals), publish, edit the post, and finally copy the links generated for the files you uploaded.\\\\\\\\n\\\\\\\\n### Proposal Submission Dates\\\\\\\\n\\\\\\\\nThe deadline for proposal submission is **Tuesday, October 8th** (giving applicants approximately two weeks), with a Q&A period on the proposal itself.\\\\\\\\n\\\\\\\\n### Selection Process\\\\\\\\n\\\\\\\\nAfter reviewing the proposals, the committee will vote on the best one. Generally, this process takes two working weeks to complete and will be discussed and voted on at the regular bi-weekly meeting.\\\\\\\\n\\\\\\\\n### Voting Dates\\\\\\\\n\\\\\\\\nThe estimate for voting completion is **two weeks** after the proposal submission date.\\\\\\\\n\\\\\\\\n### Transition Process\\\\\\\\n\\\\\\\\nThe estimated transition time is one week, not considering any KYC or KYB blockers.  \\\\\\\\n\\\\\\\\n### Funding Process\\\\\\\\n\\\\\\\\nThe Infrastructure Committee governs funding with assistance from the NEAR Foundation. If selected, your proposal enters the funding pipeline. You are required to:\\\\\\\\n\\\\\\\\n* Complete the KYC/B process conducted by the NEAR Foundation, including verification by IDVerify.\\\\\\\\n* Sign a legal agreement regarding the work as outlined in the proposal conducted by the NEAR Foundation.\\\\\\\\n* Submit an invoice to NEAR Foundation Finance outlining how you want funds disbursed, to what wallets or banks, and in the agreed-upon amounts.\\\\\\\\n* Complete a test transaction to verify target wallets (when requesting funds in cryptocurrency).\\\\\\\\n\\\\\\\\n### Funding Dates\\\\\\\\n\\\\\\\\nThe funding process is generally completed in one working week if the proposal does not require clarifications in the budget, work approach, legal agreement, or invoicing terms.\\\\\\\\n\\\\\\\\n### Communication\\\\\\\\n\\\\\\\\nPlease direct all communications to the thread where the RFP started beneath the submitted proposal. Please direct confidential or sensitive communications to the Telegram group set up between the committee and the organization/entity/team. If you don\\\\\\\\\\\\'t have a private Telegram group between your team and the Infrastructure Committee, please request one in this thread.\\\\\\\\n\", \"rfp_body_version\": \"V0\", \"submission_deadline\": \"1728345600000000000\"}, \"labels\": [\"RPC Nodes\"]}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 2.2863761512138e+21
    }
  },
  {
    "id": "8623768703",
    "receipt_id": "DBYu9sPyEcQGVdFz4vq23X3jcG3uMG9sCeAvbsWewvtU",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "social.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "4ipFL1NAX51LDKzNf9M6m41DmSdrfUbnQhPHZdtafqbz",
      "block_height": 128795058,
      "block_timestamp": 1727186786133091000
    },
    "receipt_outcome": {
      "gas_burnt": 4490802193668,
      "tokens_burnt": 449080219366800000000,
      "executor_account_id": "social.near",
      "status": true
    },
    "transaction_hash": "G9WkXeqzEDbFZvQn5XkVtwxM8Xpqmy4aUJFeycKLAckC",
    "included_in_block_hash": "GupJc8B3p4oy9iUbC8t2zGrfqNBBZf9G8t7WGqamvdHM",
    "block_timestamp": "1727186783474290917",
    "block": {
      "block_height": 128795056
    },
    "receipt_conversion_tokens_burnt": "121223810383000000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set",
        "deposit": 0,
        "fee": 449080219366800000000,
        "args": "{\"data\": {\"infrastructure-committee.near\": {\"post\": {\"main\": \"{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"md\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"text\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"A new Request for Proposals is published.\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\n\\\\\\\\u{2014}\\\\\\\\u{2014}\\\\\\\\u{2014}\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\n**Title**: \\\\\\\\u{201c}New Operator for near.org RPC Service\\\\\\\\u{201c}\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\n**Summary**:\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\nAs [Pagoda winds down its services](https://docs.near.org/blog/2024-08-13-pagoda-services) and critical infrastructure, there is a need to transition the management and development of the near.org RPC service, which is being used as a public good in the ecosystem, with a clear service level agreement for the chosen vendor.\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\n\\\\\\\\u{2014}\\\\\\\\u{2014}\\\\\\\\u{2014}\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\nRead the full RFP and participate [here](/devhub.near/widget/app?page=rfp&id=2)\\\\\\\\\\\\\\\"}\"}, \"index\": {\"post\": \"{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"main\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"md\\\\\\\\\\\\\\\"}}\"}}}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 2.2863761512138e+21
    }
  },
  {
    "id": "8623768705",
    "receipt_id": "GKCkXUi8Ei5zw2kDD8uGdGsQuqRj4MfnsgtSZrYeEB2d",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "4ipFL1NAX51LDKzNf9M6m41DmSdrfUbnQhPHZdtafqbz",
      "block_height": 128795058,
      "block_timestamp": 1727186786133091000
    },
    "receipt_outcome": {
      "gas_burnt": 4782400888068,
      "tokens_burnt": 478240088806800000000,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "G9WkXeqzEDbFZvQn5XkVtwxM8Xpqmy4aUJFeycKLAckC",
    "included_in_block_hash": "GupJc8B3p4oy9iUbC8t2zGrfqNBBZf9G8t7WGqamvdHM",
    "block_timestamp": "1727186783474290917",
    "block": {
      "block_height": 128795056
    },
    "receipt_conversion_tokens_burnt": "121223810383000000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set_rfp_block_height_callback",
        "deposit": 0,
        "fee": 478240088806800000000,
        "args": "{\"rfp\": {\"id\": 2, \"snapshot\": {\"name\": \"New Operator for near.org RPC Service\", \"labels\": [\"RPC Nodes\"], \"summary\": \"As [Pagoda winds down its services](https://docs.near.org/blog/2024-08-13-pagoda-services) and critical infrastructure, there is a need to transition the management and development of the near.org RPC service, which is being used as a public good in the ecosystem, with a clear service level agreement for the chosen vendor.\", \"timeline\": {\"status\": \"ACCEPTING_SUBMISSIONS\"}, \"editor_id\": \"trechriron71.near\", \"timestamp\": \"1727186784806478704\", \"description\": \"## Overview\\\\\\\\n\\\\\\\\nAs [Pagoda winds down its services](https://docs.near.org/blog/2024-08-13-pagoda-services) and critical infrastructure, there is a need to transition the management and development of the near.org RPC service, which is being used as a public good in the ecosystem, with a clear service level agreement for the chosen vendor.\\\\\\\\n\\\\\\\\nnear.org RPC currently operates as a high-capacity NEAR RPC service, entirely subsidized by the NEAR Foundation. It is used by countless applications and wallets, including some of the most popular NEAR applications. However, we recognize that, by being hosted on near.org and offered at no cost to developers, the service contributes to unwanted centralization of the NEAR ecosystem.  \\\\\\\\n\\\\\\\\nNear.org RPC will become a heavily rate-limited \\\\\\\\u{201c}free tier\\\\\\\\u{201d} or demo-only service, maintaining backward compatibility with existing dev tooling and low-traffic applications.  High-traffic applications will be responsible for migrating their RPC usage to an alternative provider.  As part of this RFP, the new operator for this rate-limited near.org RPC service will be allowed to advertise their related commercial offering to these users, with the limits described below.\\\\\\\\n\\\\\\\\n## Technical Overview\\\\\\\\n\\\\\\\\nThe Infrastructure Committee (IC) seeks a new operator for these four URLs during or after the transformation into a free-tier-only service:\\\\\\\\n\\\\\\\\n* [https://rpc.mainnet.near.org](https://rpc.mainnet.near.org)\\\\\\\\n* [https://rpc.testnet.near.org](https://rpc.testnet.near.org)\\\\\\\\n* [https://archival-rpc.mainnet.near.org](https://archival-rpc.mainnet.near.org)\\\\\\\\n* [https://archival-rpc.testnet.near.org](https://archival-rpc.testnet.near.org)\\\\\\\\n\\\\\\\\nThe current implementation of near.org RPC relies primarily on [Read-RPC](https://github.com/near/read-rpc/), a specially optimized backend server, and a ScyllaDB database built to handle NEAR RPC queries at scale. Some requests are routed to a scaled fleet of standard or archival [NEAR RPC nodes](https://near-nodes.io/rpc) running on Google Cloud. All underlying systems conform to the [NEAR RPC API regardless of where a request is routed](https://docs.near.org/api/rpc/introduction).\\\\\\\\n\\\\\\\\nThe new operator is welcome to use any or all of the current setups or their own. However, they must establish new relationships with the necessary cloud service providers.\\\\\\\\n\\\\\\\\n### Current Rate Limits\\\\\\\\n\\\\\\\\nThese are the existing rate limits applied by Pagoda (current maintainers).\\\\\\\\n\\\\\\\\n* RPC\\\\\\\\n  * 9000 requests/10s (27000 requests/30s) per IP (mainnet)\\\\\\\\n  * 2000 requests/30s per IP (testnet)\\\\\\\\n* Archival-RPC\\\\\\\\n  * 1000 requests/30s per IP (mainnet)\\\\\\\\n  * 2000 requests/30s per IP (testnet)\\\\\\\\n\\\\\\\\nNote: There is no authentication on these RPC endpoints.\\\\\\\\n\\\\\\\\nA few NEAR Foundation partners (dApps) are exempt from the rate limits above, consume a high load of RPC services, and receive white glove service provided by the Pagoda SRE team. They\\\\\\\\u{2019}re identified by using special Referrer headers in their requests. These partners have been notified that this level of service will be ending, and they have been encouraged to move out to alternative RPC providers that meet their production demands. After 01-Feb-2025, if they choose to remain on near.org RPC, they will be subject to the same rate limits as everyone else.\\\\\\\\n\\\\\\\\n### Transformation into Demo Environment\\\\\\\\n\\\\\\\\nAs mentioned above, we seek to turn near.org RPC into a free-tier / demo environment only by gradually lowering rate limits until the beginning of February.\\\\\\\\n\\\\\\\\nPagoda will execute this transformation according to the schedule below until the new operator takes over; at this point, they will be expected to continue that transformation. The Infrastructure Committee will prioritize proposals for an earlier transition to the new operator instead of waiting for the Pagoda team to finish lowering the rate limits.\\\\\\\\n\\\\\\\\nThis RFP aims to ensure that the special partners using near.org RPC for high-traffic loads are not adversely affected during and after this transition period. Near Foundation will work with the Pagoda SRE team and the new operator to ensure that their workload seamlessly migrates to the new RPC provider of their choice.\\\\\\\\n\\\\\\\\nOctober 15th:\\\\\\\\n\\\\\\\\n* **RPC Mainnet:** 15000 requests/30s per IP\\\\\\\\n* **RPC Testnet:** 1500 requests/30s per IP\\\\\\\\n* **Archival-RPC Mainnet:** 800 requests/30s per IP\\\\\\\\n* **Archival-RPC Testnet:** 1500 requests/30s per IP\\\\\\\\n\\\\\\\\nNovember 1st\\\\\\\\n\\\\\\\\n* **RPC Mainnet**: 5000 requests/30s per IP **or referrer**\\\\\\\\n* **RPC Testnet**: 1200 requests/30s per IP **or referrer**\\\\\\\\n* **Archival-RPC Mainnet**: 400 requests/30s per IP **or referrer**\\\\\\\\n* **Archival-RPC Testnet**: 800 requests/30s per IP **or referrer**\\\\\\\\n\\\\\\\\nDecember 1st\\\\\\\\n\\\\\\\\n* **RPC Mainnet**: 2000 requests/30s per IP or referrer\\\\\\\\n* **RPC Testnet**: 900 requests/30s per IP or referrer\\\\\\\\n* **Archival-RPC Mainnet**: 200 requests/30s IP or referrer\\\\\\\\n* **Archival-RPC Testnet**: 400 requests/30s per IP or referrer\\\\\\\\n\\\\\\\\nJanuary 1:\\\\\\\\n\\\\\\\\n* **RPC Mainnet**: 500 requests/30s per IP or referrer\\\\\\\\n* **RPC Testnet**: 600 requests/30s per IP or referrer\\\\\\\\n* **Archival-RPC Mainnet**: 100 requests/30s per IP or referrer\\\\\\\\n* **Archival-RPC Testnet**: 200 requests/30s per IP or referrer\\\\\\\\n\\\\\\\\nFebruary 1st\\\\\\\\n\\\\\\\\n* **RPC Mainnet**: 150 req/30s per IP or referrer\\\\\\\\n* **RPC Testnet**: 300 requests/30s per IP or referrer\\\\\\\\n* **Archival-RPC Mainnet**: 20 requests/30s per IP or referrer\\\\\\\\n* **Archival-RPC Testnet**: 100 requests/30s per IP or referrer\\\\\\\\n\\\\\\\\nNote: Rate limits will be applied by IP or by the HTTP \\\\\\\\u{201c}Referer\\\\\\\\u{201d} header, whichever hits first. Frontend applications will likely be rate-limited by the referrer, while backend applications will likely be rate-limited by the IP address.\\\\\\\\n\\\\\\\\n## Requirements\\\\\\\\n\\\\\\\\nThe maintenance requirements of this RPC service are listed below:\\\\\\\\n\\\\\\\\n* Collaborate with Pagoda SRE for any knowledge transfer and handover of the current endpoints\\\\\\\\n  * The current load balancer maintained by the Pagoda SRE team allows for a gradual transition. This will help ensure a smoother transition and better downtime management during the transition phase.\\\\\\\\n  * 100% target date before 01-Feb-2025, but we encourage an earlier transition during the rate limit decrease (as mentioned above), especially for overflow business\\\\\\\\n* Timely nearcore upgrades. There is a five-day time frame for deploying the latest [nearcore releases](https://github.com/near/nearcore/releases).\\\\\\\\n* Maintain monitoring and alerting system, showing the health of RPC systems\\\\\\\\n* Maintain external-facing status page (for example, [Helius Network](https://helius.statuspage.io/)) showing incidents and uptimes, and communicate across company social platforms and relevant partners.\\\\\\\\n\\\\\\\\n### Security\\\\\\\\n\\\\\\\\n* Proposals must include a comprehensive security plan, including DDoS protection measures, IP whitelisting capabilities, and detailed logging and monitoring strategies.\\\\\\\\n* Vendors must provide a detailed disaster recovery and business continuity plan, including regular backup procedures and a strategy for quick service restoration in case of major outages.\\\\\\\\n\\\\\\\\n### Service Level Agreement\\\\\\\\n\\\\\\\\n1. **Availability**\\\\\\\\n    * **Uptime Guarantee**: 99.9% monthly uptime\\\\\\\\n    * **Downtime Allowance**: Up to 44 minutes of downtime per month\\\\\\\\n\\\\\\\\n2. **Performance**\\\\\\\\n    * These are tracked internally and shared with the Infrastructure Committee (IC)**\\\\\\\\n    * **Response Time**:\\\\\\\\n    * **Mainnet RPC**: Average response time of \\\\\\\\u{2264} 1 second\\\\\\\\n    * **Testnet RPC**: Average response time of \\\\\\\\u{2264} 1.5 seconds\\\\\\\\n    * **Archival-RPC**: Average response time of \\\\\\\\u{2264} 2 seconds\\\\\\\\n    * **Rate Limiting**:\\\\\\\\n    * 150 req/30s\\\\\\\\n    * **Rate Limit Enforcement**: Strict enforcement with immediate rate limit application once thresholds are reached\\\\\\\\n    * Note: It would be good to have an external dashboard with these stats and historical data for the last 30 days.\\\\\\\\n\\\\\\\\n3. **Pricing**\\\\\\\\n    * The new RPC service provider must not accept payments for RPC services on near.org. However, it can advertise its service as a separate paid RPC with higher rate limits, as described below.\\\\\\\\n\\\\\\\\n4. **Advertising**\\\\\\\\n    * If you serve GET requests or a homepage at any of the RPC URLs above, that page can advertise your associated services, but it must:\\\\\\\\n    * Make it clear in postings or advertisements that your services are not directly affiliated with or operated by NEAR or the NEAR Foundation.\\\\\\\\n    * Include a prominent link to [https://docs.near.org/api/rpc/providers](https://docs.near.org/api/rpc/providers).  \\\\\\\\n\\\\\\\\n5. When a user is rate-limited, you must return an HTTP 429 response.\\\\\\\\n    * The response body is up to you and can also be used to advertise your associated services.  But if you do so, that response body must also contain the URL [https://docs.near.org/api/rpc/providers](https://docs.near.org/api/rpc/providers).\\\\\\\\n        * For instance, an acceptable response body is `{\\\\\\\\\\\\\\\"jsonrpc\\\\\\\\\\\\\\\": \\\\\\\\\\\\\\\"2.0\\\\\\\\\\\\\\\", \\\\\\\\\\\\\\\"error\\\\\\\\\\\\\\\": {\\\\\\\\\\\\\\\"code\\\\\\\\\\\\\\\": -429, \\\\\\\\\\\\\\\"message\\\\\\\\\\\\\\\": \\\\\\\\\\\\\\\"Rate limits exceeded. For higher rate limits, try [http://myrpcprovider.example](http://myrpcprovider.example) or other RPC providers at [https://docs.near.org/api/rpc/providers](https://docs.near.org/api/rpc/providers).\\\\\\\\\\\\\\\"}, \\\\\\\\\\\\\\\"id\\\\\\\\\\\\\\\": \\\\\\\\\\\\\\\"1\\\\\\\\\\\\\\\"}`.\\\\\\\\n\\\\\\\\n6. The Infrastructure Committee may from time to time evaluate any advertising on the near.org RPC service and demand changes within reason to conform to the guidelines above.\\\\\\\\n\\\\\\\\n7. **Support**\\\\\\\\n    * **Support Availability**: Community-based support only (e.g., through online help desk, forums, GitHub issues, or a developer community Slack/Telegram/Discord channel)\\\\\\\\n    * **Response Time**: No guaranteed response time, but best-effort responses within 24-48 hours for generic services.\\\\\\\\n\\\\\\\\n8. **Data Integrity**\\\\\\\\n    * **Data Consistency**: Standard (non-archival) RPC nodes must always serve five-time epochs. Both RPC and Archival nodes track all NEAR shards.\\\\\\\\n\\\\\\\\n9. **Updates and Changes**\\\\\\\\n    * **Notice for Breaking Changes**: At least seven days\\\\\\\\\\\\' notice for any breaking changes in the API or infrastructure\\\\\\\\n\\\\\\\\n10. **Limitations**\\\\\\\\n    * **Compensation for Outages:** There are no financial credits or compensation for outages or performance issues for free public good services. However, if there are partners who utilize your paid service, they should agree on separate customized SLAs with the RPC provider directly.\\\\\\\\n    * **Fair Use Policy**: Provide Explicit statements about the intended use for development and the prohibition of production workloads\\\\\\\\n\\\\\\\\n11. **Termination Rights**: The right to suspend or terminate the service for users who exceed fair use or misuse the service. IC must be informed about these.\\\\\\\\n\\\\\\\\n12. **Failure to Perform:** If vendor RPC services fall below the performance benchmarks mentioned above, the Infrastructure Committee has the right to transition this public good to another vendor. The current maintainer will be required to facilitate the transition.\\\\\\\\n\\\\\\\\n### Technology Guidelines\\\\\\\\n\\\\\\\\nPreferences\\\\\\\\n\\\\\\\\n* Proposers are encouraged to use current technology (load balancers, readrpc, nodes) and optimize performance to save on costs.\\\\\\\\n* Preference (not requirement) to decentralized RPC\\\\\\\\n\\\\\\\\n### Expertise Guidelines\\\\\\\\n\\\\\\\\n* Already operating current NEAR RPC nodes\\\\\\\\n* Preference (not requirement) Pagoda ex-employees, including SREs that previously maintained this infrastructure or other existing NEAR ecosystem partners\\\\\\\\n\\\\\\\\n## Transition steps for the selected vendor\\\\\\\\n\\\\\\\\n1. Set up necessary access and permissions for the new team for DNS records and any other associated infrastructure related to DNS service (for example - load balancers)\\\\\\\\n2. Conduct knowledge transfer sessions with the current Pagoda team, including one on [ReadRPC,](https://github.com/near/read-rpc) in case the vendor wants to inherit that tech.\\\\\\\\n3. Implement and test any necessary changes or improvements to the infrastructure.\\\\\\\\n4. Perform thorough testing to ensure data integrity and system performance.\\\\\\\\n5. Gain access to relevant documentation.\\\\\\\\n6. Establish new support channels and processes.\\\\\\\\n7. Conduct a final review and handover with the Infrastructure Committee.\\\\\\\\n8. Conduct official communications on your channels and with the NEAR Developer ecosystems and relevant stakeholders.\\\\\\\\n\\\\\\\\n### Budget Guidelines\\\\\\\\n\\\\\\\\n#### Budget\\\\\\\\n\\\\\\\\nProposals should outline a detailed budget with a clear breakdown of costs, including development, testing, documentation, maintenance and support, infrastructure, third-party services, and external API costs. Maintenance costs should be calculated accurately based on provided usage information and existing software costs. Properly assessing a budget based on usage is a significant factor in qualifying legitimate entities.\\\\\\\\n\\\\\\\\n#### Milestones\\\\\\\\n\\\\\\\\nPlease highlight the details of the various milestones in your development plan and the relevant budgets attached to each milestone. Any metrics around the milestone\\\\\\\\\\\\'s success (acceptance criterion) should also be included. Milestone examples include signing the agreement, the official transition, a 6-month or 12-month billing period, etc.\\\\\\\\n\\\\\\\\n#### Contingency\\\\\\\\n\\\\\\\\nInclude a contingency plan for potential overruns or unexpected expenses. Suppose expenses for providing free services or public goods to the NEAR ecosystem exceed previous budgets. In that case, a clear policy should be to report expenses incurred by NEAR usage to cover additional costs and prove that costs exceeded previous budgets.\\\\\\\\n\\\\\\\\n## Current Usage\\\\\\\\n\\\\\\\\nBelow are some of the statistics related to the current usage of RPC services provided by the Pagoda SRE team:\\\\\\\\n\\\\\\\\n* RPC Mainnet - 6k requests/s\\\\\\\\n* RPC-Archival Mainnet - 2k requests/s\\\\\\\\n* RPC Testnet - 400 requests/s\\\\\\\\n* RPC-Archival Testnet - 150 requests/s\\\\\\\\n\\\\\\\\nRequests have been stagnant, fluctuating from a steady 10k RPS to peaks of 25k RPS.\\\\\\\\n\\\\\\\\n## Evaluation Criteria\\\\\\\\n\\\\\\\\n### Technical Expertise and Experience\\\\\\\\n\\\\\\\\n* Demonstrated expertise in building and maintaining high-performance RPC infrastructure for blockchain networks\\\\\\\\n* Minimum two years of experience working with blockchain RPC systems\\\\\\\\n* Strong understanding of NEAR protocol architecture and technical specifications\\\\\\\\n* Proven track record of handling high transaction volumes and ensuring low latency\\\\\\\\n* Experience with scalable and fault-tolerant distributed systems\\\\\\\\n\\\\\\\\n### Past Performance\\\\\\\\n\\\\\\\\n* Completed at least one similar RPC infrastructure project for blockchain networks\\\\\\\\n* Positive references from previous blockchain clients or projects\\\\\\\\n* Demonstrated ability to meet or exceed service level agreements (SLAs) for uptime and performance\\\\\\\\n\\\\\\\\n### Pricing Structure\\\\\\\\n\\\\\\\\n* A clear breakdown of costs for implementation, maintenance, and scaling\\\\\\\\n* Willingness to consider performance-based pricing incentives\\\\\\\\n\\\\\\\\n### Alignment with Web3 and NEAR Values\\\\\\\\n\\\\\\\\n* Commitment to decentralization and open-source principles\\\\\\\\n* Demonstrated support for blockchain interoperability and cross-chain communication\\\\\\\\n* Alignment with NEAR\\\\\\\\\\\\'s vision of empowering developers and users\\\\\\\\n* Commitment to privacy and data protection in line with Web3 ethos\\\\\\\\n\\\\\\\\n### Governance Structure\\\\\\\\n\\\\\\\\n* Clear and transparent decision-making processes within the organization\\\\\\\\n* Defined roles and responsibilities for project management and technical leadership\\\\\\\\n* Commitment to regular communication and reporting to NEAR stakeholders\\\\\\\\n* Willingness to participate in NEAR\\\\\\\\\\\\'s governance processes and community discussions\\\\\\\\n\\\\\\\\n## Resources\\\\\\\\n\\\\\\\\nImportant - All NEAR-related RPC information can be found at [https://docs.near.org/api/rpc/providers](https://docs.near.org/api/rpc/providers) (it is also important to note that many of these providers also offer free RPC service)\\\\\\\\n\\\\\\\\n## Process\\\\\\\\n\\\\\\\\n[//]: # (Boilerplate)\\\\\\\\n\\\\\\\\n**[Proposal Process](https://docs.google.com/document/d/1F7iAT9tWngik9JPS_GadCCEB5nZtA2AiL2yWZoBGMFM/pub)**\\\\\\\\n\\\\\\\\nYou should submit a proposal in response to this RFP on the Infrastructure Committee Portal. [Here](https://docs.google.com/document/d/1TVvPXPJhZfaFwfA2UMW6c3pO2kis45SJ1Np1XOkkhnA/edit?usp=sharing) is a standard (+ [markup](https://docs.google.com/document/d/1UZRfOE1JAOhsnSmp-RmL2hY7KPJbpBImKZVvPV4YJmA/edit?usp=sharing)) template you can use as a starting point.\\\\\\\\n\\\\\\\\nMarketing materials, presentations, and images can be attached as needed as external links. An easy way to do this is to start a discussion under the Proposals category on the Infrastructure Working Group GitHub repository [here](https://github.com/near/Infrastructure-Working-Group/discussions/categories/proposals), publish, edit the post, and finally copy the links generated for the files you uploaded.\\\\\\\\n\\\\\\\\n### Proposal Submission Dates\\\\\\\\n\\\\\\\\nThe deadline for proposal submission is **Tuesday, October 8th** (giving applicants approximately two weeks), with a Q&A period on the proposal itself.\\\\\\\\n\\\\\\\\n### Selection Process\\\\\\\\n\\\\\\\\nAfter reviewing the proposals, the committee will vote on the best one. Generally, this process takes two working weeks to complete and will be discussed and voted on at the regular bi-weekly meeting.\\\\\\\\n\\\\\\\\n### Voting Dates\\\\\\\\n\\\\\\\\nThe estimate for voting completion is **two weeks** after the proposal submission date.\\\\\\\\n\\\\\\\\n### Transition Process\\\\\\\\n\\\\\\\\nThe estimated transition time is one week, not considering any KYC or KYB blockers.  \\\\\\\\n\\\\\\\\n### Funding Process\\\\\\\\n\\\\\\\\nThe Infrastructure Committee governs funding with assistance from the NEAR Foundation. If selected, your proposal enters the funding pipeline. You are required to:\\\\\\\\n\\\\\\\\n* Complete the KYC/B process conducted by the NEAR Foundation, including verification by IDVerify.\\\\\\\\n* Sign a legal agreement regarding the work as outlined in the proposal conducted by the NEAR Foundation.\\\\\\\\n* Submit an invoice to NEAR Foundation Finance outlining how you want funds disbursed, to what wallets or banks, and in the agreed-upon amounts.\\\\\\\\n* Complete a test transaction to verify target wallets (when requesting funds in cryptocurrency).\\\\\\\\n\\\\\\\\n### Funding Dates\\\\\\\\n\\\\\\\\nThe funding process is generally completed in one working week if the proposal does not require clarifications in the budget, work approach, legal agreement, or invoicing terms.\\\\\\\\n\\\\\\\\n### Communication\\\\\\\\n\\\\\\\\nPlease direct all communications to the thread where the RFP started beneath the submitted proposal. Please direct confidential or sensitive communications to the Telegram group set up between the committee and the organization/entity/team. If you don\\\\\\\\\\\\'t have a private Telegram group between your team and the Infrastructure Committee, please request one in this thread.\\\\\\\\n\", \"block_height\": \"128795057\", \"linked_proposals\": [], \"rfp_body_version\": \"V0\", \"submission_deadline\": \"1728345600000000000\"}, \"author_id\": \"trechriron71.near\", \"snapshot_history\": [], \"social_db_post_block_height\": \"0\"}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 2.2863761512138e+21
    }
  },
  {
    "id": "8623768707",
    "receipt_id": "6Cg2sjw5kvNPtEctqtBdJLoATJPwAc8mBUne77k5QYrW",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "social.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "4ipFL1NAX51LDKzNf9M6m41DmSdrfUbnQhPHZdtafqbz",
      "block_height": 128795058,
      "block_timestamp": 1727186786133091000
    },
    "receipt_outcome": {
      "gas_burnt": 3880130125805,
      "tokens_burnt": 388013012580500000000,
      "executor_account_id": "social.near",
      "status": true
    },
    "transaction_hash": "G9WkXeqzEDbFZvQn5XkVtwxM8Xpqmy4aUJFeycKLAckC",
    "included_in_block_hash": "GupJc8B3p4oy9iUbC8t2zGrfqNBBZf9G8t7WGqamvdHM",
    "block_timestamp": "1727186783474290917",
    "block": {
      "block_height": 128795056
    },
    "receipt_conversion_tokens_burnt": "121223810383000000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set",
        "deposit": 0,
        "fee": 388013012580500000000,
        "args": "{\"data\": {\"infrastructure-committee.near\": {\"index\": {\"notify\": \"[{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"as2.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":2,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"trechriron71.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":2,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"frol.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":2,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"eric3.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":2,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"pivortex.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":2,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"polyprogrammist.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":2,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"mob.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":2,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"theori.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":2,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"megha19.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":2,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"flmel.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":2,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":2,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"woben.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":2,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"petersalomonsen.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":2,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}}]\"}}}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 2.2863761512138e+21
    }
  },
  {
    "id": "8623873928",
    "receipt_id": "CCQjJsmtMi8R2UErDakVxhzD7gEGovzwKMqp2VLLA1wG",
    "predecessor_account_id": "trechriron71.near",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "3iZMBqkqgt19FvgsoLmAJRVDqptmkpnTkSCdoNXFomds",
      "block_height": 128795222,
      "block_timestamp": 1727187002342887400
    },
    "receipt_outcome": {
      "gas_burnt": 7542636905053,
      "tokens_burnt": 754263690505300000000,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "GHY6pEzD2R2ZjzcU5oDZL33WbuMpEA7TpzsgkRrNPoqg",
    "included_in_block_hash": "AtkiCyZBFX4iLjHCSpBT7Rk4pKuZ1GV5e5fJqWiKb6Yj",
    "block_timestamp": "1727187000977562422",
    "block": {
      "block_height": 128795221
    },
    "receipt_conversion_tokens_burnt": "100519541330000000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "edit_rfp",
        "deposit": 0,
        "fee": 754263690505300000000,
        "args": "{\"id\": 1, \"body\": {\"name\": \"Kit Wallet Indexer API\", \"summary\": \"Kit Wallet Indexer API is an undocumented but widely used lightweight indexer that helps to find user\\\\\\\\u{2019}s FTs, NFTs, and accounts by public key, that builds off of [NEAR Lake Framework](https://docs.near.org/concepts/advanced/near-lake-framework) (which also has an RFP). As [Pagoda winds down its services](https://docs.near.org/blog/2024-08-13-pagoda-services), there is a need to transition the management and development of the Kit Wallet Indexer to a capable service provider.\", \"timeline\": {\"status\": \"ACCEPTING_SUBMISSIONS\"}, \"description\": \"## Overview\\\\\\\\n\\\\\\\\nKit Wallet Indexer API is an undocumented but widely used lightweight indexer that helps to find user\\\\\\\\u{2019}s FTs, NFTs, and accounts by public key, that builds off of [NEAR Lake Framework](https://docs.near.org/concepts/advanced/near-lake-framework) (which also has an RFP). As [Pagoda winds down its services](https://docs.near.org/blog/2024-08-13-pagoda-services), there is a need to transition the management and development of the Kit Wallet Indexer to a capable service provider. The transition aims to ensure uninterrupted service of this vital data infrastructure, which is essential for various stakeholders in the NEAR ecosystem.\\\\\\\\n\\\\\\\\n* Indexer Endpoints API: [https://github.com/near/near-contract-helper/blob/master/indexer.js](https://github.com/near/near-contract-helper/blob/master/indexer.js)\\\\\\\\n* Indexer Endpoints Code: [https://github.com/near/near-contract-helper/blob/master/src/middleware/indexer.js](https://github.com/near/near-contract-helper/blob/master/src/middleware/indexer.js)\\\\\\\\n\\\\\\\\n**Current live endpoints**\\\\\\\\n\\\\\\\\n* Mainnet [https://api.kitwallet.app/](https://api.kitwallet.app/) (currently hosted on AWS)\\\\\\\\n* Testnet [https://testnet-api.kitwallet.app/](https://testnet-api.kitwallet.app/)\\\\\\\\n\\\\\\\\n## Requirements\\\\\\\\n\\\\\\\\n**Include the following endpoints on mainnet and testnet:**\\\\\\\\n\\\\\\\\n* router.get(\\\\\\\\\\\\'/publicKey/:publicKey/accounts\\\\\\\\\\\\', findAccountsByPublicKey);\\\\\\\\n* router.get(\\\\\\\\\\\\'/staking-deposits/:accountId\\\\\\\\\\\\', findStakingDeposits);\\\\\\\\n* router.get(\\\\\\\\\\\\'/account/:accountId/activity\\\\\\\\\\\\', findAccountActivity);\\\\\\\\n* router.get(\\\\\\\\\\\\'/account/:accountId/callReceivers\\\\\\\\\\\\', findReceivers);\\\\\\\\n* router.get(\\\\\\\\\\\\'/account/:accountId/likelyTokens\\\\\\\\\\\\', findLikelyTokens);\\\\\\\\n* router.get(\\\\\\\\\\\\'/account/:accountId/likelyNFTs\\\\\\\\\\\\', findLikelyNFTs);\\\\\\\\n* router.get(\\\\\\\\\\\\'/account/:accountId/likelyTokensFromBlock\\\\\\\\\\\\', findLikelyTokensFromBlock);\\\\\\\\n* router.get(\\\\\\\\\\\\'/account/:accountId/likelyNFTsFromBlock\\\\\\\\\\\\', findLikelyNFTsFromBlock);\\\\\\\\n* router.get(\\\\\\\\\\\\'/stakingPools\\\\\\\\\\\\', findStakingPools);\\\\\\\\n\\\\\\\\n## Usage \\\\\\\\n\\\\\\\\nThe graph below indicates the most recent usage for the past months KitWallet LB requests: ~350K per day (average response time is less than 0.14 seconds, but there are spikes of 50 seconds or more currently)\\\\\\\\n\\\\\\\\n![alt_text](https://github.com/user-attachments/assets/a5b10c0a-7aba-4d44-bd33-7a5ae05e42e1 \\\\\\\\\\\\\\\"image_tooltip\\\\\\\\\\\\\\\")\\\\\\\\n\\\\\\\\n![alt_text](https://github.com/user-attachments/assets/7c4fc10a-8b12-48be-be65-c1b01336b7d5 \\\\\\\\\\\\\\\"image_tooltip\\\\\\\\\\\\\\\")\\\\\\\\n\\\\\\\\n_Note: the majority of endpoint usage, [FastNear](https://github.com/fastnear/fastnear-api-server-rs) already supports_\\\\\\\\n\\\\\\\\nThis Kit Wallet Indexer API is undocumented and not officially supported.  Because of this, many wallets that are more NEAR \\\\\\\\u{201c}native\\\\\\\\u{201d} have already switched to other solutions like [FastNEAR](https://github.com/fastnear/fastnear-api-server-rs).  But there are still many [non-custodial](https://github.com/near/wallet-selector) and exchange wallets that depend on the Kit Wallet Indexer service or that we are still confirming their usage. \\\\\\\\n\\\\\\\\nWe do not have data available which NEAR ecosystem projects are currently using Kit Wallet Indexer but these should include wallets and exchanges and any projects that need to quickly query different token balances.\\\\\\\\n\\\\\\\\nEcosystem projects that have already  transitioned off of Kit Wallet to better-maintained services include [Nightly](https://nightly.app/), [Meteor Wallet](https://wallet.meteorwallet.app/), MyNEARWallet, NEAR Mobile Wallet, and [Bitte/Mintbase Wallet](wallet.bitte.ai).\\\\\\\\n\\\\\\\\n#### Monitoring, Alerting, Reporting\\\\\\\\n\\\\\\\\n* \\\\\\\\u{200b}\\\\\\\\u{200b}Real-time monitoring of system health and performance with public forward facing status page\\\\\\\\n* Alerts for data inconsistencies or indexing delays and public channel & direct communication with major stakeholders using service\\\\\\\\n* Internal Dashboard for visualizing system metrics\\\\\\\\n* Weekly progress reports during the transition phase to Infrastructure committee asynchronous \\\\\\\\n* Quarterly performance and usage reports\\\\\\\\n\\\\\\\\n#### Documentation\\\\\\\\n\\\\\\\\n**As part of this transition, maintenance, and proposals, please include;**\\\\\\\\n\\\\\\\\n* Comprehensive system architecture documentation\\\\\\\\n* API documentation including usage examples (mentioning the service will be deprecated and linked to alternative solutions like _[FastNear](https://github.com/fastnear/fastnear-api-server-rs) _) \\\\\\\\n* User guide for common queries and use cases.\\\\\\\\n\\\\\\\\n### Transition Steps for selected vendor\\\\\\\\n\\\\\\\\n1. Review and understand the current Kit Wallet Indexer API infrastructure (including accompanying infra like NEAR Lake) and processes.\\\\\\\\n2. Include detailed transition plan,in your milestones\\\\\\\\n3. Set up necessary access and permissions for the new team.\\\\\\\\n4. Conduct knowledge transfer sessions with the current Pagoda team.\\\\\\\\n5. Implement and test any necessary changes or improvements to the infrastructure.\\\\\\\\n6. Perform thorough testing to ensure data integrity and system performance.\\\\\\\\n7. Update all relevant documentation.\\\\\\\\n8. Gradually transition operational responsibilities.\\\\\\\\n9. Establish new support channels and processes.\\\\\\\\n10. Conduct a final review and handover with the Infrastructure Committee.\\\\\\\\n11. Conduct official communications on your channels and with the NEAR Developer ecosystems and relevant stakeholders\\\\\\\\n12. As part of this RFP and based on current usage, the goal is to provide this as a public good. Part of this transition strategy may include pushing users to alternatives like FastNEAR API. \\\\\\\\n13. Estimated transition time, not taking into account any KYC or KYB blockers, is 1 week.  \\\\\\\\n\\\\\\\\n### Service Level Agreements\\\\\\\\n\\\\\\\\n1. **Availability**\\\\\\\\n    * **Uptime Guarantee**: 99.0% monthly uptime\\\\\\\\n    * **Downtime Allowance**: Up to 0.1% of downtime per month\\\\\\\\n2. **Performance**:\\\\\\\\n    * *This should be tracked internally and shared with Infrastructure Committee (IC)*\\\\\\\\n    * **Response Time**:\\\\\\\\n        * Better or in line with existing response time.\\\\\\\\n    * **Rate Limiting**:\\\\\\\\n        * Please outline your rate limiting plan to continue to support Kit Wallet as a public good, if applicable. \\\\\\\\n3. **Support**\\\\\\\\n* **Support Availability**: Community-based support only (e.g., through forums, GitHub issues, or a developer community Slack/Telegram/Discord channel)\\\\\\\\n* **Response Time**: No guaranteed response time, but best-effort responses within 24-48 hours. A single point of contact for urgent issues.\\\\\\\\n4. **Data Integrity**\\\\\\\\n* **Data Consistency**: \\\\\\\\n    * Ensure that there is data validation in place (to show proper information). \\\\\\\\n    * Proper backup of data is maintained and the data is up to date. \\\\\\\\n5. **Updates and Changes**\\\\\\\\n* **Notice for Breaking Changes**: At least 7 days\\\\\\\\\\\\' notice for any breaking changes in the API or infrastructure\\\\\\\\n* **Versioning**: Ensure that the new API versions will be backward-compatible wherever possible.\\\\\\\\n* Maintenance - Proper updates to the community and stakeholders about any major maintenance which could impact the service, experience and uptime of the API adversely. \\\\\\\\n6. **Limitations**\\\\\\\\n    * **No SLA Credits**: No financial credits or compensation for outages or performance issues for free public good services. \\\\\\\\n    * **Fair Use Policy**: Provide Explicit statements about the intended use for development and the prohibition of production workloads\\\\\\\\n7. **Termination Rights**: The right to suspend or terminate the service for users who exceed fair use or misuse the service. IC must be informed about these.\\\\\\\\n8. **Failure to Perform:** If Kit Wallet maintenance falls below the performance aforementioned benchmarks, the Infrastructure Committee has the right to transition this public good to another vendor. The current maintainer will be required to facilitate the transition. \\\\\\\\n\\\\\\\\n### Budget Guidelines\\\\\\\\n\\\\\\\\n* **Budget**: Proposals should outline a **detailed budget**. A clear breakdown of costs, including development, testing, documentation, maintenance & support, infrastructure, 3rd party services and external API costs. Maintenance cost should be calculated accurately based on provided usage information and existing software costs. Being able to properly assess a budget based on usage is a major factor for qualifying legitimate vendors.\\\\\\\\n* **Milestones**: Please highlight the details of the various milestones that are included in your development plan and relevant budgets attached to each milestone. Any metrics around success of the milestone (acceptance criterion) should also be included. Milestone examples include upon signing of agreement, upon official transition, 6 month billing period, 12 month billing period, \\\\\\\\u{2026} and so forth. \\\\\\\\n* **Contingency**: Include a contingency plan for potential overruns or unexpected expenses. In the event that expense for providing free or a public good to the NEAR ecosystem, there should be a clear policy to report expenses incurred by NEAR usage to cover additional costs and prove that costs exceeded previous budgets. \\\\\\\\n\\\\\\\\n### Required Experience\\\\\\\\n\\\\\\\\n* **Experience:** Proven experience in big data processing, cloud infrastructure management, and blockchain data indexing, preferably within the blockchain or fintech sectors. Experience working with NEAR Protocol is a plus.\\\\\\\\n* **Portfolio:** Examples of previous work and case studies demonstrating success in similar projects.\\\\\\\\n* **Team:** A skilled team comprising developers, data engineers, and support staff with relevant experience.\\\\\\\\n* **Relevant Business:** Demonstrate that your team has an existing business that would motivate you to continue building and maintaining this infrastructure\\\\\\\\n\\\\\\\\n## Resources\\\\\\\\n\\\\\\\\n**Alternatives to Kit Wallet;**\\\\\\\\n\\\\\\\\n* Fast NEAR API Server: [https://github.com/fastnear/fastnear-api-server-rs](https://github.com/fastnear/fastnear-api-server-rs) (hosted free alternative)\\\\\\\\n* Pagoda enhanced api: [https://console.pagoda.co/apis?tab=enhancedApi#/](https://console.pagoda.co/apis?tab=enhancedApi#/) \\\\\\\\n* NEARBlocks api: [https://api.nearblocks.io/v1/account/rektdegen.near/inventory](https://api.nearblocks.io/v1/account/rektdegen.near/inventory) \\\\\\\\n* HERE Wallet ZMQ Indexer [https://github.com/here-wallet/near-zmq-indexer](https://github.com/here-wallet/near-zmq-indexer)  \\\\\\\\n* [Mintbase Indexer](https://docs.mintbase.xyz/dev/mintbase-graph) [https://github.com/here-wallet/near-zmq-indexer](https://github.com/here-wallet/near-zmq-indexer) \\\\\\\\n\\\\\\\\n**Support;** \\\\\\\\n\\\\\\\\n* NEAR Indexer Working Group [https://nearbuilders.com/tg-data](https://nearbuilders.com/tg-data) \\\\\\\\n\\\\\\\\n**Kit Wallet Resources;**\\\\\\\\n\\\\\\\\n* [https://github.com/near/near-contract-helper](https://github.com/near/near-contract-helper)\\\\\\\\n* Indexer Endpoints API: [https://github.com/near/near-contract-helper/blob/master/indexer.js](https://github.com/near/near-contract-helper/blob/master/indexer.js)\\\\\\\\n* Indexer Endpoints Code: [https://github.com/near/near-contract-helper/blob/master/src/middleware/indexer.js](https://github.com/near/near-contract-helper/blob/master/src/middleware/indexer.js)\\\\\\\\n\\\\\\\\n**Past Proposals;**\\\\\\\\n\\\\\\\\n* HERE Wallet [https://gov.near.org/t/proposal-develop-public-near-indexer-from-here-wallet-team-compatible-with-kitwallet-api/37307](https://gov.near.org/t/proposal-develop-public-near-indexer-from-here-wallet-team-compatible-with-kitwallet-api/37307)\\\\\\\\n\\\\\\\\n## Process\\\\\\\\n\\\\\\\\n**[Proposal Process](https://docs.google.com/document/d/1F7iAT9tWngik9JPS_GadCCEB5nZtA2AiL2yWZoBGMFM/pub)**\\\\\\\\n\\\\\\\\nYou should submit a proposal in response to this RFP on the Infrastructure Committee Portal. [Here](https://docs.google.com/document/d/1TVvPXPJhZfaFwfA2UMW6c3pO2kis45SJ1Np1XOkkhnA/edit?usp=sharing) is a standard (+ [markup](https://docs.google.com/document/d/1UZRfOE1JAOhsnSmp-RmL2hY7KPJbpBImKZVvPV4YJmA/edit?usp=sharing)) template you can use as a starting point. \\\\\\\\n\\\\\\\\nMarketing materials, presentations, and images can be attached as needed as external links. An easy way to do this is to start a discussion under the Proposals category on the Infrastructure Working Group GitHub repository [here](https://github.com/near/Infrastructure-Working-Group/discussions/categories/proposals), publish, then edit and copy the links generated to the files you uploaded.\\\\\\\\n\\\\\\\\n#### Proposal Submission Dates\\\\\\\\n\\\\\\\\nThe deadline for proposal submission is **Tuesday, October 8th** (giving applicants approximately two weeks), with a Q&A period on the proposal itself. \\\\\\\\n\\\\\\\\n### Selection Process\\\\\\\\n\\\\\\\\nAfter reviewing the proposals, the committee will vote on the best one. Generally, this process takes two working weeks to complete and will be discussed and voted on at the regular bi-weekly meeting.\\\\\\\\n\\\\\\\\n#### Voting Dates\\\\\\\\n\\\\\\\\nThe estimate for voting completion is **two weeks** after the proposal submission date.\\\\\\\\n\\\\\\\\n### Transition Process\\\\\\\\n\\\\\\\\nThe estimated transition time is one week, not considering any KYC or KYB blockers.  \\\\\\\\n\\\\\\\\n### Funding Process\\\\\\\\n\\\\\\\\nThe Infrastructure Committee governs funding with assistance from the NEAR Foundation. If selected, your proposal enters the funding pipeline. You are required to:\\\\\\\\n\\\\\\\\n* Complete the KYC/B process conducted by the NEAR Foundation, including verification by IDVerify.\\\\\\\\n* Sign a legal agreement regarding the work as outlined in the proposal conducted by the NEAR Foundation.\\\\\\\\n* Submit an invoice to NEAR Foundation Finance outlining how you want funds disbursed, to what wallets or banks, and in the agreed-upon amounts.\\\\\\\\n* Complete a test transaction to verify target wallets (when requesting funds in cryptocurrency).\\\\\\\\n\\\\\\\\n#### Funding Dates\\\\\\\\n\\\\\\\\nThe funding process is generally completed in one working week if the proposal does not require clarifications in the budget, work approach, legal agreement, or invoicing terms.\\\\\\\\n\\\\\\\\n## Communication\\\\\\\\n\\\\\\\\nPlease direct all communications to the thread where the RFP started beneath the submitted proposal. Please direct confidential or sensitive communications to the Telegram group set up between the committee and the organization/entity/team. If you don\\\\\\\\\\\\'t have a private Telegram group between your team and the Infrastructure Committee, please request one in this thread.\\\\\\\\n\\\\\\\\n\", \"rfp_body_version\": \"V0\", \"submission_deadline\": \"1728345600000000000\"}, \"labels\": [\"Indexers\"]}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.2428133577406e+21
    }
  },
  {
    "id": "8623875055",
    "receipt_id": "5TRkTESZ3FcJCeMMzc8Zch4pWBhNfVo88r38bBRsxAUt",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "social.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "Fan2qA1iqpGKTzL2z2vkskPRif43Bvh6dpcuAxbeJAF5",
      "block_height": 128795223,
      "block_timestamp": 1727187003703547600
    },
    "receipt_outcome": {
      "gas_burnt": 3880301259053,
      "tokens_burnt": 388030125905300000000,
      "executor_account_id": "social.near",
      "status": true
    },
    "transaction_hash": "GHY6pEzD2R2ZjzcU5oDZL33WbuMpEA7TpzsgkRrNPoqg",
    "included_in_block_hash": "AtkiCyZBFX4iLjHCSpBT7Rk4pKuZ1GV5e5fJqWiKb6Yj",
    "block_timestamp": "1727187000977562422",
    "block": {
      "block_height": 128795221
    },
    "receipt_conversion_tokens_burnt": "100519541330000000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set",
        "deposit": 0,
        "fee": 388030125905300000000,
        "args": "{\"data\": {\"infrastructure-committee.near\": {\"index\": {\"notify\": \"[{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"flmel.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":1,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"pivortex.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":1,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"petersalomonsen.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":1,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"polyprogrammist.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":1,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":1,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"trechriron71.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":1,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"eric3.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":1,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"theori.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":1,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"as2.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":1,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"woben.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":1,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"frol.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":1,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"mob.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":1,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"megha19.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":1,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}}]\"}}}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.2428133577406e+21
    }
  },
  {
    "id": "8623893565",
    "receipt_id": "GtmXy2vKAamEicrgL7vGN5uu3WF8rrDSFfXpg3ZpAgAh",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "social.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "9vkhSPTa5pL6Hx6EFVe2mmfms3T86JBFi6bYvWKwzmXe",
      "block_height": 128795249,
      "block_timestamp": 1727187037987691500
    },
    "receipt_outcome": {
      "gas_burnt": 4294359769691,
      "tokens_burnt": 429435976969100000000,
      "executor_account_id": "social.near",
      "status": true
    },
    "transaction_hash": "3c9wgQQkxHVnJe983mQGKecnKU7HcSa9WiDSAJWwMfvt",
    "included_in_block_hash": "5Eer2EQHoyT6N5cMapHfcfggJ6KEBfHUX93iqAMimWMP",
    "block_timestamp": "1727187036724918172",
    "block": {
      "block_height": 128795248
    },
    "receipt_conversion_tokens_burnt": "31316165750500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set",
        "deposit": 0,
        "fee": 429435976969100000000,
        "args": "{\"data\": {\"infrastructure-committee.near\": {\"widget\": {\"near-prpsls-bos.components.pages.app\": {\"\": null}}}}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 460752142719600000000
    }
  },
  {
    "id": "8623894417",
    "receipt_id": "uWJRPUFFEs4cv5Dyg5zLQtuR3Y4LFArtEe4KfbJLJEf",
    "predecessor_account_id": "system",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "FKUWGFw1NbnhP2CjLquzTarqfwm7cqiu35p9nRTQuM1t",
      "block_height": 128795250,
      "block_timestamp": 1727187039293948000
    },
    "receipt_outcome": {
      "gas_burnt": 223182562500,
      "tokens_burnt": 0,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "3c9wgQQkxHVnJe983mQGKecnKU7HcSa9WiDSAJWwMfvt",
    "included_in_block_hash": "5Eer2EQHoyT6N5cMapHfcfggJ6KEBfHUX93iqAMimWMP",
    "block_timestamp": "1727187036724918172",
    "block": {
      "block_height": 128795248
    },
    "receipt_conversion_tokens_burnt": "31316165750500000000",
    "actions": [
      {
        "action": "TRANSFER",
        "method": null,
        "deposit": 1.8763783862513094e+23,
        "fee": 0,
        "args": null
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 460752142719600000000
    }
  },
  {
    "id": "8623968333",
    "receipt_id": "AVsRTB5BhysAdH1NySKFA1CJNm5minTLfSFGohF7GHv7",
    "predecessor_account_id": "trechriron71.near",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "8S5vJKmHVuV3acwrJgwH2fvhK83ddjHCZindfkRhh83r",
      "block_height": 128795443,
      "block_timestamp": 1727187284809427000
    },
    "receipt_outcome": {
      "gas_burnt": 7867522438342,
      "tokens_burnt": 786752243834200000000,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "3zVj2A7zNwRH4oU3bqhW269Wutiq7z29Qk9t5xJsSg5C",
    "included_in_block_hash": "CoHCuQqaxLi8gjKRRADSxqjTAcwWuBYLRdPsxS1wgGsf",
    "block_timestamp": "1727187283477809533",
    "block": {
      "block_height": 128795442
    },
    "receipt_conversion_tokens_burnt": "84931734896500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "add_rfp",
        "deposit": 0,
        "fee": 786752243834200000000,
        "args": "{\"body\": {\"name\": \"NEAR Lake\", \"summary\": \"The Infrastructure Committee seeks a Web3 data partner to assume the Data Lake service. There is an urgent need to transition the management and development of NEAR Lake and its associated libraries to a capable service provider, ensuring no downtime and a smooth transition within three months.\", \"timeline\": {\"status\": \"ACCEPTING_SUBMISSIONS\"}, \"description\": \"## Overview\\\\\\\\n\\\\\\\\nNEAR Lake is an indexer built on top of the [NEAR Indexer microframework](https://github.com/nearprotocol/nearcore/tree/master/chain/indexer). It watches the network and stores all events as JSON files on AWS S3.\\\\\\\\n\\\\\\\\nNEAR Lake and its S3 bucket are the default data sources for NEAR Lake Framework, an ecosystem of library companions to [NEAR Lake](https://docs.near.org/build/data-infrastructure/lake-framework/near-lake). The framework allows you to build your indexer that subscribes to the stream of blocks from the [NEAR Lake](https://docs.near.org/build/data-infrastructure/lake-framework/near-lake) data source and create your logic to process the NEAR Protocol data in the programming languages of your choice (at the moment, there are implementations in [Python](http://pypi.org/project/near-lake-framework), [JavaScript](https://www.npmjs.com/package/near-lake-framework), and [Rust](https://crates.io/crates/near-lake-framework)).\\\\\\\\n\\\\\\\\nRelevant resources:\\\\\\\\n\\\\\\\\n* NEAR Lake Indexer [https://github.com/near/near-lake-indexer/](https://github.com/near/near-lake-indexer/) is a wrapper around [nearcore](https://github.com/near/nearcore) (NEAR node) that the NEAR Lake team maintains to dump the blocks/chunks from the chain to S3. The [near-lake-framework-](https://docs.near.org/concepts/advanced/near-lake-framework)* repos are clients of this data source.\\\\\\\\n* NEAR Lake Framework [https://docs.near.org/concepts/advanced/near-lake-framework](https://docs.near.org/concepts/advanced/near-lake-framework)\\\\\\\\n* NEAR Lake Framework RS [https://github.com/near/near-lake-framework-rs](https://github.com/near/near-lake-framework-rs)\\\\\\\\n* Using NEAR Lake ([Tutorial](https://www.youtube.com/watch?v=GsF7I93K-EQ)) [https://docs.near.org/build/data-infrastructure/lake-framework/near-lake](https://docs.near.org/build/data-infrastructure/lake-framework/near-lake)\\\\\\\\n\\\\\\\\nDespite its relatively low maintenance complexity, NEAR Lake is a critical piece of infrastructure that supports a majority of key stakeholders within the NEAR Ecosystem, resulting in high usage. [With Pagoda winding down its services](https://docs.near.org/blog/2024-08-13-pagoda-services), there is an urgent need to transition the management and development of NEAR Lake and its associated libraries to a capable service provider, ensuring no downtime and a smooth transition within three months. The transition may involve the new provider setting up new storage (S3) and migrating users to the new bucket or taking over the existing S3 currently managed by the Pagoda team. Please note that with protocol upgrades like dynamic sharding, the complexity of NEAR Lake will also increase.\\\\\\\\n\\\\\\\\n## Technical Requirements\\\\\\\\n\\\\\\\\nNEAR Lake is built as an unstructured [AWS data lake](https://aws.amazon.com/big-data/datalakes-and-analytics/datalakes/).\\\\\\\\n\\\\\\\\nTwo AWS S3 buckets must be created:\\\\\\\\n\\\\\\\\n* near-lake-data-testnet (eu-central-1 region)\\\\\\\\n* near-lake-data-mainnet (eu-central-1 region)\\\\\\\\n\\\\\\\\nRequired to be maintained as part of this RFP;\\\\\\\\n\\\\\\\\n* The two previously listed S3 buckets.\\\\\\\\n* Two RPC nodes per network with an indexer framework enabled. These nodes populate data in the AWS S3 buckets.\\\\\\\\n\\\\\\\\nThe source code can be found here: [https://github.com/near/near-lake-indexer](https://github.com/near/near-lake-indexer).\\\\\\\\n\\\\\\\\nProposals should include plans for:\\\\\\\\n\\\\\\\\n* Maintaining these S3 buckets.\\\\\\\\n* Maintaining lake indexer nodes or another way of populating the S3 buckets with the same data set and low latency.\\\\\\\\n* Outlining strategies to reduce costs given the current infrastructure.\\\\\\\\n\\\\\\\\n## Usage\\\\\\\\n\\\\\\\\nNEAR Lake Framework is critical infrastructure powering all our data systems, including 50 monthly AWS accounts running Indexers on NEAR Lake. These users collectively generate more than a thousand requests per second. Examples of S3 file consumers include NEAR One [ReadRPC](https://github.com/near/read-rpc), Ecosystem Indexers supporting dApps, and Data Warehouses like Databricks and Flipside.\\\\\\\\n\\\\\\\\n![near_lake_image_1](https://github.com/user-attachments/assets/a543d77d-f647-4bb1-b02d-e5ed8a2113c3 \\\\\\\\\\\\\\\"image_tooltip\\\\\\\\\\\\\\\")\\\\\\\\n\\\\\\\\n## Service Level Agreement\\\\\\\\n\\\\\\\\n* Transaction Throughput: The system must support at least 1,000 transactions per second to handle peak loads efficiently.\\\\\\\\n* Lag from the final block: The last available block in the NEAR Lake must be less than five blocks behind the last finalized block on NEAR RPC.\\\\\\\\n* Scalability: The solution must demonstrate the ability to scale linearly with increased data volumes, supporting up to 10 times the initial load without performance degradation.\\\\\\\\n* Uptime: The service must maintain an uptime of 99.9% for mainnet, which will be specified in the Service Level Agreement (SLA).\\\\\\\\n* Status Page: A public status page, similar to the Google Cloud Service Health page, must be maintained to inform users of the service status, including uptime, incidents, and maintenance updates.\\\\\\\\n\\\\\\\\n## Transition Steps\\\\\\\\n\\\\\\\\n1. Review and understand NEAR Lake.\\\\\\\\n2. Set up necessary access and permissions for the new team to AWS S3 buckets and accompanying repos. Transition AWS S3 bucket ownership (or move to new buckets) and set up new indexing nodes.\\\\\\\\n3. Conduct knowledge transfer sessions with the current Pagoda continuity team.\\\\\\\\n4. Implement and test any necessary changes or improvements to the infrastructure.\\\\\\\\n5. Perform thorough testing to ensure data integrity and system performance.\\\\\\\\n6. Update all relevant documentation.\\\\\\\\n7. Establish new support channels and processes.\\\\\\\\n8. Conduct a final review and handover with the Infrastructure Committee & Pagoda Continuity time.\\\\\\\\n9. Conduct official communications on your channels and with the NEAR Developer ecosystems and relevant stakeholders (Users of Lake, NEAR One, etc.)\\\\\\\\n\\\\\\\\n## Budget Guidelines\\\\\\\\n\\\\\\\\n### Budget\\\\\\\\n\\\\\\\\nProposals should outline a detailed budget with a clear breakdown of costs, including development, testing, documentation, maintenance and support, infrastructure, third-party services, and external API costs. Maintenance costs should be calculated accurately based on provided usage information and existing software costs. Properly assessing a budget based on usage is a significant factor in qualifying legitimate entities.\\\\\\\\n\\\\\\\\n### Milestones\\\\\\\\n\\\\\\\\nPlease highlight the details of the various milestones in your development plan and the relevant budgets attached to each milestone. Any metrics around the milestone\\\\\\\\\\\\'s success (acceptance criterion) should also be included. Milestone examples include signing the agreement, the official transition, a 6-month or 12-month billing period, etc.\\\\\\\\n\\\\\\\\n### Contingency\\\\\\\\n\\\\\\\\nInclude a contingency plan for potential overruns or unexpected expenses. Suppose expenses for providing free services or public goods to the NEAR ecosystem exceed previous budgets. In that case, a clear policy should be to report expenses incurred by NEAR usage to cover additional costs and prove that costs exceeded previous budgets.\\\\\\\\n\\\\\\\\n## Experience Required\\\\\\\\n\\\\\\\\nGiven this component\\\\\\\\\\\\'s critical role in the NEAR infrastructure, we seek an infrastructure provider already deeply embedded in the ecosystem (e.g., currently operating a NEAR indexer or a former Pagoda SRE). They must have substantial experience and commitment to the platform. Furthermore, due to the close integration of NEAR Lake with services such as the Kit Wallet Indexer API and the BigQuery dataset, we recommend that the same provider also manage and extend these related infrastructure components.\\\\\\\\n\\\\\\\\n* **Experience:**Proven experience in big data processing, cloud infrastructure management, and blockchain data indexing, preferably within the blockchain or fintech sectors. Experience working with NEAR Protocol.\\\\\\\\n* **Portfolio:** Examples of previous work and case studies demonstrating success in similar projects.\\\\\\\\n* **Team:** A skilled team comprising developers, data engineers, and support staff with relevant experience.\\\\\\\\n* **Relevant Business:**Your team has an existing business that would motivate you to continue building this infrastructure.\\\\\\\\n\\\\\\\\n## Process\\\\\\\\n\\\\\\\\n[//]: # (Boilerplate)\\\\\\\\n\\\\\\\\n**[Proposal Process](https://docs.google.com/document/d/1F7iAT9tWngik9JPS_GadCCEB5nZtA2AiL2yWZoBGMFM/pub)**\\\\\\\\n\\\\\\\\nYou should submit a proposal in response to this RFP on the Infrastructure Committee Portal. [Here](https://docs.google.com/document/d/1TVvPXPJhZfaFwfA2UMW6c3pO2kis45SJ1Np1XOkkhnA/edit?usp=sharing) is a standard (+ [markup](https://docs.google.com/document/d/1UZRfOE1JAOhsnSmp-RmL2hY7KPJbpBImKZVvPV4YJmA/edit?usp=sharing)) template you can use as a starting point.\\\\\\\\n\\\\\\\\nMarketing materials, presentations, and images can be attached as needed as external links. An easy way to do this is to start a discussion under the Proposals category on the Infrastructure Working Group GitHub repository [here](https://github.com/near/Infrastructure-Working-Group/discussions/categories/proposals), publish, edit the post, and finally copy the links generated for the files you uploaded.\\\\\\\\n\\\\\\\\n### Proposal Submission Dates\\\\\\\\n\\\\\\\\nThe deadline for proposal submission is **Tuesday, October 8th** (giving applicants approximately two weeks), with a Q&A period on the proposal itself.\\\\\\\\n\\\\\\\\n### Selection Process\\\\\\\\n\\\\\\\\nAfter reviewing the proposals, the committee will vote on the best one. Generally, this process takes two working weeks to complete and will be discussed and voted on at the regular bi-weekly meeting.\\\\\\\\n\\\\\\\\n### Voting Dates\\\\\\\\n\\\\\\\\nThe estimate for voting completion is **two weeks** after the proposal submission date.\\\\\\\\n\\\\\\\\n### Transition Process\\\\\\\\n\\\\\\\\nThe estimated transition time is one week, not considering any KYC or KYB blockers.  \\\\\\\\n\\\\\\\\n### Funding Process\\\\\\\\n\\\\\\\\nThe Infrastructure Committee governs funding with assistance from the NEAR Foundation. If selected, your proposal enters the funding pipeline. You are required to:\\\\\\\\n\\\\\\\\n* Complete the KYC/B process conducted by the NEAR Foundation, including verification by IDVerify.\\\\\\\\n* Sign a legal agreement regarding the work as outlined in the proposal conducted by the NEAR Foundation.\\\\\\\\n* Submit an invoice to NEAR Foundation Finance outlining how you want funds disbursed, to what wallets or banks, and in the agreed-upon amounts.\\\\\\\\n* Complete a test transaction to verify target wallets (when requesting funds in cryptocurrency).\\\\\\\\n\\\\\\\\n### Funding Dates\\\\\\\\n\\\\\\\\nThe funding process is generally completed in one working week if the proposal does not require clarifications in the budget, work approach, legal agreement, or invoicing terms.\\\\\\\\n\\\\\\\\n### Communication\\\\\\\\n\\\\\\\\nPlease direct all communications to the thread where the RFP started beneath the submitted proposal. Please direct confidential or sensitive communications to the Telegram group set up between the committee and the organization/entity/team. If you don\\\\\\\\\\\\'t have a private Telegram group between your team and the Infrastructure Committee, please request one in this thread.\\\\\\\\n\", \"rfp_body_version\": \"V0\", \"submission_deadline\": \"1728345600000000000\"}, \"labels\": [\"Data Lakes\", \"Indexers\"]}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 2.1213082113328e+21
    }
  },
  {
    "id": "8623968928",
    "receipt_id": "B68VunsLzitUeKAf7EyUxnTQ6Pd9FmjvGR7hTwEiMExd",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "social.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "9LEgAyrArVY2Q9yXbgpBysZBfzpRkSGqcHKgYV6MRfUG",
      "block_height": 128795444,
      "block_timestamp": 1727187286073833200
    },
    "receipt_outcome": {
      "gas_burnt": 4501560600612,
      "tokens_burnt": 450156060061200000000,
      "executor_account_id": "social.near",
      "status": true
    },
    "transaction_hash": "3zVj2A7zNwRH4oU3bqhW269Wutiq7z29Qk9t5xJsSg5C",
    "included_in_block_hash": "CoHCuQqaxLi8gjKRRADSxqjTAcwWuBYLRdPsxS1wgGsf",
    "block_timestamp": "1727187283477809533",
    "block": {
      "block_height": 128795442
    },
    "receipt_conversion_tokens_burnt": "84931734896500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set",
        "deposit": 0,
        "fee": 450156060061200000000,
        "args": "{\"data\": {\"infrastructure-committee.near\": {\"post\": {\"main\": \"{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"md\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"text\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"A new Request for Proposals is published.\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\n\\\\\\\\u{2014}\\\\\\\\u{2014}\\\\\\\\u{2014}\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\n**Title**: \\\\\\\\u{201c}NEAR Lake\\\\\\\\u{201c}\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\n**Summary**:\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\nThe Infrastructure Committee seeks a Web3 data partner to assume the Data Lake service. There is an urgent need to transition the management and development of NEAR Lake and its associated libraries to a capable service provider, ensuring no downtime and a smooth transition within three months.\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\n\\\\\\\\u{2014}\\\\\\\\u{2014}\\\\\\\\u{2014}\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\nRead the full RFP and participate [here](/devhub.near/widget/app?page=rfp&id=3)\\\\\\\\\\\\\\\"}\"}, \"index\": {\"post\": \"{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"main\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"md\\\\\\\\\\\\\\\"}}\"}}}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 2.1213082113328e+21
    }
  },
  {
    "id": "8623968929",
    "receipt_id": "D5sXjCd4GWQ8aLn5TbB7Z4sEks1YnhHTKb9NLm9NubwK",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "9LEgAyrArVY2Q9yXbgpBysZBfzpRkSGqcHKgYV6MRfUG",
      "block_height": 128795444,
      "block_timestamp": 1727187286073833200
    },
    "receipt_outcome": {
      "gas_burnt": 4114251293664,
      "tokens_burnt": 411425129366400000000,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "3zVj2A7zNwRH4oU3bqhW269Wutiq7z29Qk9t5xJsSg5C",
    "included_in_block_hash": "CoHCuQqaxLi8gjKRRADSxqjTAcwWuBYLRdPsxS1wgGsf",
    "block_timestamp": "1727187283477809533",
    "block": {
      "block_height": 128795442
    },
    "receipt_conversion_tokens_burnt": "84931734896500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set_rfp_block_height_callback",
        "deposit": 0,
        "fee": 411425129366400000000,
        "args": "{\"rfp\": {\"id\": 3, \"snapshot\": {\"name\": \"NEAR Lake\", \"labels\": [\"Indexers\", \"Data Lakes\"], \"summary\": \"The Infrastructure Committee seeks a Web3 data partner to assume the Data Lake service. There is an urgent need to transition the management and development of NEAR Lake and its associated libraries to a capable service provider, ensuring no downtime and a smooth transition within three months.\", \"timeline\": {\"status\": \"ACCEPTING_SUBMISSIONS\"}, \"editor_id\": \"trechriron71.near\", \"timestamp\": \"1727187284809427041\", \"description\": \"## Overview\\\\\\\\n\\\\\\\\nNEAR Lake is an indexer built on top of the [NEAR Indexer microframework](https://github.com/nearprotocol/nearcore/tree/master/chain/indexer). It watches the network and stores all events as JSON files on AWS S3.\\\\\\\\n\\\\\\\\nNEAR Lake and its S3 bucket are the default data sources for NEAR Lake Framework, an ecosystem of library companions to [NEAR Lake](https://docs.near.org/build/data-infrastructure/lake-framework/near-lake). The framework allows you to build your indexer that subscribes to the stream of blocks from the [NEAR Lake](https://docs.near.org/build/data-infrastructure/lake-framework/near-lake) data source and create your logic to process the NEAR Protocol data in the programming languages of your choice (at the moment, there are implementations in [Python](http://pypi.org/project/near-lake-framework), [JavaScript](https://www.npmjs.com/package/near-lake-framework), and [Rust](https://crates.io/crates/near-lake-framework)).\\\\\\\\n\\\\\\\\nRelevant resources:\\\\\\\\n\\\\\\\\n* NEAR Lake Indexer [https://github.com/near/near-lake-indexer/](https://github.com/near/near-lake-indexer/) is a wrapper around [nearcore](https://github.com/near/nearcore) (NEAR node) that the NEAR Lake team maintains to dump the blocks/chunks from the chain to S3. The [near-lake-framework-](https://docs.near.org/concepts/advanced/near-lake-framework)* repos are clients of this data source.\\\\\\\\n* NEAR Lake Framework [https://docs.near.org/concepts/advanced/near-lake-framework](https://docs.near.org/concepts/advanced/near-lake-framework)\\\\\\\\n* NEAR Lake Framework RS [https://github.com/near/near-lake-framework-rs](https://github.com/near/near-lake-framework-rs)\\\\\\\\n* Using NEAR Lake ([Tutorial](https://www.youtube.com/watch?v=GsF7I93K-EQ)) [https://docs.near.org/build/data-infrastructure/lake-framework/near-lake](https://docs.near.org/build/data-infrastructure/lake-framework/near-lake)\\\\\\\\n\\\\\\\\nDespite its relatively low maintenance complexity, NEAR Lake is a critical piece of infrastructure that supports a majority of key stakeholders within the NEAR Ecosystem, resulting in high usage. [With Pagoda winding down its services](https://docs.near.org/blog/2024-08-13-pagoda-services), there is an urgent need to transition the management and development of NEAR Lake and its associated libraries to a capable service provider, ensuring no downtime and a smooth transition within three months. The transition may involve the new provider setting up new storage (S3) and migrating users to the new bucket or taking over the existing S3 currently managed by the Pagoda team. Please note that with protocol upgrades like dynamic sharding, the complexity of NEAR Lake will also increase.\\\\\\\\n\\\\\\\\n## Technical Requirements\\\\\\\\n\\\\\\\\nNEAR Lake is built as an unstructured [AWS data lake](https://aws.amazon.com/big-data/datalakes-and-analytics/datalakes/).\\\\\\\\n\\\\\\\\nTwo AWS S3 buckets must be created:\\\\\\\\n\\\\\\\\n* near-lake-data-testnet (eu-central-1 region)\\\\\\\\n* near-lake-data-mainnet (eu-central-1 region)\\\\\\\\n\\\\\\\\nRequired to be maintained as part of this RFP;\\\\\\\\n\\\\\\\\n* The two previously listed S3 buckets.\\\\\\\\n* Two RPC nodes per network with an indexer framework enabled. These nodes populate data in the AWS S3 buckets.\\\\\\\\n\\\\\\\\nThe source code can be found here: [https://github.com/near/near-lake-indexer](https://github.com/near/near-lake-indexer).\\\\\\\\n\\\\\\\\nProposals should include plans for:\\\\\\\\n\\\\\\\\n* Maintaining these S3 buckets.\\\\\\\\n* Maintaining lake indexer nodes or another way of populating the S3 buckets with the same data set and low latency.\\\\\\\\n* Outlining strategies to reduce costs given the current infrastructure.\\\\\\\\n\\\\\\\\n## Usage\\\\\\\\n\\\\\\\\nNEAR Lake Framework is critical infrastructure powering all our data systems, including 50 monthly AWS accounts running Indexers on NEAR Lake. These users collectively generate more than a thousand requests per second. Examples of S3 file consumers include NEAR One [ReadRPC](https://github.com/near/read-rpc), Ecosystem Indexers supporting dApps, and Data Warehouses like Databricks and Flipside.\\\\\\\\n\\\\\\\\n![near_lake_image_1](https://github.com/user-attachments/assets/a543d77d-f647-4bb1-b02d-e5ed8a2113c3 \\\\\\\\\\\\\\\"image_tooltip\\\\\\\\\\\\\\\")\\\\\\\\n\\\\\\\\n## Service Level Agreement\\\\\\\\n\\\\\\\\n* Transaction Throughput: The system must support at least 1,000 transactions per second to handle peak loads efficiently.\\\\\\\\n* Lag from the final block: The last available block in the NEAR Lake must be less than five blocks behind the last finalized block on NEAR RPC.\\\\\\\\n* Scalability: The solution must demonstrate the ability to scale linearly with increased data volumes, supporting up to 10 times the initial load without performance degradation.\\\\\\\\n* Uptime: The service must maintain an uptime of 99.9% for mainnet, which will be specified in the Service Level Agreement (SLA).\\\\\\\\n* Status Page: A public status page, similar to the Google Cloud Service Health page, must be maintained to inform users of the service status, including uptime, incidents, and maintenance updates.\\\\\\\\n\\\\\\\\n## Transition Steps\\\\\\\\n\\\\\\\\n1. Review and understand NEAR Lake.\\\\\\\\n2. Set up necessary access and permissions for the new team to AWS S3 buckets and accompanying repos. Transition AWS S3 bucket ownership (or move to new buckets) and set up new indexing nodes.\\\\\\\\n3. Conduct knowledge transfer sessions with the current Pagoda continuity team.\\\\\\\\n4. Implement and test any necessary changes or improvements to the infrastructure.\\\\\\\\n5. Perform thorough testing to ensure data integrity and system performance.\\\\\\\\n6. Update all relevant documentation.\\\\\\\\n7. Establish new support channels and processes.\\\\\\\\n8. Conduct a final review and handover with the Infrastructure Committee & Pagoda Continuity time.\\\\\\\\n9. Conduct official communications on your channels and with the NEAR Developer ecosystems and relevant stakeholders (Users of Lake, NEAR One, etc.)\\\\\\\\n\\\\\\\\n## Budget Guidelines\\\\\\\\n\\\\\\\\n### Budget\\\\\\\\n\\\\\\\\nProposals should outline a detailed budget with a clear breakdown of costs, including development, testing, documentation, maintenance and support, infrastructure, third-party services, and external API costs. Maintenance costs should be calculated accurately based on provided usage information and existing software costs. Properly assessing a budget based on usage is a significant factor in qualifying legitimate entities.\\\\\\\\n\\\\\\\\n### Milestones\\\\\\\\n\\\\\\\\nPlease highlight the details of the various milestones in your development plan and the relevant budgets attached to each milestone. Any metrics around the milestone\\\\\\\\\\\\'s success (acceptance criterion) should also be included. Milestone examples include signing the agreement, the official transition, a 6-month or 12-month billing period, etc.\\\\\\\\n\\\\\\\\n### Contingency\\\\\\\\n\\\\\\\\nInclude a contingency plan for potential overruns or unexpected expenses. Suppose expenses for providing free services or public goods to the NEAR ecosystem exceed previous budgets. In that case, a clear policy should be to report expenses incurred by NEAR usage to cover additional costs and prove that costs exceeded previous budgets.\\\\\\\\n\\\\\\\\n## Experience Required\\\\\\\\n\\\\\\\\nGiven this component\\\\\\\\\\\\'s critical role in the NEAR infrastructure, we seek an infrastructure provider already deeply embedded in the ecosystem (e.g., currently operating a NEAR indexer or a former Pagoda SRE). They must have substantial experience and commitment to the platform. Furthermore, due to the close integration of NEAR Lake with services such as the Kit Wallet Indexer API and the BigQuery dataset, we recommend that the same provider also manage and extend these related infrastructure components.\\\\\\\\n\\\\\\\\n* **Experience:**Proven experience in big data processing, cloud infrastructure management, and blockchain data indexing, preferably within the blockchain or fintech sectors. Experience working with NEAR Protocol.\\\\\\\\n* **Portfolio:** Examples of previous work and case studies demonstrating success in similar projects.\\\\\\\\n* **Team:** A skilled team comprising developers, data engineers, and support staff with relevant experience.\\\\\\\\n* **Relevant Business:**Your team has an existing business that would motivate you to continue building this infrastructure.\\\\\\\\n\\\\\\\\n## Process\\\\\\\\n\\\\\\\\n[//]: # (Boilerplate)\\\\\\\\n\\\\\\\\n**[Proposal Process](https://docs.google.com/document/d/1F7iAT9tWngik9JPS_GadCCEB5nZtA2AiL2yWZoBGMFM/pub)**\\\\\\\\n\\\\\\\\nYou should submit a proposal in response to this RFP on the Infrastructure Committee Portal. [Here](https://docs.google.com/document/d/1TVvPXPJhZfaFwfA2UMW6c3pO2kis45SJ1Np1XOkkhnA/edit?usp=sharing) is a standard (+ [markup](https://docs.google.com/document/d/1UZRfOE1JAOhsnSmp-RmL2hY7KPJbpBImKZVvPV4YJmA/edit?usp=sharing)) template you can use as a starting point.\\\\\\\\n\\\\\\\\nMarketing materials, presentations, and images can be attached as needed as external links. An easy way to do this is to start a discussion under the Proposals category on the Infrastructure Working Group GitHub repository [here](https://github.com/near/Infrastructure-Working-Group/discussions/categories/proposals), publish, edit the post, and finally copy the links generated for the files you uploaded.\\\\\\\\n\\\\\\\\n### Proposal Submission Dates\\\\\\\\n\\\\\\\\nThe deadline for proposal submission is **Tuesday, October 8th** (giving applicants approximately two weeks), with a Q&A period on the proposal itself.\\\\\\\\n\\\\\\\\n### Selection Process\\\\\\\\n\\\\\\\\nAfter reviewing the proposals, the committee will vote on the best one. Generally, this process takes two working weeks to complete and will be discussed and voted on at the regular bi-weekly meeting.\\\\\\\\n\\\\\\\\n### Voting Dates\\\\\\\\n\\\\\\\\nThe estimate for voting completion is **two weeks** after the proposal submission date.\\\\\\\\n\\\\\\\\n### Transition Process\\\\\\\\n\\\\\\\\nThe estimated transition time is one week, not considering any KYC or KYB blockers.  \\\\\\\\n\\\\\\\\n### Funding Process\\\\\\\\n\\\\\\\\nThe Infrastructure Committee governs funding with assistance from the NEAR Foundation. If selected, your proposal enters the funding pipeline. You are required to:\\\\\\\\n\\\\\\\\n* Complete the KYC/B process conducted by the NEAR Foundation, including verification by IDVerify.\\\\\\\\n* Sign a legal agreement regarding the work as outlined in the proposal conducted by the NEAR Foundation.\\\\\\\\n* Submit an invoice to NEAR Foundation Finance outlining how you want funds disbursed, to what wallets or banks, and in the agreed-upon amounts.\\\\\\\\n* Complete a test transaction to verify target wallets (when requesting funds in cryptocurrency).\\\\\\\\n\\\\\\\\n### Funding Dates\\\\\\\\n\\\\\\\\nThe funding process is generally completed in one working week if the proposal does not require clarifications in the budget, work approach, legal agreement, or invoicing terms.\\\\\\\\n\\\\\\\\n### Communication\\\\\\\\n\\\\\\\\nPlease direct all communications to the thread where the RFP started beneath the submitted proposal. Please direct confidential or sensitive communications to the Telegram group set up between the committee and the organization/entity/team. If you don\\\\\\\\\\\\'t have a private Telegram group between your team and the Infrastructure Committee, please request one in this thread.\\\\\\\\n\", \"block_height\": \"128795443\", \"linked_proposals\": [], \"rfp_body_version\": \"V0\", \"submission_deadline\": \"1728345600000000000\"}, \"author_id\": \"trechriron71.near\", \"snapshot_history\": [], \"social_db_post_block_height\": \"0\"}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 2.1213082113328e+21
    }
  },
  {
    "id": "8623968930",
    "receipt_id": "FPKcKcqGRd2N7n9BHk6PdU6H6kc8Rf4SDMKjmrcz2pnd",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "social.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "9LEgAyrArVY2Q9yXbgpBysZBfzpRkSGqcHKgYV6MRfUG",
      "block_height": 128795444,
      "block_timestamp": 1727187286073833200
    },
    "receipt_outcome": {
      "gas_burnt": 3880430431745,
      "tokens_burnt": 388043043174500000000,
      "executor_account_id": "social.near",
      "status": true
    },
    "transaction_hash": "3zVj2A7zNwRH4oU3bqhW269Wutiq7z29Qk9t5xJsSg5C",
    "included_in_block_hash": "CoHCuQqaxLi8gjKRRADSxqjTAcwWuBYLRdPsxS1wgGsf",
    "block_timestamp": "1727187283477809533",
    "block": {
      "block_height": 128795442
    },
    "receipt_conversion_tokens_burnt": "84931734896500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set",
        "deposit": 0,
        "fee": 388043043174500000000,
        "args": "{\"data\": {\"infrastructure-committee.near\": {\"index\": {\"notify\": \"[{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"woben.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":3,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"flmel.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":3,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"as2.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":3,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"mob.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":3,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"trechriron71.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":3,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"theori.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":3,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"polyprogrammist.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":3,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"frol.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":3,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"pivortex.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":3,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"megha19.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":3,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"petersalomonsen.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":3,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":3,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"eric3.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":3,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}}]\"}}}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 2.1213082113328e+21
    }
  },
  {
    "id": "8624018711",
    "receipt_id": "F5GTUp2Pk2927cZZn8UQj2pQHpf1NdnWJsZptwRNBtV7",
    "predecessor_account_id": "trechriron71.near",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "62oPhkgV8qqzMnpECFDJzrbw2mFboSYcxeAV8zb4EH9s",
      "block_height": 128795554,
      "block_timestamp": 1727187428363488000
    },
    "receipt_outcome": {
      "gas_burnt": 8079895559267,
      "tokens_burnt": 807989555926700000000,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "7dpDdCnzmUJh3gKvtNnwEX3KEQq3SRPAFed6LBWoA9p3",
    "included_in_block_hash": "E49mXGGKyiFwfTBZFgv1Uo8QyBYQwdC3CfnJeYzfjg6C",
    "block_timestamp": "1727187427048139761",
    "block": {
      "block_height": 128795553
    },
    "receipt_conversion_tokens_burnt": "105917337868000000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "add_rfp",
        "deposit": 0,
        "fee": 807989555926700000000,
        "args": "{\"body\": {\"name\": \"BigQuery and Data Pipelines\", \"summary\": \"As [Pagoda winds down its services](https://docs.near.org/blog/2024-08-13-pagoda-services), it needs to transition the management and development of the [BigQuery Dataset](https://docs.near.org/build/data-infrastructure/big-query) and Avro Dataset needed for [Dune Analytics integration](https://docs.google.com/document/d/1DdPZy_wGdcxUYERX-k1UIzWik-JBR93RPJ4V_0xF1Ek/edit) to a capable service provider. \", \"timeline\": {\"status\": \"ACCEPTING_SUBMISSIONS\"}, \"description\": \"## Overview\\\\\\\\n\\\\\\\\nAs [Pagoda winds down its services](https://docs.near.org/blog/2024-08-13-pagoda-services), it needs to transition the management and development of the [BigQuery Dataset](https://docs.near.org/build/data-infrastructure/big-query) and Avro Dataset needed for [Dune Analytics integration](https://docs.google.com/document/d/1DdPZy_wGdcxUYERX-k1UIzWik-JBR93RPJ4V_0xF1Ek/edit) to a capable service provider. This infrastructure is crucial for providing instant insights into historical on-chain data, enabling cost-effective analysis and easy access to blockchain data through SQL queries.\\\\\\\\n\\\\\\\\nThe transition aims to ensure uninterrupted service and continued improvement of this vital data infrastructure, which is essential for various stakeholders in the NEAR ecosystem. It is currently implemented through three Databricks pipelines: the Core, the BigQuery exporter, and the Avro exporter. In this document, we refer to them as \\\\\\\\u{201c}Data Pipelines.\\\\\\\\u{201d}\\\\\\\\n\\\\\\\\n## Background On Data Pipelines\\\\\\\\n\\\\\\\\nBigQuery is blockchain data indexing in [NEAR Public Lakehouse](https://docs.near.org/concepts/advanced/near-lake-framework) for anyone who wants to understand blockchain data:\\\\\\\\n\\\\\\\\n* Users can create queries to track NEAR assets, monitor transactions, or analyze on-chain events at a massive scale.\\\\\\\\n* Researchers can use indexed data for data science tasks, including on-chain activities, identifying trends, or feeding AI/ML pipelines for predictive analysis.\\\\\\\\n* Startups can use NEAR\\\\\\\\\\\\'s indexed data for deep insights on user engagement, smart contract utilization, or insights across tokens and NFT adoption.\\\\\\\\n\\\\\\\\nBenefits:\\\\\\\\n\\\\\\\\n* Near instant insights: Historical on-chain data queried at scale.\\\\\\\\n* Cost-effective: Eliminate the need to store and process bulk NEAR protocol data; query as little or as much data as preferred.\\\\\\\\n* Easy to use: No prior experience with blockchain technology is required; bring a general knowledge of SQL to unlock insights.\\\\\\\\n\\\\\\\\nAvro pipeline for Dune Analytics.\\\\\\\\n\\\\\\\\n* Dune is one of the most popular blockchain analytics tools where the community analyzes and shares data from EVM and non-EVM chains. For example, Ethereum, Bitcoin, Polygon, BNB Chain, Solana, Avalanche, Optimism, and many others are available on their platform. The chains offer their datasets/tables in 3 categories:\\\\\\\\n  * Raw (Bronze),\\\\\\\\n  * Decoded (Silver), and\\\\\\\\n  * Curated (Gold).\\\\\\\\n\\\\\\\\n    With this integration, we expect to improve NEAR data accessibility by leveraging our Lakehouse.\\\\\\\\n\\\\\\\\n* In the Dune integration, we create incremental (append-only) hourly batches of data up to nine tables. We want to model high-value tables based on the most common community use cases/queries and partition them accordingly to best performance.\\\\\\\\n\\\\\\\\n## Requirements\\\\\\\\n\\\\\\\\n### Technical Requirements\\\\\\\\n\\\\\\\\nThe current infrastructure uses Google Cloud Platform (GCP) for BigQuery. While we are open to proposals for alternative cloud providers, any migration must be justified with clear benefits. The existing tech stack includes Databricks and Delta Live Tables. Proposals should specify how they intend to replace, maintain, or improve upon this architecture.\\\\\\\\n\\\\\\\\nCurrently, data is loaded in a streaming fashion using [Databricks Autoloader](https://docs.gcp.databricks.com/ingestion/auto-loader/index.html) into raw/bronze tables and transformed with [Databricks Delta Live Tables](https://www.databricks.com/product/delta-live-tables) streaming jobs into cleaned/enriched/silver tables. The silver tables are also copied into the [GCP BigQuery Public Dataset](https://cloud.google.com/bigquery/public-data).\\\\\\\\n\\\\\\\\nIn addition to regular chain indexing, we extract data from RPC function calls from the validators to collect staked rewards, lockup amounts, etc. The ReadRPC / RPC call volume is small as of now, but we expect the API and compute costs to grow with the growth of wallets in the NEAR ecosystem.\\\\\\\\n\\\\\\\\n#### BigQuery Diagram\\\\\\\\n\\\\\\\\n![big_query_image_1](https://github.com/user-attachments/assets/3a22a942-0901-4dc2-aefa-8ee21eb264b9 \\\\\\\\\\\\\\\"image_tooltip\\\\\\\\\\\\\\\")\\\\\\\\n\\\\\\\\n#### Avro Diagram\\\\\\\\n\\\\\\\\n![big_query_image_2](https://github.com/user-attachments/assets/2b962e90-078f-4a12-ab30-932250d4568e \\\\\\\\\\\\\\\"image_tooltip\\\\\\\\\\\\\\\")\\\\\\\\n\\\\\\\\nThe code is open-source and can be found here:\\\\\\\\n\\\\\\\\n* For a whole notebook on data processing and transformations, [https://github.com/near/near-public-lakehouse/tree/main/src/lakehouse/notebooks](https://github.com/near/near-public-lakehouse/tree/main/src/lakehouse/notebooks)\\\\\\\\n* The table structure with the dictionary can be found in the BQ dataset [https://console.cloud.google.com/bigquery?p=bigquery-public-data&d=crypto_near_mainnet_us&page=dataset](https://console.cloud.google.com/bigquery?p=bigquery-public-data&d=crypto_near_mainnet_us&page=dataset)\\\\\\\\n* The code where we add the data dictionary [https://github.com/near/near-public-lakehouse/blob/main/src/lakehouse/notebooks/BQ%20Writer%20Views%20%26%20Data%20Dictionary.py](https://github.com/near/near-public-lakehouse/blob/main/src/lakehouse/notebooks/BQ%20Writer%20Views%20%26%20Data%20Dictionary.py)\\\\\\\\n\\\\\\\\n#### NEAR Specific Challenges\\\\\\\\n\\\\\\\\nStay current with relevant NEAR Protocol upgrades, NEP (NEAR Enhancement Proposals), and events emitted standards.\\\\\\\\n\\\\\\\\n#### Performance Metrics\\\\\\\\n\\\\\\\\n* Data freshness: 99% monthly.\\\\\\\\n* For BigQuery and Avro datasets, the minimum lag from a final block is within 2 hours for all tables.\\\\\\\\n\\\\\\\\n#### Cost Optimization\\\\\\\\n\\\\\\\\nProposals should include strategies for ongoing cost optimization:\\\\\\\\n\\\\\\\\n* Quarterly review of query patterns to optimize data structure.\\\\\\\\n* Implementation of data partitioning and clustering for improved query performance and automatic archiving of infrequently accessed historical data.\\\\\\\\n* Recommendations for cost-effective querying practices for users.\\\\\\\\n\\\\\\\\n#### Gradual Transition Plan\\\\\\\\n\\\\\\\\nProposals must include a gradual transition plan that minimizes risk:\\\\\\\\n\\\\\\\\n* Parallel run of old and new systems for at least two weeks\\\\\\\\n* Phased migration of users to the new system\\\\\\\\n* Clear rollback and backup procedures in case of unforeseen issues\\\\\\\\n* Comprehensive testing plan, including load testing and edge cases\\\\\\\\n\\\\\\\\n#### Security & Compliance\\\\\\\\n\\\\\\\\nThe solution must adhere to the following security and compliance standards:\\\\\\\\n\\\\\\\\n* Encryption of data at rest and in transit\\\\\\\\n* Multi-factor authentication for administrative access\\\\\\\\n* Vendors must provide a detailed disaster recovery and business continuity plan, including regular backup procedures and a strategy for quick service restoration in case of major outages.\\\\\\\\n\\\\\\\\n#### Monitoring, Alerting, Reporting\\\\\\\\n\\\\\\\\n* \\\\\\\\u{200b}\\\\\\\\u{200b}Real-time monitoring of system health and performance with a public forward-facing [status](https://cloud.google.com/bigquery/docs/reference/auditlogs/rest/Shared.Types/Status) page *(current time \\\\\\\\u{2013} last written timestamp &lt; 2 hours)*\\\\\\\\n* Alerts for data inconsistencies or indexing delays and public channels & direct communication with major stakeholders using service\\\\\\\\n* Internal Dashboard for visualizing system metrics\\\\\\\\n* Weekly progress reports during the **transition phase** to the Infrastructure committee asynchronously\\\\\\\\n* Quarterly performance and progress reports\\\\\\\\n\\\\\\\\n#### Documentation\\\\\\\\n\\\\\\\\nAs part of this transition, maintenance, and proposals, please include\\\\\\\\n\\\\\\\\n* Comprehensive system architecture documentation\\\\\\\\n* API documentation, including usage examples (preferred video tutorials for new users). Communication/PRs with NEAR DevRel will be added to the official NEAR Docs.\\\\\\\\n* User guide for common queries and use cases\\\\\\\\n\\\\\\\\n### Usage Statistics\\\\\\\\n\\\\\\\\nThe dataset has accumulated since NEAR Protocol\\\\\\\\\\\\'s mainnet launch in October 2020. The current image size is around 40TB, growing at approximately 4TB monthly. There is no current data retention policy. Proposals should include strategies for data management, including potential archiving solutions for historical data older than two years.\\\\\\\\n\\\\\\\\n[Nansen](https://www.nansen.ai/), [NEAR Foundation](https://near.foundation/), [SWEAT](https://sweat.com/), [Dune Analytics](https://dune.com/), and NEAR NDC are stakeholders using BigQuery and Avro pipelines.\\\\\\\\n\\\\\\\\n## Transition Steps\\\\\\\\n\\\\\\\\n1. Review and understand the current BigQuery Dataset infrastructure and processes.\\\\\\\\n2. Include a detailed transition plan in your milestones (deadline Feb 25 transition from Pagoda Continuity team)\\\\\\\\n3. Set up necessary access and permissions for the new team.\\\\\\\\n4. Conduct knowledge transfer sessions with the current Pagoda team.\\\\\\\\n5. Implement and test any necessary changes or improvements to the infrastructure.\\\\\\\\n6. Perform thorough testing to ensure data integrity and system performance.\\\\\\\\n7. Update all relevant documentation.\\\\\\\\n8. Gradually transition operational responsibilities.\\\\\\\\n9. Establish new support channels and processes.\\\\\\\\n10. Conduct a final review and handover with the Infrastructure Committee.\\\\\\\\n11. Conduct official communications on your channels and with the NEAR Developer ecosystems and relevant stakeholders.\\\\\\\\n\\\\\\\\n## Service Level Agreements\\\\\\\\n\\\\\\\\n1. **Availability**\\\\\\\\n    * **Uptime Guarantee**: 99.0% monthly uptime\\\\\\\\n    * **Downtime Allowance**: Up to .01% of downtime per month\\\\\\\\n\\\\\\\\n2. **Support**\\\\\\\\n    * **Support Availability**: Community-based support only (e.g., through forums, GitHub issues, or a developer community Slack/Telegram/Discord channel)\\\\\\\\n    * **Response Time**: No guaranteed response time, but best-effort responses within 24-48 hours\\\\\\\\n\\\\\\\\n3. **Data Integrity**\\\\\\\\n    * **Data Consistency**: Zero community reports on missing data are expected. The missing data should be backfilled as a blocking priority, and a public incident report should be published.\\\\\\\\n\\\\\\\\n4. **Updates and Changes**\\\\\\\\n    * **Notice for Breaking Changes**: At least seven days\\\\\\\\\\\\' notice for any breaking changes in the API or infrastructure\\\\\\\\n\\\\\\\\n5. **Limitations**\\\\\\\\n    * **No SLA Credits**: No financial credits or compensation for outages or performance issues.\\\\\\\\n    * **Fair Use Policy**: Provide Explicit statements about the intended use for development and the prohibition of production workloads\\\\\\\\n\\\\\\\\n6. **Termination Rights**: The right to suspend or terminate the service for users who exceed fair use or misuse the service. IC must be informed about these.\\\\\\\\n\\\\\\\\n## Required Experience\\\\\\\\n\\\\\\\\n* **Experience:** Proven experience in big data processing, cloud infrastructure management, and blockchain data indexing, preferably within the blockchain or fintech sectors. Experience working with NEAR Protocol is a plus.\\\\\\\\n* **Portfolio:** Examples of previous work and case studies demonstrating success in similar projects.\\\\\\\\n* **Team:** A skilled team comprising developers, data engineers, and support staff with relevant experience.\\\\\\\\n* **Relevant Business:** Your team has an existing business that would motivate you to continue building this infrastructure.\\\\\\\\n\\\\\\\\n## Budget Guidelines\\\\\\\\n\\\\\\\\n### Budget\\\\\\\\n\\\\\\\\nProposals should outline a detailed budget with a clear breakdown of costs, including development, testing, documentation, maintenance and support, infrastructure, third-party services, and external API costs. Maintenance costs should be calculated accurately based on provided usage information and existing software costs. Properly assessing a budget based on usage is a significant factor in qualifying legitimate entities.\\\\\\\\n\\\\\\\\n### Milestones\\\\\\\\n\\\\\\\\nPlease highlight the details of the various milestones in your development plan and the relevant budgets attached to each milestone. Any metrics around the milestone\\\\\\\\\\\\'s success (acceptance criterion) should also be included. Milestone examples include signing the agreement, the official transition, a 6-month or 12-month billing period, etc.\\\\\\\\n\\\\\\\\n### Contingency\\\\\\\\n\\\\\\\\nInclude a contingency plan for potential overruns or unexpected expenses. Suppose expenses for providing free services or public goods to the NEAR ecosystem exceed previous budgets. In that case, a clear policy should be to report expenses incurred by NEAR usage to cover additional costs and prove that costs exceeded previous budgets.\\\\\\\\n\\\\\\\\n## Resources\\\\\\\\n\\\\\\\\nBig Query Documentation: [https://docs.near.org/build/data-infrastructure/big-query](https://docs.near.org/build/data-infrastructure/big-query)\\\\\\\\n\\\\\\\\nRelated Infrastructure (Data Platform RFPs) - We recommend that the same vendor bid for NEAR Lake-related infrastructure;\\\\\\\\n\\\\\\\\n* {Link to NEAR Lake RFP}\\\\\\\\n* {Link to KitWallet API RFP}\\\\\\\\n\\\\\\\\n## Process\\\\\\\\n\\\\\\\\n[//]: # (Boilerplate)\\\\\\\\n\\\\\\\\n**[Proposal Process](https://docs.google.com/document/d/1F7iAT9tWngik9JPS_GadCCEB5nZtA2AiL2yWZoBGMFM/pub)**\\\\\\\\n\\\\\\\\nYou should submit a proposal in response to this RFP on the Infrastructure Committee Portal. [Here](https://docs.google.com/document/d/1TVvPXPJhZfaFwfA2UMW6c3pO2kis45SJ1Np1XOkkhnA/edit?usp=sharing) is a standard (+ [markup](https://docs.google.com/document/d/1UZRfOE1JAOhsnSmp-RmL2hY7KPJbpBImKZVvPV4YJmA/edit?usp=sharing)) template you can use as a starting point.\\\\\\\\n\\\\\\\\nMarketing materials, presentations, and images can be attached as needed as external links. An easy way to do this is to start a discussion under the Proposals category on the Infrastructure Working Group GitHub repository [here](https://github.com/near/Infrastructure-Working-Group/discussions/categories/proposals), publish, edit the post, and finally copy the links generated for the files you uploaded.\\\\\\\\n\\\\\\\\n### Proposal Submission Dates\\\\\\\\n\\\\\\\\nThe deadline for proposal submission is **Tuesday, October 8th** (giving applicants approximately two weeks), with a Q&A period on the proposal itself.\\\\\\\\n\\\\\\\\n### Selection Process\\\\\\\\n\\\\\\\\nAfter reviewing the proposals, the committee will vote on the best one. Generally, this process takes two working weeks to complete and will be discussed and voted on at the regular bi-weekly meeting.\\\\\\\\n\\\\\\\\n### Voting Dates\\\\\\\\n\\\\\\\\nThe estimate for voting completion is **two weeks** after the proposal submission date.\\\\\\\\n\\\\\\\\n### Transition Process\\\\\\\\n\\\\\\\\nThe estimated transition time is one week, not considering any KYC or KYB blockers.  \\\\\\\\n\\\\\\\\n### Funding Process\\\\\\\\n\\\\\\\\nThe Infrastructure Committee governs funding with assistance from the NEAR Foundation. If selected, your proposal enters the funding pipeline. You are required to:\\\\\\\\n\\\\\\\\n* Complete the KYC/B process conducted by the NEAR Foundation, including verification by IDVerify.\\\\\\\\n* Sign a legal agreement regarding the work as outlined in the proposal conducted by the NEAR Foundation.\\\\\\\\n* Submit an invoice to NEAR Foundation Finance outlining how you want funds disbursed, to what wallets or banks, and in the agreed-upon amounts.\\\\\\\\n* Complete a test transaction to verify target wallets (when requesting funds in cryptocurrency).\\\\\\\\n\\\\\\\\n### Funding Dates\\\\\\\\n\\\\\\\\nThe funding process is generally completed in one working week if the proposal does not require clarifications in the budget, work approach, legal agreement, or invoicing terms.\\\\\\\\n\\\\\\\\n### Communication\\\\\\\\n\\\\\\\\nPlease direct all communications to the thread where the RFP started beneath the submitted proposal. Please direct confidential or sensitive communications to the Telegram group set up between the committee and the organization/entity/team. If you don\\\\\\\\\\\\'t have a private Telegram group between your team and the Infrastructure Committee, please request one in this thread.\\\\\\\\n\", \"rfp_body_version\": \"V0\", \"submission_deadline\": \"1728345600000000000\"}, \"labels\": [\"Query API\"]}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 2.202690821416e+21
    }
  },
  {
    "id": "8624020220",
    "receipt_id": "J9pBn4S1oAG9Z4qVHpEfBzva8mFkSH7bHZKbUFMQhc7S",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "social.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "2czUXpREzEbiL36AbciD5BPgArgR2H7ajeF7fMDVcYsh",
      "block_height": 128795555,
      "block_timestamp": 1727187429633470500
    },
    "receipt_outcome": {
      "gas_burnt": 4510677448220,
      "tokens_burnt": 451067744822000000000,
      "executor_account_id": "social.near",
      "status": true
    },
    "transaction_hash": "7dpDdCnzmUJh3gKvtNnwEX3KEQq3SRPAFed6LBWoA9p3",
    "included_in_block_hash": "E49mXGGKyiFwfTBZFgv1Uo8QyBYQwdC3CfnJeYzfjg6C",
    "block_timestamp": "1727187427048139761",
    "block": {
      "block_height": 128795553
    },
    "receipt_conversion_tokens_burnt": "105917337868000000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set",
        "deposit": 0,
        "fee": 451067744822000000000,
        "args": "{\"data\": {\"infrastructure-committee.near\": {\"post\": {\"main\": \"{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"md\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"text\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"A new Request for Proposals is published.\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\n\\\\\\\\u{2014}\\\\\\\\u{2014}\\\\\\\\u{2014}\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\n**Title**: \\\\\\\\u{201c}BigQuery and Data Pipelines\\\\\\\\u{201c}\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\n**Summary**:\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\nAs [Pagoda winds down its services](https://docs.near.org/blog/2024-08-13-pagoda-services), it needs to transition the management and development of the [BigQuery Dataset](https://docs.near.org/build/data-infrastructure/big-query) and Avro Dataset needed for [Dune Analytics integration](https://docs.google.com/document/d/1DdPZy_wGdcxUYERX-k1UIzWik-JBR93RPJ4V_0xF1Ek/edit) to a capable service provider. \\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\n\\\\\\\\u{2014}\\\\\\\\u{2014}\\\\\\\\u{2014}\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\nRead the full RFP and participate [here](/devhub.near/widget/app?page=rfp&id=4)\\\\\\\\\\\\\\\"}\"}, \"index\": {\"post\": \"{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"main\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"md\\\\\\\\\\\\\\\"}}\"}}}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 2.202690821416e+21
    }
  },
  {
    "id": "8624020223",
    "receipt_id": "5nGdmLhjCAvNgUWVdmi7GhxEHgLJCS43Xw2KiabGtvk5",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "2czUXpREzEbiL36AbciD5BPgArgR2H7ajeF7fMDVcYsh",
      "block_height": 128795555,
      "block_timestamp": 1727187429633470500
    },
    "receipt_outcome": {
      "gas_burnt": 4497031702188,
      "tokens_burnt": 449703170218800000000,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "7dpDdCnzmUJh3gKvtNnwEX3KEQq3SRPAFed6LBWoA9p3",
    "included_in_block_hash": "E49mXGGKyiFwfTBZFgv1Uo8QyBYQwdC3CfnJeYzfjg6C",
    "block_timestamp": "1727187427048139761",
    "block": {
      "block_height": 128795553
    },
    "receipt_conversion_tokens_burnt": "105917337868000000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set_rfp_block_height_callback",
        "deposit": 0,
        "fee": 449703170218800000000,
        "args": "{\"rfp\": {\"id\": 4, \"snapshot\": {\"name\": \"BigQuery and Data Pipelines\", \"labels\": [\"Query API\"], \"summary\": \"As [Pagoda winds down its services](https://docs.near.org/blog/2024-08-13-pagoda-services), it needs to transition the management and development of the [BigQuery Dataset](https://docs.near.org/build/data-infrastructure/big-query) and Avro Dataset needed for [Dune Analytics integration](https://docs.google.com/document/d/1DdPZy_wGdcxUYERX-k1UIzWik-JBR93RPJ4V_0xF1Ek/edit) to a capable service provider. \", \"timeline\": {\"status\": \"ACCEPTING_SUBMISSIONS\"}, \"editor_id\": \"trechriron71.near\", \"timestamp\": \"1727187428363487962\", \"description\": \"## Overview\\\\\\\\n\\\\\\\\nAs [Pagoda winds down its services](https://docs.near.org/blog/2024-08-13-pagoda-services), it needs to transition the management and development of the [BigQuery Dataset](https://docs.near.org/build/data-infrastructure/big-query) and Avro Dataset needed for [Dune Analytics integration](https://docs.google.com/document/d/1DdPZy_wGdcxUYERX-k1UIzWik-JBR93RPJ4V_0xF1Ek/edit) to a capable service provider. This infrastructure is crucial for providing instant insights into historical on-chain data, enabling cost-effective analysis and easy access to blockchain data through SQL queries.\\\\\\\\n\\\\\\\\nThe transition aims to ensure uninterrupted service and continued improvement of this vital data infrastructure, which is essential for various stakeholders in the NEAR ecosystem. It is currently implemented through three Databricks pipelines: the Core, the BigQuery exporter, and the Avro exporter. In this document, we refer to them as \\\\\\\\u{201c}Data Pipelines.\\\\\\\\u{201d}\\\\\\\\n\\\\\\\\n## Background On Data Pipelines\\\\\\\\n\\\\\\\\nBigQuery is blockchain data indexing in [NEAR Public Lakehouse](https://docs.near.org/concepts/advanced/near-lake-framework) for anyone who wants to understand blockchain data:\\\\\\\\n\\\\\\\\n* Users can create queries to track NEAR assets, monitor transactions, or analyze on-chain events at a massive scale.\\\\\\\\n* Researchers can use indexed data for data science tasks, including on-chain activities, identifying trends, or feeding AI/ML pipelines for predictive analysis.\\\\\\\\n* Startups can use NEAR\\\\\\\\\\\\'s indexed data for deep insights on user engagement, smart contract utilization, or insights across tokens and NFT adoption.\\\\\\\\n\\\\\\\\nBenefits:\\\\\\\\n\\\\\\\\n* Near instant insights: Historical on-chain data queried at scale.\\\\\\\\n* Cost-effective: Eliminate the need to store and process bulk NEAR protocol data; query as little or as much data as preferred.\\\\\\\\n* Easy to use: No prior experience with blockchain technology is required; bring a general knowledge of SQL to unlock insights.\\\\\\\\n\\\\\\\\nAvro pipeline for Dune Analytics.\\\\\\\\n\\\\\\\\n* Dune is one of the most popular blockchain analytics tools where the community analyzes and shares data from EVM and non-EVM chains. For example, Ethereum, Bitcoin, Polygon, BNB Chain, Solana, Avalanche, Optimism, and many others are available on their platform. The chains offer their datasets/tables in 3 categories:\\\\\\\\n  * Raw (Bronze),\\\\\\\\n  * Decoded (Silver), and\\\\\\\\n  * Curated (Gold).\\\\\\\\n\\\\\\\\n    With this integration, we expect to improve NEAR data accessibility by leveraging our Lakehouse.\\\\\\\\n\\\\\\\\n* In the Dune integration, we create incremental (append-only) hourly batches of data up to nine tables. We want to model high-value tables based on the most common community use cases/queries and partition them accordingly to best performance.\\\\\\\\n\\\\\\\\n## Requirements\\\\\\\\n\\\\\\\\n### Technical Requirements\\\\\\\\n\\\\\\\\nThe current infrastructure uses Google Cloud Platform (GCP) for BigQuery. While we are open to proposals for alternative cloud providers, any migration must be justified with clear benefits. The existing tech stack includes Databricks and Delta Live Tables. Proposals should specify how they intend to replace, maintain, or improve upon this architecture.\\\\\\\\n\\\\\\\\nCurrently, data is loaded in a streaming fashion using [Databricks Autoloader](https://docs.gcp.databricks.com/ingestion/auto-loader/index.html) into raw/bronze tables and transformed with [Databricks Delta Live Tables](https://www.databricks.com/product/delta-live-tables) streaming jobs into cleaned/enriched/silver tables. The silver tables are also copied into the [GCP BigQuery Public Dataset](https://cloud.google.com/bigquery/public-data).\\\\\\\\n\\\\\\\\nIn addition to regular chain indexing, we extract data from RPC function calls from the validators to collect staked rewards, lockup amounts, etc. The ReadRPC / RPC call volume is small as of now, but we expect the API and compute costs to grow with the growth of wallets in the NEAR ecosystem.\\\\\\\\n\\\\\\\\n#### BigQuery Diagram\\\\\\\\n\\\\\\\\n![big_query_image_1](https://github.com/user-attachments/assets/3a22a942-0901-4dc2-aefa-8ee21eb264b9 \\\\\\\\\\\\\\\"image_tooltip\\\\\\\\\\\\\\\")\\\\\\\\n\\\\\\\\n#### Avro Diagram\\\\\\\\n\\\\\\\\n![big_query_image_2](https://github.com/user-attachments/assets/2b962e90-078f-4a12-ab30-932250d4568e \\\\\\\\\\\\\\\"image_tooltip\\\\\\\\\\\\\\\")\\\\\\\\n\\\\\\\\nThe code is open-source and can be found here:\\\\\\\\n\\\\\\\\n* For a whole notebook on data processing and transformations, [https://github.com/near/near-public-lakehouse/tree/main/src/lakehouse/notebooks](https://github.com/near/near-public-lakehouse/tree/main/src/lakehouse/notebooks)\\\\\\\\n* The table structure with the dictionary can be found in the BQ dataset [https://console.cloud.google.com/bigquery?p=bigquery-public-data&d=crypto_near_mainnet_us&page=dataset](https://console.cloud.google.com/bigquery?p=bigquery-public-data&d=crypto_near_mainnet_us&page=dataset)\\\\\\\\n* The code where we add the data dictionary [https://github.com/near/near-public-lakehouse/blob/main/src/lakehouse/notebooks/BQ%20Writer%20Views%20%26%20Data%20Dictionary.py](https://github.com/near/near-public-lakehouse/blob/main/src/lakehouse/notebooks/BQ%20Writer%20Views%20%26%20Data%20Dictionary.py)\\\\\\\\n\\\\\\\\n#### NEAR Specific Challenges\\\\\\\\n\\\\\\\\nStay current with relevant NEAR Protocol upgrades, NEP (NEAR Enhancement Proposals), and events emitted standards.\\\\\\\\n\\\\\\\\n#### Performance Metrics\\\\\\\\n\\\\\\\\n* Data freshness: 99% monthly.\\\\\\\\n* For BigQuery and Avro datasets, the minimum lag from a final block is within 2 hours for all tables.\\\\\\\\n\\\\\\\\n#### Cost Optimization\\\\\\\\n\\\\\\\\nProposals should include strategies for ongoing cost optimization:\\\\\\\\n\\\\\\\\n* Quarterly review of query patterns to optimize data structure.\\\\\\\\n* Implementation of data partitioning and clustering for improved query performance and automatic archiving of infrequently accessed historical data.\\\\\\\\n* Recommendations for cost-effective querying practices for users.\\\\\\\\n\\\\\\\\n#### Gradual Transition Plan\\\\\\\\n\\\\\\\\nProposals must include a gradual transition plan that minimizes risk:\\\\\\\\n\\\\\\\\n* Parallel run of old and new systems for at least two weeks\\\\\\\\n* Phased migration of users to the new system\\\\\\\\n* Clear rollback and backup procedures in case of unforeseen issues\\\\\\\\n* Comprehensive testing plan, including load testing and edge cases\\\\\\\\n\\\\\\\\n#### Security & Compliance\\\\\\\\n\\\\\\\\nThe solution must adhere to the following security and compliance standards:\\\\\\\\n\\\\\\\\n* Encryption of data at rest and in transit\\\\\\\\n* Multi-factor authentication for administrative access\\\\\\\\n* Vendors must provide a detailed disaster recovery and business continuity plan, including regular backup procedures and a strategy for quick service restoration in case of major outages.\\\\\\\\n\\\\\\\\n#### Monitoring, Alerting, Reporting\\\\\\\\n\\\\\\\\n* \\\\\\\\u{200b}\\\\\\\\u{200b}Real-time monitoring of system health and performance with a public forward-facing [status](https://cloud.google.com/bigquery/docs/reference/auditlogs/rest/Shared.Types/Status) page *(current time \\\\\\\\u{2013} last written timestamp &lt; 2 hours)*\\\\\\\\n* Alerts for data inconsistencies or indexing delays and public channels & direct communication with major stakeholders using service\\\\\\\\n* Internal Dashboard for visualizing system metrics\\\\\\\\n* Weekly progress reports during the **transition phase** to the Infrastructure committee asynchronously\\\\\\\\n* Quarterly performance and progress reports\\\\\\\\n\\\\\\\\n#### Documentation\\\\\\\\n\\\\\\\\nAs part of this transition, maintenance, and proposals, please include\\\\\\\\n\\\\\\\\n* Comprehensive system architecture documentation\\\\\\\\n* API documentation, including usage examples (preferred video tutorials for new users). Communication/PRs with NEAR DevRel will be added to the official NEAR Docs.\\\\\\\\n* User guide for common queries and use cases\\\\\\\\n\\\\\\\\n### Usage Statistics\\\\\\\\n\\\\\\\\nThe dataset has accumulated since NEAR Protocol\\\\\\\\\\\\'s mainnet launch in October 2020. The current image size is around 40TB, growing at approximately 4TB monthly. There is no current data retention policy. Proposals should include strategies for data management, including potential archiving solutions for historical data older than two years.\\\\\\\\n\\\\\\\\n[Nansen](https://www.nansen.ai/), [NEAR Foundation](https://near.foundation/), [SWEAT](https://sweat.com/), [Dune Analytics](https://dune.com/), and NEAR NDC are stakeholders using BigQuery and Avro pipelines.\\\\\\\\n\\\\\\\\n## Transition Steps\\\\\\\\n\\\\\\\\n1. Review and understand the current BigQuery Dataset infrastructure and processes.\\\\\\\\n2. Include a detailed transition plan in your milestones (deadline Feb 25 transition from Pagoda Continuity team)\\\\\\\\n3. Set up necessary access and permissions for the new team.\\\\\\\\n4. Conduct knowledge transfer sessions with the current Pagoda team.\\\\\\\\n5. Implement and test any necessary changes or improvements to the infrastructure.\\\\\\\\n6. Perform thorough testing to ensure data integrity and system performance.\\\\\\\\n7. Update all relevant documentation.\\\\\\\\n8. Gradually transition operational responsibilities.\\\\\\\\n9. Establish new support channels and processes.\\\\\\\\n10. Conduct a final review and handover with the Infrastructure Committee.\\\\\\\\n11. Conduct official communications on your channels and with the NEAR Developer ecosystems and relevant stakeholders.\\\\\\\\n\\\\\\\\n## Service Level Agreements\\\\\\\\n\\\\\\\\n1. **Availability**\\\\\\\\n    * **Uptime Guarantee**: 99.0% monthly uptime\\\\\\\\n    * **Downtime Allowance**: Up to .01% of downtime per month\\\\\\\\n\\\\\\\\n2. **Support**\\\\\\\\n    * **Support Availability**: Community-based support only (e.g., through forums, GitHub issues, or a developer community Slack/Telegram/Discord channel)\\\\\\\\n    * **Response Time**: No guaranteed response time, but best-effort responses within 24-48 hours\\\\\\\\n\\\\\\\\n3. **Data Integrity**\\\\\\\\n    * **Data Consistency**: Zero community reports on missing data are expected. The missing data should be backfilled as a blocking priority, and a public incident report should be published.\\\\\\\\n\\\\\\\\n4. **Updates and Changes**\\\\\\\\n    * **Notice for Breaking Changes**: At least seven days\\\\\\\\\\\\' notice for any breaking changes in the API or infrastructure\\\\\\\\n\\\\\\\\n5. **Limitations**\\\\\\\\n    * **No SLA Credits**: No financial credits or compensation for outages or performance issues.\\\\\\\\n    * **Fair Use Policy**: Provide Explicit statements about the intended use for development and the prohibition of production workloads\\\\\\\\n\\\\\\\\n6. **Termination Rights**: The right to suspend or terminate the service for users who exceed fair use or misuse the service. IC must be informed about these.\\\\\\\\n\\\\\\\\n## Required Experience\\\\\\\\n\\\\\\\\n* **Experience:** Proven experience in big data processing, cloud infrastructure management, and blockchain data indexing, preferably within the blockchain or fintech sectors. Experience working with NEAR Protocol is a plus.\\\\\\\\n* **Portfolio:** Examples of previous work and case studies demonstrating success in similar projects.\\\\\\\\n* **Team:** A skilled team comprising developers, data engineers, and support staff with relevant experience.\\\\\\\\n* **Relevant Business:** Your team has an existing business that would motivate you to continue building this infrastructure.\\\\\\\\n\\\\\\\\n## Budget Guidelines\\\\\\\\n\\\\\\\\n### Budget\\\\\\\\n\\\\\\\\nProposals should outline a detailed budget with a clear breakdown of costs, including development, testing, documentation, maintenance and support, infrastructure, third-party services, and external API costs. Maintenance costs should be calculated accurately based on provided usage information and existing software costs. Properly assessing a budget based on usage is a significant factor in qualifying legitimate entities.\\\\\\\\n\\\\\\\\n### Milestones\\\\\\\\n\\\\\\\\nPlease highlight the details of the various milestones in your development plan and the relevant budgets attached to each milestone. Any metrics around the milestone\\\\\\\\\\\\'s success (acceptance criterion) should also be included. Milestone examples include signing the agreement, the official transition, a 6-month or 12-month billing period, etc.\\\\\\\\n\\\\\\\\n### Contingency\\\\\\\\n\\\\\\\\nInclude a contingency plan for potential overruns or unexpected expenses. Suppose expenses for providing free services or public goods to the NEAR ecosystem exceed previous budgets. In that case, a clear policy should be to report expenses incurred by NEAR usage to cover additional costs and prove that costs exceeded previous budgets.\\\\\\\\n\\\\\\\\n## Resources\\\\\\\\n\\\\\\\\nBig Query Documentation: [https://docs.near.org/build/data-infrastructure/big-query](https://docs.near.org/build/data-infrastructure/big-query)\\\\\\\\n\\\\\\\\nRelated Infrastructure (Data Platform RFPs) - We recommend that the same vendor bid for NEAR Lake-related infrastructure;\\\\\\\\n\\\\\\\\n* {Link to NEAR Lake RFP}\\\\\\\\n* {Link to KitWallet API RFP}\\\\\\\\n\\\\\\\\n## Process\\\\\\\\n\\\\\\\\n[//]: # (Boilerplate)\\\\\\\\n\\\\\\\\n**[Proposal Process](https://docs.google.com/document/d/1F7iAT9tWngik9JPS_GadCCEB5nZtA2AiL2yWZoBGMFM/pub)**\\\\\\\\n\\\\\\\\nYou should submit a proposal in response to this RFP on the Infrastructure Committee Portal. [Here](https://docs.google.com/document/d/1TVvPXPJhZfaFwfA2UMW6c3pO2kis45SJ1Np1XOkkhnA/edit?usp=sharing) is a standard (+ [markup](https://docs.google.com/document/d/1UZRfOE1JAOhsnSmp-RmL2hY7KPJbpBImKZVvPV4YJmA/edit?usp=sharing)) template you can use as a starting point.\\\\\\\\n\\\\\\\\nMarketing materials, presentations, and images can be attached as needed as external links. An easy way to do this is to start a discussion under the Proposals category on the Infrastructure Working Group GitHub repository [here](https://github.com/near/Infrastructure-Working-Group/discussions/categories/proposals), publish, edit the post, and finally copy the links generated for the files you uploaded.\\\\\\\\n\\\\\\\\n### Proposal Submission Dates\\\\\\\\n\\\\\\\\nThe deadline for proposal submission is **Tuesday, October 8th** (giving applicants approximately two weeks), with a Q&A period on the proposal itself.\\\\\\\\n\\\\\\\\n### Selection Process\\\\\\\\n\\\\\\\\nAfter reviewing the proposals, the committee will vote on the best one. Generally, this process takes two working weeks to complete and will be discussed and voted on at the regular bi-weekly meeting.\\\\\\\\n\\\\\\\\n### Voting Dates\\\\\\\\n\\\\\\\\nThe estimate for voting completion is **two weeks** after the proposal submission date.\\\\\\\\n\\\\\\\\n### Transition Process\\\\\\\\n\\\\\\\\nThe estimated transition time is one week, not considering any KYC or KYB blockers.  \\\\\\\\n\\\\\\\\n### Funding Process\\\\\\\\n\\\\\\\\nThe Infrastructure Committee governs funding with assistance from the NEAR Foundation. If selected, your proposal enters the funding pipeline. You are required to:\\\\\\\\n\\\\\\\\n* Complete the KYC/B process conducted by the NEAR Foundation, including verification by IDVerify.\\\\\\\\n* Sign a legal agreement regarding the work as outlined in the proposal conducted by the NEAR Foundation.\\\\\\\\n* Submit an invoice to NEAR Foundation Finance outlining how you want funds disbursed, to what wallets or banks, and in the agreed-upon amounts.\\\\\\\\n* Complete a test transaction to verify target wallets (when requesting funds in cryptocurrency).\\\\\\\\n\\\\\\\\n### Funding Dates\\\\\\\\n\\\\\\\\nThe funding process is generally completed in one working week if the proposal does not require clarifications in the budget, work approach, legal agreement, or invoicing terms.\\\\\\\\n\\\\\\\\n### Communication\\\\\\\\n\\\\\\\\nPlease direct all communications to the thread where the RFP started beneath the submitted proposal. Please direct confidential or sensitive communications to the Telegram group set up between the committee and the organization/entity/team. If you don\\\\\\\\\\\\'t have a private Telegram group between your team and the Infrastructure Committee, please request one in this thread.\\\\\\\\n\", \"block_height\": \"128795554\", \"linked_proposals\": [], \"rfp_body_version\": \"V0\", \"submission_deadline\": \"1728345600000000000\"}, \"author_id\": \"trechriron71.near\", \"snapshot_history\": [], \"social_db_post_block_height\": \"0\"}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 2.202690821416e+21
    }
  },
  {
    "id": "8624020225",
    "receipt_id": "EQkMXABGeHgfieU4UdAJKYKaNRBkRTH6Bosh2w7Hagi8",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "social.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "2czUXpREzEbiL36AbciD5BPgArgR2H7ajeF7fMDVcYsh",
      "block_height": 128795555,
      "block_timestamp": 1727187429633470500
    },
    "receipt_outcome": {
      "gas_burnt": 3880130125805,
      "tokens_burnt": 388013012580500000000,
      "executor_account_id": "social.near",
      "status": true
    },
    "transaction_hash": "7dpDdCnzmUJh3gKvtNnwEX3KEQq3SRPAFed6LBWoA9p3",
    "included_in_block_hash": "E49mXGGKyiFwfTBZFgv1Uo8QyBYQwdC3CfnJeYzfjg6C",
    "block_timestamp": "1727187427048139761",
    "block": {
      "block_height": 128795553
    },
    "receipt_conversion_tokens_burnt": "105917337868000000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set",
        "deposit": 0,
        "fee": 388013012580500000000,
        "args": "{\"data\": {\"infrastructure-committee.near\": {\"index\": {\"notify\": \"[{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"as2.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":4,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"trechriron71.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":4,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"frol.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":4,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"eric3.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":4,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"pivortex.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":4,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"polyprogrammist.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":4,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"mob.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":4,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"theori.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":4,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"megha19.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":4,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"flmel.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":4,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":4,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"woben.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":4,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"petersalomonsen.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":4,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}}]\"}}}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 2.202690821416e+21
    }
  },
  {
    "id": "8624066979",
    "receipt_id": "DTX3uzh8QCxsAoHKKDBCMRegqu1NQApFLbgaqszcuDHN",
    "predecessor_account_id": "trechriron71.near",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "CdN93PoMKxVNEHJodddxVkMy8NswNJoVXYQqnsDEFghd",
      "block_height": 128795619,
      "block_timestamp": 1727187514759045600
    },
    "receipt_outcome": {
      "gas_burnt": 7733356278905,
      "tokens_burnt": 773335627890500000000,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "FTMjwk3k7xRrQuyFRJHVL8dmsuyTtzJkwX2EuvV1J2WT",
    "included_in_block_hash": "CD87jRUDJXuDR1ppCpYNKBMB91jTLLF5Mn8pRbzuNrpE",
    "block_timestamp": "1727187513450658693",
    "block": {
      "block_height": 128795618
    },
    "receipt_conversion_tokens_burnt": "104973200311000000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "edit_rfp",
        "deposit": 0,
        "fee": 773335627890500000000,
        "args": "{\"id\": 4, \"body\": {\"name\": \"BigQuery and Data Pipelines\", \"summary\": \"As Pagoda winds down its services, it needs to transition the management and development of the BigQuery Dataset and Avro Dataset needed for Dune Analytics integration to a capable service provider. \", \"timeline\": {\"status\": \"ACCEPTING_SUBMISSIONS\"}, \"description\": \"## Overview\\\\\\\\n\\\\\\\\nAs [Pagoda winds down its services](https://docs.near.org/blog/2024-08-13-pagoda-services), it needs to transition the management and development of the [BigQuery Dataset](https://docs.near.org/build/data-infrastructure/big-query) and Avro Dataset needed for [Dune Analytics integration](https://docs.google.com/document/d/1DdPZy_wGdcxUYERX-k1UIzWik-JBR93RPJ4V_0xF1Ek/edit) to a capable service provider. This infrastructure is crucial for providing instant insights into historical on-chain data, enabling cost-effective analysis and easy access to blockchain data through SQL queries.\\\\\\\\n\\\\\\\\nThe transition aims to ensure uninterrupted service and continued improvement of this vital data infrastructure, which is essential for various stakeholders in the NEAR ecosystem. It is currently implemented through three Databricks pipelines: the Core, the BigQuery exporter, and the Avro exporter. In this document, we refer to them as \\\\\\\\u{201c}Data Pipelines.\\\\\\\\u{201d}\\\\\\\\n\\\\\\\\n## Background On Data Pipelines\\\\\\\\n\\\\\\\\nBigQuery is blockchain data indexing in [NEAR Public Lakehouse](https://docs.near.org/concepts/advanced/near-lake-framework) for anyone who wants to understand blockchain data:\\\\\\\\n\\\\\\\\n* Users can create queries to track NEAR assets, monitor transactions, or analyze on-chain events at a massive scale.\\\\\\\\n* Researchers can use indexed data for data science tasks, including on-chain activities, identifying trends, or feeding AI/ML pipelines for predictive analysis.\\\\\\\\n* Startups can use NEAR\\\\\\\\\\\\'s indexed data for deep insights on user engagement, smart contract utilization, or insights across tokens and NFT adoption.\\\\\\\\n\\\\\\\\nBenefits:\\\\\\\\n\\\\\\\\n* Near instant insights: Historical on-chain data queried at scale.\\\\\\\\n* Cost-effective: Eliminate the need to store and process bulk NEAR protocol data; query as little or as much data as preferred.\\\\\\\\n* Easy to use: No prior experience with blockchain technology is required; bring a general knowledge of SQL to unlock insights.\\\\\\\\n\\\\\\\\nAvro pipeline for Dune Analytics.\\\\\\\\n\\\\\\\\n* Dune is one of the most popular blockchain analytics tools where the community analyzes and shares data from EVM and non-EVM chains. For example, Ethereum, Bitcoin, Polygon, BNB Chain, Solana, Avalanche, Optimism, and many others are available on their platform. The chains offer their datasets/tables in 3 categories:\\\\\\\\n  * Raw (Bronze),\\\\\\\\n  * Decoded (Silver), and\\\\\\\\n  * Curated (Gold).\\\\\\\\n\\\\\\\\n    With this integration, we expect to improve NEAR data accessibility by leveraging our Lakehouse.\\\\\\\\n\\\\\\\\n* In the Dune integration, we create incremental (append-only) hourly batches of data up to nine tables. We want to model high-value tables based on the most common community use cases/queries and partition them accordingly to best performance.\\\\\\\\n\\\\\\\\n## Requirements\\\\\\\\n\\\\\\\\n### Technical Requirements\\\\\\\\n\\\\\\\\nThe current infrastructure uses Google Cloud Platform (GCP) for BigQuery. While we are open to proposals for alternative cloud providers, any migration must be justified with clear benefits. The existing tech stack includes Databricks and Delta Live Tables. Proposals should specify how they intend to replace, maintain, or improve upon this architecture.\\\\\\\\n\\\\\\\\nCurrently, data is loaded in a streaming fashion using [Databricks Autoloader](https://docs.gcp.databricks.com/ingestion/auto-loader/index.html) into raw/bronze tables and transformed with [Databricks Delta Live Tables](https://www.databricks.com/product/delta-live-tables) streaming jobs into cleaned/enriched/silver tables. The silver tables are also copied into the [GCP BigQuery Public Dataset](https://cloud.google.com/bigquery/public-data).\\\\\\\\n\\\\\\\\nIn addition to regular chain indexing, we extract data from RPC function calls from the validators to collect staked rewards, lockup amounts, etc. The ReadRPC / RPC call volume is small as of now, but we expect the API and compute costs to grow with the growth of wallets in the NEAR ecosystem.\\\\\\\\n\\\\\\\\n#### BigQuery Diagram\\\\\\\\n\\\\\\\\n![big_query_image_1](https://github.com/user-attachments/assets/3a22a942-0901-4dc2-aefa-8ee21eb264b9 \\\\\\\\\\\\\\\"image_tooltip\\\\\\\\\\\\\\\")\\\\\\\\n\\\\\\\\n#### Avro Diagram\\\\\\\\n\\\\\\\\n![big_query_image_2](https://github.com/user-attachments/assets/2b962e90-078f-4a12-ab30-932250d4568e \\\\\\\\\\\\\\\"image_tooltip\\\\\\\\\\\\\\\")\\\\\\\\n\\\\\\\\nThe code is open-source and can be found here:\\\\\\\\n\\\\\\\\n* For a whole notebook on data processing and transformations, [https://github.com/near/near-public-lakehouse/tree/main/src/lakehouse/notebooks](https://github.com/near/near-public-lakehouse/tree/main/src/lakehouse/notebooks)\\\\\\\\n* The table structure with the dictionary can be found in the BQ dataset [https://console.cloud.google.com/bigquery?p=bigquery-public-data&d=crypto_near_mainnet_us&page=dataset](https://console.cloud.google.com/bigquery?p=bigquery-public-data&d=crypto_near_mainnet_us&page=dataset)\\\\\\\\n* The code where we add the data dictionary [https://github.com/near/near-public-lakehouse/blob/main/src/lakehouse/notebooks/BQ%20Writer%20Views%20%26%20Data%20Dictionary.py](https://github.com/near/near-public-lakehouse/blob/main/src/lakehouse/notebooks/BQ%20Writer%20Views%20%26%20Data%20Dictionary.py)\\\\\\\\n\\\\\\\\n#### NEAR Specific Challenges\\\\\\\\n\\\\\\\\nStay current with relevant NEAR Protocol upgrades, NEP (NEAR Enhancement Proposals), and events emitted standards.\\\\\\\\n\\\\\\\\n#### Performance Metrics\\\\\\\\n\\\\\\\\n* Data freshness: 99% monthly.\\\\\\\\n* For BigQuery and Avro datasets, the minimum lag from a final block is within 2 hours for all tables.\\\\\\\\n\\\\\\\\n#### Cost Optimization\\\\\\\\n\\\\\\\\nProposals should include strategies for ongoing cost optimization:\\\\\\\\n\\\\\\\\n* Quarterly review of query patterns to optimize data structure.\\\\\\\\n* Implementation of data partitioning and clustering for improved query performance and automatic archiving of infrequently accessed historical data.\\\\\\\\n* Recommendations for cost-effective querying practices for users.\\\\\\\\n\\\\\\\\n#### Gradual Transition Plan\\\\\\\\n\\\\\\\\nProposals must include a gradual transition plan that minimizes risk:\\\\\\\\n\\\\\\\\n* Parallel run of old and new systems for at least two weeks\\\\\\\\n* Phased migration of users to the new system\\\\\\\\n* Clear rollback and backup procedures in case of unforeseen issues\\\\\\\\n* Comprehensive testing plan, including load testing and edge cases\\\\\\\\n\\\\\\\\n#### Security & Compliance\\\\\\\\n\\\\\\\\nThe solution must adhere to the following security and compliance standards:\\\\\\\\n\\\\\\\\n* Encryption of data at rest and in transit\\\\\\\\n* Multi-factor authentication for administrative access\\\\\\\\n* Vendors must provide a detailed disaster recovery and business continuity plan, including regular backup procedures and a strategy for quick service restoration in case of major outages.\\\\\\\\n\\\\\\\\n#### Monitoring, Alerting, Reporting\\\\\\\\n\\\\\\\\n* \\\\\\\\u{200b}\\\\\\\\u{200b}Real-time monitoring of system health and performance with a public forward-facing [status](https://cloud.google.com/bigquery/docs/reference/auditlogs/rest/Shared.Types/Status) page *(current time \\\\\\\\u{2013} last written timestamp &lt; 2 hours)*\\\\\\\\n* Alerts for data inconsistencies or indexing delays and public channels & direct communication with major stakeholders using service\\\\\\\\n* Internal Dashboard for visualizing system metrics\\\\\\\\n* Weekly progress reports during the **transition phase** to the Infrastructure committee asynchronously\\\\\\\\n* Quarterly performance and progress reports\\\\\\\\n\\\\\\\\n#### Documentation\\\\\\\\n\\\\\\\\nAs part of this transition, maintenance, and proposals, please include\\\\\\\\n\\\\\\\\n* Comprehensive system architecture documentation\\\\\\\\n* API documentation, including usage examples (preferred video tutorials for new users). Communication/PRs with NEAR DevRel will be added to the official NEAR Docs.\\\\\\\\n* User guide for common queries and use cases\\\\\\\\n\\\\\\\\n### Usage Statistics\\\\\\\\n\\\\\\\\nThe dataset has accumulated since NEAR Protocol\\\\\\\\\\\\'s mainnet launch in October 2020. The current image size is around 40TB, growing at approximately 4TB monthly. There is no current data retention policy. Proposals should include strategies for data management, including potential archiving solutions for historical data older than two years.\\\\\\\\n\\\\\\\\n[Nansen](https://www.nansen.ai/), [NEAR Foundation](https://near.foundation/), [SWEAT](https://sweat.com/), [Dune Analytics](https://dune.com/), and NEAR NDC are stakeholders using BigQuery and Avro pipelines.\\\\\\\\n\\\\\\\\n## Transition Steps\\\\\\\\n\\\\\\\\n1. Review and understand the current BigQuery Dataset infrastructure and processes.\\\\\\\\n2. Include a detailed transition plan in your milestones (deadline Feb 25 transition from Pagoda Continuity team)\\\\\\\\n3. Set up necessary access and permissions for the new team.\\\\\\\\n4. Conduct knowledge transfer sessions with the current Pagoda team.\\\\\\\\n5. Implement and test any necessary changes or improvements to the infrastructure.\\\\\\\\n6. Perform thorough testing to ensure data integrity and system performance.\\\\\\\\n7. Update all relevant documentation.\\\\\\\\n8. Gradually transition operational responsibilities.\\\\\\\\n9. Establish new support channels and processes.\\\\\\\\n10. Conduct a final review and handover with the Infrastructure Committee.\\\\\\\\n11. Conduct official communications on your channels and with the NEAR Developer ecosystems and relevant stakeholders.\\\\\\\\n\\\\\\\\n## Service Level Agreements\\\\\\\\n\\\\\\\\n1. **Availability**\\\\\\\\n    * **Uptime Guarantee**: 99.0% monthly uptime\\\\\\\\n    * **Downtime Allowance**: Up to .01% of downtime per month\\\\\\\\n\\\\\\\\n2. **Support**\\\\\\\\n    * **Support Availability**: Community-based support only (e.g., through forums, GitHub issues, or a developer community Slack/Telegram/Discord channel)\\\\\\\\n    * **Response Time**: No guaranteed response time, but best-effort responses within 24-48 hours\\\\\\\\n\\\\\\\\n3. **Data Integrity**\\\\\\\\n    * **Data Consistency**: Zero community reports on missing data are expected. The missing data should be backfilled as a blocking priority, and a public incident report should be published.\\\\\\\\n\\\\\\\\n4. **Updates and Changes**\\\\\\\\n    * **Notice for Breaking Changes**: At least seven days\\\\\\\\\\\\' notice for any breaking changes in the API or infrastructure\\\\\\\\n\\\\\\\\n5. **Limitations**\\\\\\\\n    * **No SLA Credits**: No financial credits or compensation for outages or performance issues.\\\\\\\\n    * **Fair Use Policy**: Provide Explicit statements about the intended use for development and the prohibition of production workloads\\\\\\\\n\\\\\\\\n6. **Termination Rights**: The right to suspend or terminate the service for users who exceed fair use or misuse the service. IC must be informed about these.\\\\\\\\n\\\\\\\\n## Required Experience\\\\\\\\n\\\\\\\\n* **Experience:** Proven experience in big data processing, cloud infrastructure management, and blockchain data indexing, preferably within the blockchain or fintech sectors. Experience working with NEAR Protocol is a plus.\\\\\\\\n* **Portfolio:** Examples of previous work and case studies demonstrating success in similar projects.\\\\\\\\n* **Team:** A skilled team comprising developers, data engineers, and support staff with relevant experience.\\\\\\\\n* **Relevant Business:** Your team has an existing business that would motivate you to continue building this infrastructure.\\\\\\\\n\\\\\\\\n## Budget Guidelines\\\\\\\\n\\\\\\\\n### Budget\\\\\\\\n\\\\\\\\nProposals should outline a detailed budget with a clear breakdown of costs, including development, testing, documentation, maintenance and support, infrastructure, third-party services, and external API costs. Maintenance costs should be calculated accurately based on provided usage information and existing software costs. Properly assessing a budget based on usage is a significant factor in qualifying legitimate entities.\\\\\\\\n\\\\\\\\n### Milestones\\\\\\\\n\\\\\\\\nPlease highlight the details of the various milestones in your development plan and the relevant budgets attached to each milestone. Any metrics around the milestone\\\\\\\\\\\\'s success (acceptance criterion) should also be included. Milestone examples include signing the agreement, the official transition, a 6-month or 12-month billing period, etc.\\\\\\\\n\\\\\\\\n### Contingency\\\\\\\\n\\\\\\\\nInclude a contingency plan for potential overruns or unexpected expenses. Suppose expenses for providing free services or public goods to the NEAR ecosystem exceed previous budgets. In that case, a clear policy should be to report expenses incurred by NEAR usage to cover additional costs and prove that costs exceeded previous budgets.\\\\\\\\n\\\\\\\\n## Resources\\\\\\\\n\\\\\\\\nBig Query Documentation: [https://docs.near.org/build/data-infrastructure/big-query](https://docs.near.org/build/data-infrastructure/big-query)\\\\\\\\n\\\\\\\\nRelated Infrastructure (Data Platform RFPs) - We recommend that the same vendor bid for NEAR Lake-related infrastructure;\\\\\\\\n\\\\\\\\n* {Link to NEAR Lake RFP}\\\\\\\\n* {Link to KitWallet API RFP}\\\\\\\\n\\\\\\\\n## Process\\\\\\\\n\\\\\\\\n[//]: # (Boilerplate)\\\\\\\\n\\\\\\\\n**[Proposal Process](https://docs.google.com/document/d/1F7iAT9tWngik9JPS_GadCCEB5nZtA2AiL2yWZoBGMFM/pub)**\\\\\\\\n\\\\\\\\nYou should submit a proposal in response to this RFP on the Infrastructure Committee Portal. [Here](https://docs.google.com/document/d/1TVvPXPJhZfaFwfA2UMW6c3pO2kis45SJ1Np1XOkkhnA/edit?usp=sharing) is a standard (+ [markup](https://docs.google.com/document/d/1UZRfOE1JAOhsnSmp-RmL2hY7KPJbpBImKZVvPV4YJmA/edit?usp=sharing)) template you can use as a starting point.\\\\\\\\n\\\\\\\\nMarketing materials, presentations, and images can be attached as needed as external links. An easy way to do this is to start a discussion under the Proposals category on the Infrastructure Working Group GitHub repository [here](https://github.com/near/Infrastructure-Working-Group/discussions/categories/proposals), publish, edit the post, and finally copy the links generated for the files you uploaded.\\\\\\\\n\\\\\\\\n### Proposal Submission Dates\\\\\\\\n\\\\\\\\nThe deadline for proposal submission is **Tuesday, October 8th** (giving applicants approximately two weeks), with a Q&A period on the proposal itself.\\\\\\\\n\\\\\\\\n### Selection Process\\\\\\\\n\\\\\\\\nAfter reviewing the proposals, the committee will vote on the best one. Generally, this process takes two working weeks to complete and will be discussed and voted on at the regular bi-weekly meeting.\\\\\\\\n\\\\\\\\n### Voting Dates\\\\\\\\n\\\\\\\\nThe estimate for voting completion is **two weeks** after the proposal submission date.\\\\\\\\n\\\\\\\\n### Transition Process\\\\\\\\n\\\\\\\\nThe estimated transition time is one week, not considering any KYC or KYB blockers.  \\\\\\\\n\\\\\\\\n### Funding Process\\\\\\\\n\\\\\\\\nThe Infrastructure Committee governs funding with assistance from the NEAR Foundation. If selected, your proposal enters the funding pipeline. You are required to:\\\\\\\\n\\\\\\\\n* Complete the KYC/B process conducted by the NEAR Foundation, including verification by IDVerify.\\\\\\\\n* Sign a legal agreement regarding the work as outlined in the proposal conducted by the NEAR Foundation.\\\\\\\\n* Submit an invoice to NEAR Foundation Finance outlining how you want funds disbursed, to what wallets or banks, and in the agreed-upon amounts.\\\\\\\\n* Complete a test transaction to verify target wallets (when requesting funds in cryptocurrency).\\\\\\\\n\\\\\\\\n### Funding Dates\\\\\\\\n\\\\\\\\nThe funding process is generally completed in one working week if the proposal does not require clarifications in the budget, work approach, legal agreement, or invoicing terms.\\\\\\\\n\\\\\\\\n### Communication\\\\\\\\n\\\\\\\\nPlease direct all communications to the thread where the RFP started beneath the submitted proposal. Please direct confidential or sensitive communications to the Telegram group set up between the committee and the organization/entity/team. If you don\\\\\\\\\\\\'t have a private Telegram group between your team and the Infrastructure Committee, please request one in this thread.\\\\\\\\n\", \"rfp_body_version\": \"V0\", \"submission_deadline\": \"1728345600000000000\"}, \"labels\": [\"Query API\"]}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.2663389541068e+21
    }
  },
  {
    "id": "8624068132",
    "receipt_id": "G33jfVi3CuQjkpxR3Dy6To7dpvb2PLZJUfHnBH9trsyq",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "social.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "3s2y35hc7C1pofGBrkk2edXEQ29TSLU2fdFQxb6p5go2",
      "block_height": 128795620,
      "block_timestamp": 1727187516164005600
    },
    "receipt_outcome": {
      "gas_burnt": 3880301259053,
      "tokens_burnt": 388030125905300000000,
      "executor_account_id": "social.near",
      "status": true
    },
    "transaction_hash": "FTMjwk3k7xRrQuyFRJHVL8dmsuyTtzJkwX2EuvV1J2WT",
    "included_in_block_hash": "CD87jRUDJXuDR1ppCpYNKBMB91jTLLF5Mn8pRbzuNrpE",
    "block_timestamp": "1727187513450658693",
    "block": {
      "block_height": 128795618
    },
    "receipt_conversion_tokens_burnt": "104973200311000000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set",
        "deposit": 0,
        "fee": 388030125905300000000,
        "args": "{\"data\": {\"infrastructure-committee.near\": {\"index\": {\"notify\": \"[{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"flmel.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":4,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"pivortex.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":4,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"petersalomonsen.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":4,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"polyprogrammist.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":4,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":4,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"trechriron71.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":4,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"eric3.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":4,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"theori.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":4,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"as2.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":4,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"woben.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":4,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"frol.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":4,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"mob.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":4,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}},{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"megha19.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"rfp/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"rfp\\\\\\\\\\\\\\\":4,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\"}}]\"}}}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.2663389541068e+21
    }
  },
  {
    "id": "8624960351",
    "receipt_id": "4VsKB4rhiqJuYcFPfB3c8qk7E2vmqcckiLKA9f6QvM38",
    "predecessor_account_id": "nearblocks_io.near",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "2eYFTHxsFHedEmzbkjsxogifR5ZKFpNYquY1iaiiNQ79",
      "block_height": 128797859,
      "block_timestamp": 1727190330987274200
    },
    "receipt_outcome": {
      "gas_burnt": 6024568726343,
      "tokens_burnt": 602456872634300000000,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "HD6dm426ZqGc1o5Z6VFUutEnJZMp6Anus9uwmFAZ5KUx",
    "included_in_block_hash": "DFFhfGRzCPVTBBqqGrDP3nVC6zfZqcvM7g4P2bdX8xFn",
    "block_timestamp": "1727190329677553611",
    "block": {
      "block_height": 128797858
    },
    "receipt_conversion_tokens_burnt": "54843310731500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "add_proposal",
        "deposit": 0,
        "fee": 602456872634300000000,
        "args": "{\"body\": {\"name\": \"Nearblocks Infra Extension Request\", \"summary\": \"We are extremely happy that NEAR is growing as a chain, but this growth translates into increased hardcosts on our end. This request is to cover the increase in hardcosts.\", \"category\": \"Infrastructure Committee\", \"timeline\": {\"status\": \"DRAFT\"}, \"supervisor\": null, \"description\": \"## Organization\\\\\\\\nNearblocks.io (EXPLORE BLOCKS PTE LTD)\\\\\\\\n### Primary person\\\\\\\\u{2019}s contact information\\\\\\\\nLuke\\\\\\\\n### Size of the whole team\\\\\\\\n6\\\\\\\\n### Size of the engineering team\\\\\\\\n5\\\\\\\\n### Team location\\\\\\\\nIndonesia, Singapore\\\\\\\\n### Team background and bios\\\\\\\\nLuke - CEO : Luke manages product growth, partnerships and business development.\\\\\\\\nAndrew - CTO : Andrew manages the engineering team.\\\\\\\\n### Any affiliations with other NEAR ecosystem partners?\\\\\\\\nYes, nearblocks.io is affiliated with most of the NEAR Protocol ecosystem. we provide tools and infrastructure for developers working on NEAR, offering services like blockchain data visualization and analytics. nearblocks.io collaborates with various projects and initiatives within the NEAR community to enhance the overall developer experience and support ecosystem growth.\\\\\\\\n## Professional Experience\\\\\\\\n### Examples of relevant experience with NEAR blockchain\\\\\\\\nnearblocks.io is our flagship product, however we have built other products in the past on NEAR such as nearsend.io.\\\\\\\\n### Non-technical capabilities:\\\\\\\\nWe have proven resilience and growth within the NEAR ecosystem, by partnering up with most of the projects building on NEAR we have stimulated nearblocks.io user growth to become one of the most visited products within the ecosystem.\\\\\\\\n### In-House Resources\\\\\\\\nWith a 6-man team we are able to maintain and release regular features on the nearblocks.io product as well as grow it through partnerships. We have a smooth enquiry section which covers customer support in regards to our APIs, bugs and advertising requests.\\\\\\\\n### Portfolio of relevant work\\\\\\\\nWe have previously built nearsend.io, but nearblocks.io has been the sole focus since 2022. \\\\\\\\n## Request details\\\\\\\\nNearblocks has come a long way since funding was provided in September 2023. We have upgraded our indexer, storage design and stabilised API performance. We are close to being able to deliver consistent loading performance and reliability for all users.\\\\\\\\n\\\\\\\\nWe went on a bit of a journey with BOS but ended up finding it was not a fit for Nearblocks, causing a lot of outages and downtimes outside of our control. Since September 2024 we have reverted this. Near has also grown as a chain since September 2023 as seen in [this chart](https://nearblocks.io/charts/txns). \\\\\\\\n\\\\\\\\nWe are extremely happy that NEAR is growing as a chain, but this growth translates into increased hardcosts on our end. Here\\\\\\\\u{2019}s a comparison between September last year and this year : \\\\\\\\n\\\\\\\\n**September 2023**\\\\\\\\n\\\\\\\\n- Operation on a bare minimal infrastructure with a single point of failure\\\\\\\\n- 1 primary database server with 12TB of SSD storage used for both mainnet and testnet\\\\\\\\n\\\\\\\\n**September 2024**\\\\\\\\n\\\\\\\\n- Mainnet cluster with backup and failover solution for mainnet: Able to achieve 24 hour recovery time in the event a cluster is completely lost.\\\\\\\\n- 2x mainnet database cluster, 23TB of used SSD storage each : Able to sustain loss of 1 server.\\\\\\\\n- 1x testnet database with 4TB of used SSD storage : No failover. 8 hour recovery time if there is a failure.\\\\\\\\n- Backup server, 45TB of HDD storage for archive and disaster recovery\\\\\\\\n\\\\\\\\nWith the exponentially rising storage consumption, we expect our storage capacity will run out in 3-6 months. \\\\\\\\nOur current hosting costs are sitting at $7,000 monthly with a forecasted $14,000 monthly for the next 2 years, up from our initially budgeted $3,000. We would also like to have the budget for a testnet high availability and mainnet additional replica.\\\\\\\\n## Goals / Milestones\\\\\\\\nOur goal will always remain uptime and a smooth user-experience for users. With the gradual increase of the size of the database we are in need of additional support in regards to our infrastructure. \\\\\\\\n\\\\\\\\nThis funding request is to cover the growing distance in cost overtime over the next 2 years. We are proposing the following payments on a 3 month basis. A quarterly report will be shared to track storage size. As the infrastructure committee works on a calendar year basis, we are requesting the following amount for the remainder of the year : \\\\\\\\n\\\\\\\\nSeptember - November : $33,000\\\\\\\\n\\\\\\\\nWe will submit a proposal later this year for 2025.\\\\\\\\n\\\\\\\\n## Metrics\\\\\\\\nSuccess will be measured by our [uptime](https://status.nearblocks.io/) and we will provide monthly updates on the storage size.\\\\\\\\n## Budget\\\\\\\\n### Budget Total\\\\\\\\n$33,000\\\\\\\\n### Budget Breakdown\\\\\\\\n- September 2024 : $11,000\\\\\\\\n- October 2024 : $11,000\\\\\\\\n- November $11,000\\\\\\\\n\", \"linked_proposals\": [], \"receiver_account\": \"nearblocks_io.near\", \"requested_sponsor\": \"infrastructure-committee.near\", \"proposal_body_version\": \"V1\", \"requested_sponsorship_usd_amount\": \"33000\", \"requested_sponsorship_paid_in_currency\": \"OTHER\"}, \"labels\": [\"Explorers\"]}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.834330204563e+21
    }
  },
  {
    "id": "8624960691",
    "receipt_id": "93VhnnLBkAC2478j277BpM67Nf8Hu6JeV1iVcmx768h3",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "social.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "5RiV2KFfdfdUqJBahwSohyx78G7oWp481JCuNV7KByXX",
      "block_height": 128797860,
      "block_timestamp": 1727190332304450000
    },
    "receipt_outcome": {
      "gas_burnt": 4504904821964,
      "tokens_burnt": 450490482196400000000,
      "executor_account_id": "social.near",
      "status": true
    },
    "transaction_hash": "HD6dm426ZqGc1o5Z6VFUutEnJZMp6Anus9uwmFAZ5KUx",
    "included_in_block_hash": "DFFhfGRzCPVTBBqqGrDP3nVC6zfZqcvM7g4P2bdX8xFn",
    "block_timestamp": "1727190329677553611",
    "block": {
      "block_height": 128797858
    },
    "receipt_conversion_tokens_burnt": "54843310731500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set",
        "deposit": 0,
        "fee": 450490482196400000000,
        "args": "{\"data\": {\"infrastructure-committee.near\": {\"post\": {\"main\": \"{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"md\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"text\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"We have just received a new *Infrastructure Committee* proposal.\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\n\\\\\\\\u{2014}\\\\\\\\u{2014}\\\\\\\\u{2014}\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\n**By**: @nearblocks_io.near\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\n**Title**: \\\\\\\\u{201c}Nearblocks Infra Extension Request\\\\\\\\u{201c}\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\n**Summary**:\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\nWe are extremely happy that NEAR is growing as a chain, but this growth translates into increased hardcosts on our end. This request is to cover the increase in hardcosts.\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\n\\\\\\\\u{2014}\\\\\\\\u{2014}\\\\\\\\u{2014}\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\nRead the full proposal and share your feedback on [DevHub](/devhub.near/widget/app?page=proposal&id=20)\\\\\\\\\\\\\\\"}\"}, \"index\": {\"post\": \"{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"main\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"md\\\\\\\\\\\\\\\"}}\"}}}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.834330204563e+21
    }
  },
  {
    "id": "8624960695",
    "receipt_id": "7YcwerWn41xpBndKfT7aS2Fia6o4AFUJbQoXRHXxoZ53",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "5RiV2KFfdfdUqJBahwSohyx78G7oWp481JCuNV7KByXX",
      "block_height": 128797860,
      "block_timestamp": 1727190332304450000
    },
    "receipt_outcome": {
      "gas_burnt": 3613233889355,
      "tokens_burnt": 361323388935500000000,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "HD6dm426ZqGc1o5Z6VFUutEnJZMp6Anus9uwmFAZ5KUx",
    "included_in_block_hash": "DFFhfGRzCPVTBBqqGrDP3nVC6zfZqcvM7g4P2bdX8xFn",
    "block_timestamp": "1727190329677553611",
    "block": {
      "block_height": 128797858
    },
    "receipt_conversion_tokens_burnt": "54843310731500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set_block_height_callback",
        "deposit": 0,
        "fee": 361323388935500000000,
        "args": "{\"proposal\": {\"id\": 20, \"snapshot\": {\"name\": \"Nearblocks Infra Extension Request\", \"labels\": [\"Explorers\"], \"summary\": \"We are extremely happy that NEAR is growing as a chain, but this growth translates into increased hardcosts on our end. This request is to cover the increase in hardcosts.\", \"category\": \"Infrastructure Committee\", \"timeline\": {\"status\": \"DRAFT\"}, \"editor_id\": \"nearblocks_io.near\", \"timestamp\": \"1727190330987274159\", \"linked_rfp\": null, \"supervisor\": null, \"description\": \"## Organization\\\\\\\\nNearblocks.io (EXPLORE BLOCKS PTE LTD)\\\\\\\\n### Primary person\\\\\\\\u{2019}s contact information\\\\\\\\nLuke\\\\\\\\n### Size of the whole team\\\\\\\\n6\\\\\\\\n### Size of the engineering team\\\\\\\\n5\\\\\\\\n### Team location\\\\\\\\nIndonesia, Singapore\\\\\\\\n### Team background and bios\\\\\\\\nLuke - CEO : Luke manages product growth, partnerships and business development.\\\\\\\\nAndrew - CTO : Andrew manages the engineering team.\\\\\\\\n### Any affiliations with other NEAR ecosystem partners?\\\\\\\\nYes, nearblocks.io is affiliated with most of the NEAR Protocol ecosystem. we provide tools and infrastructure for developers working on NEAR, offering services like blockchain data visualization and analytics. nearblocks.io collaborates with various projects and initiatives within the NEAR community to enhance the overall developer experience and support ecosystem growth.\\\\\\\\n## Professional Experience\\\\\\\\n### Examples of relevant experience with NEAR blockchain\\\\\\\\nnearblocks.io is our flagship product, however we have built other products in the past on NEAR such as nearsend.io.\\\\\\\\n### Non-technical capabilities:\\\\\\\\nWe have proven resilience and growth within the NEAR ecosystem, by partnering up with most of the projects building on NEAR we have stimulated nearblocks.io user growth to become one of the most visited products within the ecosystem.\\\\\\\\n### In-House Resources\\\\\\\\nWith a 6-man team we are able to maintain and release regular features on the nearblocks.io product as well as grow it through partnerships. We have a smooth enquiry section which covers customer support in regards to our APIs, bugs and advertising requests.\\\\\\\\n### Portfolio of relevant work\\\\\\\\nWe have previously built nearsend.io, but nearblocks.io has been the sole focus since 2022. \\\\\\\\n## Request details\\\\\\\\nNearblocks has come a long way since funding was provided in September 2023. We have upgraded our indexer, storage design and stabilised API performance. We are close to being able to deliver consistent loading performance and reliability for all users.\\\\\\\\n\\\\\\\\nWe went on a bit of a journey with BOS but ended up finding it was not a fit for Nearblocks, causing a lot of outages and downtimes outside of our control. Since September 2024 we have reverted this. Near has also grown as a chain since September 2023 as seen in [this chart](https://nearblocks.io/charts/txns). \\\\\\\\n\\\\\\\\nWe are extremely happy that NEAR is growing as a chain, but this growth translates into increased hardcosts on our end. Here\\\\\\\\u{2019}s a comparison between September last year and this year : \\\\\\\\n\\\\\\\\n**September 2023**\\\\\\\\n\\\\\\\\n- Operation on a bare minimal infrastructure with a single point of failure\\\\\\\\n- 1 primary database server with 12TB of SSD storage used for both mainnet and testnet\\\\\\\\n\\\\\\\\n**September 2024**\\\\\\\\n\\\\\\\\n- Mainnet cluster with backup and failover solution for mainnet: Able to achieve 24 hour recovery time in the event a cluster is completely lost.\\\\\\\\n- 2x mainnet database cluster, 23TB of used SSD storage each : Able to sustain loss of 1 server.\\\\\\\\n- 1x testnet database with 4TB of used SSD storage : No failover. 8 hour recovery time if there is a failure.\\\\\\\\n- Backup server, 45TB of HDD storage for archive and disaster recovery\\\\\\\\n\\\\\\\\nWith the exponentially rising storage consumption, we expect our storage capacity will run out in 3-6 months. \\\\\\\\nOur current hosting costs are sitting at $7,000 monthly with a forecasted $14,000 monthly for the next 2 years, up from our initially budgeted $3,000. We would also like to have the budget for a testnet high availability and mainnet additional replica.\\\\\\\\n## Goals / Milestones\\\\\\\\nOur goal will always remain uptime and a smooth user-experience for users. With the gradual increase of the size of the database we are in need of additional support in regards to our infrastructure. \\\\\\\\n\\\\\\\\nThis funding request is to cover the growing distance in cost overtime over the next 2 years. We are proposing the following payments on a 3 month basis. A quarterly report will be shared to track storage size. As the infrastructure committee works on a calendar year basis, we are requesting the following amount for the remainder of the year : \\\\\\\\n\\\\\\\\nSeptember - November : $33,000\\\\\\\\n\\\\\\\\nWe will submit a proposal later this year for 2025.\\\\\\\\n\\\\\\\\n## Metrics\\\\\\\\nSuccess will be measured by our [uptime](https://status.nearblocks.io/) and we will provide monthly updates on the storage size.\\\\\\\\n## Budget\\\\\\\\n### Budget Total\\\\\\\\n$33,000\\\\\\\\n### Budget Breakdown\\\\\\\\n- September 2024 : $11,000\\\\\\\\n- October 2024 : $11,000\\\\\\\\n- November $11,000\\\\\\\\n\", \"linked_proposals\": [], \"receiver_account\": \"nearblocks_io.near\", \"requested_sponsor\": \"infrastructure-committee.near\", \"proposal_body_version\": \"V1\", \"requested_sponsorship_usd_amount\": \"33000\", \"requested_sponsorship_paid_in_currency\": \"OTHER\"}, \"author_id\": \"nearblocks_io.near\", \"snapshot_history\": [], \"social_db_post_block_height\": \"0\"}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.834330204563e+21
    }
  },
  {
    "id": "8624960696",
    "receipt_id": "86eKQ5kSBCPi6vfjxYKZgZW9WFuumTSk6h7PCJcZiKMT",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "social.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "5RiV2KFfdfdUqJBahwSohyx78G7oWp481JCuNV7KByXX",
      "block_height": 128797860,
      "block_timestamp": 1727190332304450000
    },
    "receipt_outcome": {
      "gas_burnt": 3652161500653,
      "tokens_burnt": 365216150065300000000,
      "executor_account_id": "social.near",
      "status": true
    },
    "transaction_hash": "HD6dm426ZqGc1o5Z6VFUutEnJZMp6Anus9uwmFAZ5KUx",
    "included_in_block_hash": "DFFhfGRzCPVTBBqqGrDP3nVC6zfZqcvM7g4P2bdX8xFn",
    "block_timestamp": "1727190329677553611",
    "block": {
      "block_height": 128797858
    },
    "receipt_conversion_tokens_burnt": "54843310731500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set",
        "deposit": 0,
        "fee": 365216150065300000000,
        "args": "{\"data\": {\"infrastructure-committee.near\": {\"index\": {\"notify\": \"[{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"proposal/mention\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"proposal\\\\\\\\\\\\\\\":20,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"nearblocks_io.near\\\\\\\\\\\\\\\"}}]\"}}}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.834330204563e+21
    }
  }
]