[
  {
    "id": "9665616987",
    "receipt_id": "9UBsMd8TsifHJoQnxrgoh6eCaaBUnLksA4g89inEb8b6",
    "predecessor_account_id": "trechriron71.near",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "DNLNdtuFtkAFYFMSBdAsTpfNmNR6vzeBnUMyqcmLSMkt",
      "block_height": 131568508,
      "block_timestamp": 1730310359612249900
    },
    "receipt_outcome": {
      "gas_burnt": 14268187956111,
      "tokens_burnt": 1.4268187956111e+21,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "EWzc96kBVWM45e7v7DHWkzYQ87DgvKumfCDNbfDNWhHb",
    "included_in_block_hash": "HUV7qcWfQp8N7dnoPFcqp1HMb9BKVt7AcgukPBVbatRC",
    "block_timestamp": "1730310358541330982",
    "block": {
      "block_height": 131568507
    },
    "receipt_conversion_tokens_burnt": "123588922647000000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "edit_proposal",
        "deposit": 0,
        "fee": 1.4268187956111e+21,
        "args": "{\"id\": 51, \"body\": {\"name\": \"Upgrade, Expand and Decentralise NEAR\\\\\\\\u{2019}s RPC Infrastructure with Liquify\", \"summary\": \"Liquify proposes to upgrade NEAR\\\\\\\\\\\\'s RPC infrastructure with a hybrid strategy, combining high-performance bare-metal servers with greater access to decentralized RPC protocols. Key points:\\\\\\\\n\\\\\\\\n- Already served 14B NEAR requests (99.999% success)\\\\\\\\n- Support decentralized infra protocols (LAVA, POKT, SubQuery etc.) with an industry leading infra backbone\\\\\\\\n- Mainnet & Testnet (archival included) \\\\\\\\n- Developer portal w/ free-tier & SLA support\\\\\\\\n- Global coverage w/ fully owned hardware (not rented or cloud)\", \"category\": \"Infrastructure Committee\", \"timeline\": {\"status\": \"REJECTED\", \"kyc_verified\": false, \"timeline_version\": \"V1\", \"sponsor_requested_review\": false, \"reviewer_completed_attestation\": false}, \"linked_rfp\": 2, \"supervisor\": \"trechriron71.near\", \"description\": \"# 1. Submission Info\\\\\\\\n\\\\\\\\nSubmitted By:  Liquify LTD\\\\\\\\n\\\\\\\\n- Name: Shane Burgett\\\\\\\\n- Role: Account Lead\\\\\\\\n- Email: shane@liquify.io\\\\\\\\n- Telegram: [shane8burger](https://dev.near.org/infrastructure-committee.near/widget/app?page=create-proposal&rfp_id=2#/mob.near/widget/ProfilePage?accountId=shane8burger)\\\\\\\\n\\\\\\\\nDate:  October 3, 2024\\\\\\\\n\\\\\\\\n&nbsp; \\\\\\\\n# 2. Executive Summary\\\\\\\\n\\\\\\\\n**Overview**\\\\\\\\nAs the NEAR ecosystem grows, it requires a scalable, resilient RPC infrastructure that balances performance and decentralisation. **Liquify is uniquely positioned to meet this need with a bridge solution that combines the performance of centralised infrastructure with the greater access and resiliency of decentralisation through our involvement in decentralised RPC protocols.** Our globally distributed, fully-owned bare-metal infrastructure ensures high performance and reliability while supporting NEAR\\\\\\\\\\\\'s goal of broader, decentralised access.\\\\\\\\n &nbsp;\\\\\\\\n**Key Objectives**\\\\\\\\n\\\\\\\\n- Seamless transition and management of NEAR\\\\\\\\\\\\'s existing RPC infrastructure.\\\\\\\\n- High-performance and reliable RPC services that exceed NEAR\\\\\\\\\\\\'s stated goals.\\\\\\\\n- Flexible, scalable infrastructure to support NEAR\\\\\\\\\\\\'s growth and exposes NEAR to numerous decentralised infrastructure protocols.\\\\\\\\n- Developer Portal\\\\\\\\n\\\\\\\\nValue Proposition  \\\\\\\\nLiquify\\\\\\\\\\\\'s hybrid approach blends the performance of centralised services with the decentralised ethos of blockchain. Our proven expertise in managing complex infrastructures makes us the ideal partner to support NEAR\\\\\\\\\\\\'s vision for a decentralised, scalable future.\\\\\\\\n\\\\\\\\n&nbsp; \\\\\\\\n# 3. Organisation Information\\\\\\\\n\\\\\\\\n**Size of the Team**\\\\\\\\n\\\\\\\\n- Total Employees: 15+ team members.\\\\\\\\n- Engineering Team: 9+ engineers with extensive experience in blockchain infrastructure and RPC services.\\\\\\\\n\\\\\\\\n**Team Location**\\\\\\\\n\\\\\\\\n- Headquarters in the UK.\\\\\\\\n- Data centres in the US (Phoenix, Washington D.C.), Europe (Germany, UK), and Asia (Singapore, Japan) to provide comprehensive global coverage.\\\\\\\\n\\\\\\\\n**Team Background and Bios**\\\\\\\\n\\\\\\\\n- Andy Pohl: CEO with a strong background in software engineering and extensive experience in blockchain infrastructure. Andy has a Master\\\\\\\\\\\\'s in Electronic & Computer Engineering from the University of Birmingham and has previously worked with leading blockchain projects.\\\\\\\\n- Isaac Rodgin: Head of Business Development with a robust background in integrating custom infrastructure solutions for web3 projects and investment firms. Founder of Rodgin Consulting Group and former advisor at Fuse.io.\\\\\\\\n- Shane Burgett: Account Lead with a strong focus on blockchain infrastructure, having served as Product Lead at Pocket Network Foundation and founded Decentralized Authority, an infrastructure tooling devshop.\\\\\\\\n\\\\\\\\n**Affiliations with NEAR Ecosystem Partners**\\\\\\\\nLiquify has had much involvement with NEAR, providing RPC and node services to various ecosystem participants, including Aurora, POKT Network, Lava Network, dRPC, Subquery, and TRGC.\\\\\\\\n\\\\\\\\n&nbsp; \\\\\\\\n# 4. Professional Experience\\\\\\\\n\\\\\\\\n**Relevant Experience with NEAR Blockchain**\\\\\\\\n\\\\\\\\n- Liquify has been a trusted infrastructure provider for NEAR, serving over **14 billions NEAR RPC requests** acrossing full nodes, archival nodes, and indexing, with a success rate of 99.9998%.\\\\\\\\n- Our team has worked directly with the Pagoda team and familiar with all of NEAR\\\\\\\\\\\\'s tooling.\\\\\\\\n- We are familiar with NEAR upgrades and were able to maintain reliability during the Q2 resharding events.\\\\\\\\n- We have brought critical NEAR infrastructure to multiple decentralised infrastructure protocols, like LAVA, POKT, and dRPC.\\\\\\\\n- Liquify is also heavily involved with NEAR validation with current delegations equating to $30M+ of staked NEAR tokens.\\\\\\\\n\\\\\\\\n**Non-Technical Capabilities**\\\\\\\\n\\\\\\\\n- Product Management: We assign dedicated product managers to each engagement, ensuring effective communication and timely delivery.\\\\\\\\n- Customer Support: Liquify provides 24/7 support through multiple channels, including Slack, Telegram, Discord, and email.\\\\\\\\n- Business Development and Marketing: We focus on building long-term relationships with institutional clients and blockchain ecosystems through tailored solutions and strategic partnerships.\\\\\\\\n\\\\\\\\n**In-House Resources**\\\\\\\\n\\\\\\\\n- Design UX/UI: Our design team specialises in creating custom applications and dashboards for monitoring RPC performance and network status.\\\\\\\\n- Customer Support: A dedicated team ensures prompt resolution of any technical issues, with a focus on providing a seamless user experience.\\\\\\\\n\\\\\\\\n**Portfolio of Relevant Work**\\\\\\\\n\\\\\\\\nLiquify has a long history of delivering on foundation partnership and public proposals:\\\\\\\\n\\\\\\\\n- POKT validation, snapshots, RPC infra, and RPC Gateway: [Public Proposal](https://forum.pokt.network/t/open-priority-gateway-demo/4874/2) \\\\\\\\u{2192} [Launched Product](https://www.liquify.com/blog/pokt-network-is-getting-a-new-gateway-by-liquify)\\\\\\\\n- Selfchain RPC infra, IBC relayer, and validator: [Foundation Partnership](https://x.com/selfchainxyz/status/1806251581186379816)\\\\\\\\n- Subquery validator and RPC infra: [Foundation Partnership](https://x.com/Liquify_ltd/status/1801260253809692689)\\\\\\\\n- Stellar RPC infra: [Public Proposal](https://communityfund.stellar.org/project/infrastructure-support-liquify)\\\\\\\\n- Syscoin RPC infra: [Foundation Partnership](https://rollux.com/news/weekly-240426)\\\\\\\\n- Fuse RPC Infra: [Foundation Partnership](https://news.fuse.io/liquify-powers-up-to-provide-fuse-network-rpc-nodes/)\\\\\\\\n- Pyth Network Publisher infra & Hermes provider: Foundation Partnership\\\\\\\\n- Sentinel public RPC infra and validator: Foundation Partnership\\\\\\\\n- Infura\\\\\\\\\\\\'s DIN (Liquify is the leading provider): [Public Partnership](https://www.infura.io/solutions/decentralized-infrastructure-service)\\\\\\\\n\\\\\\\\nLiquify also is a central player in numerous decentralised RPC protocols:\\\\\\\\n\\\\\\\\n- LAVA\\\\\\\\n- POKT\\\\\\\\n- DIN - Infura\\\\\\\\\\\\'s Decentralised Infrastructure Network\\\\\\\\n- dRPC\\\\\\\\n- Route Protocol\\\\\\\\n- Subquery\\\\\\\\n\\\\\\\\n# 5. Approach and Solution\\\\\\\\n&nbsp; \\\\\\\\n\\\\\\\\n### Primary Approach and Solution\\\\\\\\n\\\\\\\\nLiquify will utilise a three-pronged strategy to address NEAR\\\\\\\\\\\\'s RPC infrastructure needs:\\\\\\\\n\\\\\\\\n1. Delivering Top-Tier Performance through Bare-Metal Infrastructure: Liquify will provide the fastest, most distributed, and highly reliable bare-metal infrastructure. This ensures industry-leading performance, capable of supporting NEAR\\\\\\\\\\\\'s expanding ecosystem with the highest levels of uptime, low latency, and optimised traffic management. This infrastructure will be a mix of nodes and indexing (likely [Read RPC](https://github.com/near/read-rpc/))\\\\\\\\n\\\\\\\\n2. Empowering NEAR with a Robust Developer Portal: Liquify will establish an industry-leading RPC portal for NEAR developers. This portal will feature an accessible free tier, simplified billing, robust monitoring, notifications, and comprehensive Service Level Agreement (SLA) assurances. In addition, developers will benefit from decentralised RPC protocol access, allowing for seamless interaction with NEAR\\\\\\\\\\\\'s network through a decentralised approach.\\\\\\\\n\\\\\\\\n3. Bridging NEAR to Decentralised Infrastructure Protocols: Liquify will strategically position NEAR within the decentralised infrastructure protocol landscape by integrating multiple RPC gateway options. This approach ensures that NEAR developers can access both centralised and decentralised RPC services, empowering them with the flexibility to choose the best infrastructure for their specific use case.\\\\\\\\n\\\\\\\\n### Why Choose Liquify\\\\\\\\n\\\\\\\\nLiquify is uniquely positioned to accelerate NEAR\\\\\\\\\\\\'s developer experience by offering a balanced solution that addresses both centralised and decentralised needs. NEAR should not be limited to a single RPC infrastructure solution. Liquify\\\\\\\\\\\\'s platform offers a variety of RPC experiences to cater to the diverse requirements of different projects and developers within the NEAR ecosystem.\\\\\\\\n&nbsp; \\\\\\\\nWith proven experience and a long-standing relationship with NEAR, Liquify can ensure a seamless transition from NEAR\\\\\\\\\\\\'s current RPC setup while introducing improvements in performance, decentralisation, and flexibility. This combination makes Liquify the optimal partner to lead NEAR\\\\\\\\\\\\'s infrastructure into the future.\\\\\\\\n&nbsp; \\\\\\\\n**Open Source and Licensing**\\\\\\\\nAll software developed as part of this project will be released under Apache 2.0 or MIT licences, fostering community collaboration and transparency.\\\\\\\\n\\\\\\\\n&nbsp; \\\\\\\\n# 6. Multi-Gateway Decentralisation\\\\\\\\n\\\\\\\\nWith Liquify providing the foundational infrastructure layer for decentralised RPC protocols, NEAR can be widely supported on numerous gateways. This would be the first time NEAR would have full support, including archival, on these protocols.\\\\\\\\n\\\\\\\\nBy enabling NEAR on these RPC protocols, NEAR developers will have multiple gateway options, providing unique UXs, payment methods, and pricing structures. NEAR developers do not have to be locked into any single gateway.  \\\\\\\\nLiquify enables NEAR to have true decentralisation and gateway choice.\\\\\\\\n\\\\\\\\n![Multi-Gateway Decentralisation](https://ipfs.near.social/ipfs/bafkreigjuyw2l7jinng7jqoz4xwaj3k5zi55sncpy2bkdbmz3bhzhygwie)\\\\\\\\n\\\\\\\\n- *Liquify Gateway - [https://www.liquify.com/](https://www.liquify.com/)*\\\\\\\\n\\\\\\\\n![LAVA Gateway](https://ipfs.near.social/ipfs/bafkreiauqtvn5kbkrdcndb7nbizujqz5bqakmg54zr33uofbh4gvvuk5j4)\\\\\\\\n\\\\\\\\n- *LAVA Gateway - [https://gateway.lavanet.xyz/](https://gateway.lavanet.xyz/)*\\\\\\\\n\\\\\\\\n![Grove Gateway](https://ipfs.near.social/ipfs/bafkreidffuv3wweqdkqxs4t4iefcglcpemzocjlo7zkdjlghzmeo6jixqi)\\\\\\\\n\\\\\\\\n- *Grove Gateway (powered by POKT) - [https://grove.city](https://grove.city/)*\\\\\\\\n\\\\\\\\n![dRPC Gateway](https://ipfs.near.social/ipfs/bafkreidyprzevqvnutwe3h7fpn57t5fudhyb5p277dvfbdwgjawmp2jhkm)\\\\\\\\n\\\\\\\\n- *dRPC Gateway - [https://drpc.org/](https://drpc.org/)*\\\\\\\\n\\\\\\\\n# 7. Goals / Milestones\\\\\\\\n\\\\\\\\n**Goal 1: Transition Planning and Knowledge Transfer**  \\\\\\\\n*Completion by November 1, 2024*\\\\\\\\n\\\\\\\\n- Conduct workshops with Pagoda and NEAR teams to outline the transition strategy.\\\\\\\\n- Develop a comprehensive knowledge transfer document detailing the current infrastructure setup.\\\\\\\\n- Help test with the community focused on snapshot repair\\\\\\\\n\\\\\\\\n**Goal 2: Infrastructure Deployment**  \\\\\\\\n*Completion by December 1, 2024*\\\\\\\\n\\\\\\\\n- Deploy Liquify\\\\\\\\\\\\'s infrastructure for NEAR mainnet and testnet RPC services.\\\\\\\\n- Begin deployment of NEAR Archival across the globe in collaboration with the community focused on snapshot repair.\\\\\\\\n- Implement rate-limited free-tier services for developers.\\\\\\\\n- Share initial performance report.\\\\\\\\n- Fully support NEAR on supported decentralised infrastructure protocols\\\\\\\\n\\\\\\\\n**Goal 3: Performance Optimization and SLA Implementation**  \\\\\\\\n*Completion by February 1, 2024*\\\\\\\\n\\\\\\\\n- Launch Liquify\\\\\\\\\\\\'s NEAR portal\\\\\\\\n- Optimise infrastructure performance and implement the SLA.\\\\\\\\n- Establish external status pages and alerting systems for real-time monitoring.\\\\\\\\n\\\\\\\\n**Goal 4: Community Engagement + Enchanced Decentralization**  \\\\\\\\n*Completion by March 1, 2025*\\\\\\\\n\\\\\\\\n- Engage the developer community through workshops and/or webinars.\\\\\\\\n- Advocate for increased NEAR exposure on existing and future decentralised infrastructure protocols\\\\\\\\n\\\\\\\\n# 8. Metrics\\\\\\\\n\\\\\\\\n**Key Metrics for Success**\\\\\\\\n\\\\\\\\n- Uptime and Performance: Achieving 99.95% uptime and sub-200ms response time for mainnet RPC.\\\\\\\\n- User Adoption: Number of developers and dApps using the Liquify RPC portal, and seeing NEAR continually supported on decentralised protocols LAVA, POKT and possibly others.\\\\\\\\n- Community Engagement: Participation in workshops and feedback from NEAR developers.\\\\\\\\n\\\\\\\\n**Measurement Plan**\\\\\\\\n\\\\\\\\n- Continuous monitoring through Liquify\\\\\\\\\\\\'s dashboard and other protocols.\\\\\\\\n- Monthly reports to the NEAR Foundation on SLA compliance, user adoption, and community feedback.\\\\\\\\n\\\\\\\\n# 9. Competitor Comparison\\\\\\\\n\\\\\\\\n**Competitor Analysis**\\\\\\\\n&nbsp; \\\\\\\\n- **Standard Providers:** Most RPC services rely on the cloud or hardware rental services for their infrastructure, making deployment significantly more challenging when trying to establish world coverage. These providers are subject to changing rental costs, hardware availability, usage agreements, etc. Liquify is unique in it owns all of their hardware, ensuring complete global coverage of our services.\\\\\\\\n- **Decentralised Providers:** While they align with the ethos of decentralisation, they often struggle with performance and reliability issues due to fragmented infrastructure.\\\\\\\\n\\\\\\\\n**Unique Value Proposition**  \\\\\\\\nLiquify bridges the gap between these two models, providing a hybrid solution that combines the high performance and reliability of centralised infrastructure with the resilience and decentralisation of protocols. This makes us uniquely capable of supporting NEAR\\\\\\\\\\\\'s needs as it transitions to a more decentralised future.\\\\\\\\n\\\\\\\\n&nbsp; \\\\\\\\n# 10. Usage & Examples\\\\\\\\n\\\\\\\\n**Current Users**\\\\\\\\n\\\\\\\\n- Infura: Liquify serves as the primary backup infrastructure to Infura, serving the lion share of all requests going through [DIN](https://www.infura.io/solutions/decentralized-infrastructure-service) due to our response times and reliability.\\\\\\\\n- Defi Kingdoms: Liquify\\\\\\\\\\\\'s infrastructure successfully managed over 1 billion RPC requests a day with minimal latency and a 99.9999% success rate.\\\\\\\\n- TRGC: Supported their portfolio companies with efficient, cost-effective infrastructure solutions, demonstrating our ability to handle mission-critical systems.\\\\\\\\n\\\\\\\\n**Potential Use Cases**\\\\\\\\n\\\\\\\\n- NEAR developers that require stable and high-performance RPC access, with a user experience similar to other ecosystems.\\\\\\\\n- dApps wanting a true decentralised experience through decentralised RPC protocols, knowing that Liquify is providing a reliable, fast, core infrastructure.\\\\\\\\n\\\\\\\\n**Scalability Examples**  \\\\\\\\nLiquify has demonstrated the ability to scale infrastructure to handle up to 200,000 requests per minute, far exceeding NEAR\\\\\\\\\\\\'s current traffic requirements. We have consistently delivered high-quality, high-performance RPC services, supporting 60+ chains, including NEAR, to customers directly or through decentralised RPC protocols. This scalability will support NEAR\\\\\\\\\\\\'s growth and ensure reliable service for developers and users.\\\\\\\\n\\\\\\\\n&nbsp; \\\\\\\\n# 11. Budget\\\\\\\\n\\\\\\\\n**Inititial Budget: $171,000 for the first 6 months.**\\\\\\\\n\\\\\\\\n- Initial Setup and On-boarding: $8,500 (October 2024)\\\\\\\\n  - Deploying full nodes, archival nodes, indexes, and setting up support infrastructure.\\\\\\\\n- Community Reward: $12,500 for the community members assisting with archival snapshot repair.\\\\\\\\n- Monthly Maintenance: $35,000/month (November 2024 - March 2025)\\\\\\\\n  - Infrastructure cost, maintenance, and network upgrades.\\\\\\\\n  - Free-tier traffic coverage\\\\\\\\n  - Customer support\\\\\\\\n\\\\\\\\n**Renewal Budget: $150,000 for the next 6 months.**\\\\\\\\n\\\\\\\\n- Monthly Maintenance: $35,000/month (April 2025 - September 2025)\\\\\\\\n  - Infrastructure cost, maintenance, and network upgrades.\\\\\\\\n  - Free-tier traffic coverage\\\\\\\\n  - Customer support\\\\\\\\n\\\\\\\\n# 12. Security and Compliance\\\\\\\\n\\\\\\\\n**Security Measures**\\\\\\\\n\\\\\\\\n- Comprehensive DDoS protection, IP whitelisting, and detailed logging and monitoring.\\\\\\\\n- Custom tools for disaster recovery and incident management, ensuring high availability and resilience.\\\\\\\\n- Leading EDR software running on all our hosts\\\\\\\\n\\\\\\\\n**Disaster Recovery Plan**\\\\\\\\n\\\\\\\\n- Regular backups and a robust disaster recovery protocol ensure service continuity and data integrity, with the ability to recover from any disruptions quickly and efficiently.\\\\\\\\n\\\\\\\\n**Compliance and Data Integrity**\\\\\\\\n\\\\\\\\n- Adherence to NEAR\\\\\\\\\\\\'s data consistency requirements and transparent communication of any service disruptions or changes. Liquify commits to providing a secure and compliant infrastructure that aligns with NEAR\\\\\\\\\\\\'s operational standards.\\\\\\\\n\\\\\\\\n# 13. Service Level Agreement (SLA)\\\\\\\\n\\\\\\\\n**Uptime Guarantee:**  \\\\\\\\n99.95% monthly uptime, ensuring minimal service interruptions and maintaining the high availability of NEAR\\\\\\\\\\\\'s RPC services.\\\\\\\\n\\\\\\\\n**Performance Standards** *\\\\\\\\n\\\\\\\\n- Mainnet RPC: Average response time \\\\\\\\u{2264} 200 milliseconds.\\\\\\\\n- Testnet RPC: Average response time \\\\\\\\u{2264} 200 milliseconds.\\\\\\\\n- Archival-RPC: Average response time \\\\\\\\u{2264} 500 milliseconds.\\\\\\\\n\\\\\\\\n\\\\\\\\\\\\\\\\* From calls within EU, US and APAC\\\\\\\\n\\\\\\\\n**Throughput**\\\\\\\\n\\\\\\\\n- RPC Mainnet: Peak spike of 20k per/s\\\\\\\\n- RPC-Archival Mainnet: Peak spike of 5k per/s\\\\\\\\n- RPC Testnet: Peak spikes of 1k requests/s\\\\\\\\n- RPC-Archival Testnet: Peak spikes of 500 requests/s\\\\\\\\n\\\\\\\\n**Support Availability**\\\\\\\\n\\\\\\\\n- Community-based support with best-effort responses within 24-48 hours for generic services, ensuring quick and efficient resolution of issues.\\\\\\\\n\\\\\\\\n# 14. Support and Maintenance\\\\\\\\n\\\\\\\\n**Community Support**\\\\\\\\n\\\\\\\\n- Dedicated support channels on Slack, Telegram, and Discord for developer assistance and issue resolution.\\\\\\\\n- Regular updates and bug fixes based on community feedback, ensuring a responsive and engaged support experience.\\\\\\\\n\\\\\\\\n**Ongoing Maintenance**\\\\\\\\n\\\\\\\\n- Continuous infrastructure monitoring and optimization, with regular collaboration with NEAR developers for client improvements and upgrades.\\\\\\\\n- Monthly performance reviews and reports to the NEAR Foundation, ensuring transparency and accountability.\\\\\\\\n\\\\\\\\n# 15. Governance and Compliance\\\\\\\\n\\\\\\\\n**Governance Structure**\\\\\\\\n\\\\\\\\n- Defined roles and responsibilities within the Liquify team for project management, technical leadership, and customer support, ensuring clear accountability and effective decision-making.\\\\\\\\n- Regular communication and reporting to NEAR stakeholders to maintain transparency and alignment with NEAR\\\\\\\\\\\\'s goals.\\\\\\\\n\\\\\\\\n**Reporting**\\\\\\\\n\\\\\\\\n- Monthly progress reports to the NEAR Foundation, including updates on project milestones, SLA compliance, and community engagement.\\\\\\\\n- Transparent communication of any changes or updates to the project plan, ensuring that all stakeholders are informed and aligned.\\\\\\\\n\\\\\\\\n# 16. Conclusion\\\\\\\\n\\\\\\\\nLiquify\\\\\\\\\\\\'s unique combination of high-performance, centralised service quality and decentralised resilience makes us the ideal partner for managing NEAR\\\\\\\\\\\\'s RPC infrastructure. Our fully-owned bare-metal infrastructure, extensive experience with the NEAR ecosystem, and commitment to decentralisation position us to provide a scalable, reliable, and future-proof solution.\\\\\\\\n&nbsp; \\\\\\\\nWe invite the NEAR Foundation to collaborate with Liquify in transitioning and enhancing the current RPC infrastructure. Together, we can ensure that the NEAR ecosystem continues to grow and thrive with a robust, decentralised infrastructure that supports its long-term vision and goals.\", \"linked_proposals\": [], \"receiver_account\": \"liquify.near\", \"requested_sponsor\": \"infrastructure-committee.near\", \"proposal_body_version\": \"V1\", \"requested_sponsorship_usd_amount\": \"321000\", \"requested_sponsorship_paid_in_currency\": \"USDC\"}, \"labels\": []}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.9021424764006e+21
    }
  },
  {
    "id": "9665617291",
    "receipt_id": "6YqWrFkobRKSWdxLWjdAUH7RVE5uZsjZkXYeb2wn9YnC",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "social.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "7qEmPbiwCDfKYV9kxCgzN4FBXF7uXfXNfBHjnTxDg5dg",
      "block_height": 131568509,
      "block_timestamp": 1730310360793735000
    },
    "receipt_outcome": {
      "gas_burnt": 3517347581425,
      "tokens_burnt": 351734758142500000000,
      "executor_account_id": "social.near",
      "status": true
    },
    "transaction_hash": "EWzc96kBVWM45e7v7DHWkzYQ87DgvKumfCDNbfDNWhHb",
    "included_in_block_hash": "HUV7qcWfQp8N7dnoPFcqp1HMb9BKVt7AcgukPBVbatRC",
    "block_timestamp": "1730310358541330982",
    "block": {
      "block_height": 131568507
    },
    "receipt_conversion_tokens_burnt": "123588922647000000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set",
        "deposit": 0,
        "fee": 351734758142500000000,
        "args": "{\"data\": {\"infrastructure-committee.near\": {\"index\": {\"notify\": \"{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"shane0.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"proposal/edit\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"proposal\\\\\\\\\\\\\\\":51,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"trechriron71.near\\\\\\\\\\\\\\\"}}\"}}}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.9021424764006e+21
    }
  },
  {
    "id": "9665625302",
    "receipt_id": "DG6LYrHe1h1VdNJzYfzXDwEWLU1MDpeHtitXYg8ubEDv",
    "predecessor_account_id": "trechriron71.near",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "418zpqXoWXdGTArbMM47rg9Z7471mZsx6ZaJyv7Z6noE",
      "block_height": 131568546,
      "block_timestamp": 1730310402674485200
    },
    "receipt_outcome": {
      "gas_burnt": 12057042968732,
      "tokens_burnt": 1.2057042968732e+21,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "Fi1YsUycLsyCWDaZMDrdvKSB88wX6S6QZgA7xZK3TBBE",
    "included_in_block_hash": "8Fc2cGRDsT6GKP6SLLiUAbt9XU5W6ECCDJbPvUVLKdSR",
    "block_timestamp": "1730310401538720926",
    "block": {
      "block_height": 131568545
    },
    "receipt_conversion_tokens_burnt": "130650880838500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "edit_proposal",
        "deposit": 0,
        "fee": 1.2057042968732e+21,
        "args": "{\"id\": 50, \"body\": {\"name\": \"NEAR Data Integration into KYVE\\\\\\\\u{2019}s Decentralized Data Lake\", \"summary\": \"As NEAR\\\\\\\\u{2019}s data infrastructure undergoes significant changes with Pagoda winding down, there is a growing need for decentralized and validated data solutions to ensure secure and scalable access to NEAR\\\\\\\\u{2019}s blockchain data. This proposal outlines a phased approach to integrate NEAR\\\\\\\\u{2019}s blockchain data into KYVE\\\\\\\\u{2019}s Web3 data lake, enabling validated and permanently stored data streams for developers, analysts, and businesses within the NEAR ecosystem.\", \"category\": \"Infrastructure Committee\", \"timeline\": {\"status\": \"REJECTED\", \"sponsor_requested_review\": false, \"reviewer_completed_attestation\": false}, \"linked_rfp\": 3, \"supervisor\": \"trechriron71.near\", \"description\": \"# NEAR Data Integration into KYVE\\\\\\\\u{2019}s Decentralized Data Lake\\\\\\\\n\\\\\\\\n**Description:**\\\\\\\\n\\\\\\\\nThis is a combined proposal for the following RFPs: [NEAR Lake](https://dev.near.org/infrastructure-committee.near/widget/app?page=rfp&id=3), [BigQuery, and Data Pipelines](https://dev.near.org/infrastructure-committee.near/widget/app?page=rfp&id=4). It also includes a **Trustless** **API** to query NEAR historical data, with the long-term vision of decentralizing the NEAR data infrastructure and turning NEAR data into a public good.\\\\\\\\n\\\\\\\\n## **Project Abstract**\\\\\\\\n\\\\\\\\nAs NEAR\\\\\\\\u{2019}s data infrastructure undergoes significant changes with Pagoda winding down, there is a **growing need for decentralized and validated data solutions** to ensure secure and scalable access to NEAR\\\\\\\\u{2019}s blockchain data. This proposal outlines a phased approach to integrate NEAR\\\\\\\\u{2019}s blockchain data into KYVE\\\\\\\\u{2019}s Web3 data lake, enabling validated and permanently stored data streams for developers, analysts, and businesses within the NEAR ecosystem.\\\\\\\\n\\\\\\\\n**What is KYVE?**\\\\\\\\n\\\\\\\\nKYVE, a data validation and transfer protocol,  enables data providers to standardize, validate, and permanently store data streams. It leverages permanent data storage solutions like Arweave and uses its own Layer-1 Blockchain, ensuring the scalability, immutability, and availability of archived data over time.\\\\\\\\n\\\\\\\\nKYVE\\\\\\\\\\\\'s Network is powered by decentralized validators, which are rewarded in $KYVE and other tokens ([https://docs.kyve.network/](https://docs.kyve.network/)).\\\\\\\\n\\\\\\\\n## **Objectives**\\\\\\\\n\\\\\\\\nThe goal of this integration is to create a robust and sustainable data infrastructure for the NEAR ecosystem. Unlike centralized solutions, KYVE relies on a network of decentralized providers to store, validate, and serve blockchain data. This reduces the risk of single points of failure and removes dependencies on centralized services.\\\\\\\\n\\\\\\\\nThe integration of NEAR\\\\\\\\u{2019}s blockchain data into KYVE\\\\\\\\\\\\'s decentralized data lake ensures long-term availability, immutability, and verifiability. By utilizing decentralized storage providers like Arweave, NEAR data becomes a public good, eliminating the need for centralized services and reducing risks. KYVE\\\\\\\\u{2019}s built-in tools, including the Trustless API and Data Load Tool, provide seamless access to validated data, future-proofing NEAR\\\\\\\\u{2019}s data infrastructure.\\\\\\\\n\\\\\\\\n## **Outcomes**\\\\\\\\n\\\\\\\\nThe integration of NEAR\\\\\\\\u{2019}s blockchain data into KYVE\\\\\\\\u{2019}s decentralized data lake will deliver significant benefits across three major products: KYVE Data Lake, Data Load Tool, and Trustless API.\\\\\\\\n\\\\\\\\n**1. KYVE\\\\\\\\u{2019}s Decentralized Data Lake ([https://app.kyve.network/#/sources](https://app.kyve.network/#/sources))**\\\\\\\\n\\\\\\\\nNEAR\\\\\\\\u{2019}s blockchain data is validated by KYVE and stored on Arweave, ensuring permanent, decentralized storage. Validators are rewarded in $NEAR for maintaining data accuracy, reducing reliance on centralized services and securing the long-term availability of NEAR data as a public good.\\\\\\\\n\\\\\\\\n**2. Data Load Tool Support ([https://docs.kyve.network/access-data-sets/data-pipeline/overview](https://docs.kyve.network/access-data-sets/data-pipeline/overview))**\\\\\\\\n\\\\\\\\nKYVE\\\\\\\\u{2019}s Data Load Tool streamlines transferring NEAR blockchain data to external warehouses like BigQuery and Postgres, removing the need for custom pipelines. With Load and Sync commands, data is kept fresh and accessible for analysis. Additional steps enable full schematization for deeper insights.\\\\\\\\n\\\\\\\\n**3. Trustless API ([https://docs.kyve.network/access-data-sets/trustless-api/overview](https://docs.kyve.network/access-data-sets/trustless-api/overview))**\\\\\\\\n\\\\\\\\nKYVE\\\\\\\\u{2019}s Trustless API offers verifiable, decentralized access to historical and live NEAR data (2-minute latency), secured by Merkle Proofs. Developers can easily integrate data into applications via well-known endpoints. The open-source tool enables independent deployment for scalability without stressing node infrastructure.\\\\\\\\n\\\\\\\\n## **Project Team**\\\\\\\\n\\\\\\\\n*This is a joint proposal by KYVE Foundation & BCP Innovations, combining deep expertise in decentralized data infrastructure with a strong commitment to driving innovation in Web3 technologies. Together, we are committed to creating a secure, decentralized, and robust data ecosystem for the NEAR blockchain through KYVE\\\\\\\\u{2019}s cutting-edge solutions.*\\\\\\\\n\\\\\\\\n**KYVE Foundation**\\\\\\\\n\\\\\\\\nThe KYVE Foundation supports the development and growth of KYVE\\\\\\\\u{2019}s decentralized data infrastructure, with a strong emphasis on decentralization, security, and data integrity. Backed by key industry players, KYVE ensures secure and scalable data solutions for leading blockchain ecosystems like Cosmos Hub, Celestia, Archway, dYdX, and others.\\\\\\\\n\\\\\\\\n**BCP Innovations**\\\\\\\\n\\\\\\\\nBCP Innovations is a German Web3 development company specializing in blockchain infrastructure and decentralized applications. As the team behind KYVE, BCP Innovations delivers secure data validation and permanent storage. For the NEAR-KYVE integration, BCP will build secure data pipelines to ensure NEAR\\\\\\\\\\\\'s blockchain data remains available and immutable.\\\\\\\\n\\\\\\\\n**Project Team:**\\\\\\\\n\\\\\\\\n**Fabian Riewe: BCP CEO and KYVE Founder,**- ([https://github.com/fabianriewe](https://github.com/fabianriewe)) - [fabian@kyve.network](mailto:fabian@kyve.network)\\\\\\\\n\\\\\\\\n**Maximilian Breithecker:** Data Engineer and Blockchain Developer,  ([https://github.com/mbreithecker](https://github.com/mbreithecker)) - [max@kyve.network](mailto:max@kyve.network)\\\\\\\\n\\\\\\\\n**Troy Kessler:** Protocol Developer,  [https://github.com/troykessler](https://github.com/troykessler) - troy@kyve.network\\\\\\\\n\\\\\\\\n**Christopher Brumm:** Developer [https://github.com/christopherbrumm](https://github.com/christopherbrumm) - [christopher@kyve.network](mailto:christopher@kyve.network)\\\\\\\\n\\\\\\\\nFor more details on BCP contributions, please see the Github repositories. All tools from this integration will be released under an **Open Source license**, ensuring transparency, community collaboration, and wide adoption.\\\\\\\\n\\\\\\\\n- [https://github.com/KYVENetwork/chain](https://github.com/KYVENetwork/chain)\\\\\\\\n- [https://github.com/KYVENetwork/kyvejs](https://github.com/KYVENetwork/kyvejs)\\\\\\\\n- https://github.com/KYVENetwork/kyve-dlt\\\\\\\\n- [https://github.com/KYVENetwork/trustless-api](https://github.com/KYVENetwork/trustless-api)\\\\\\\\n- [https://github.com/KYVENetwork/ksync](https://github.com/KYVENetwork/ksync)\\\\\\\\n- [https://docs.kyve.network/](https://docs.kyve.network/)\\\\\\\\n\\\\\\\\n## **Usage & Examples**\\\\\\\\n\\\\\\\\n**Current Users of KYVE\\\\\\\\\\\\'s Decentralized Data Lake**\\\\\\\\n\\\\\\\\n**KYVE** serves as the trusted data infrastructure for leading blockchain ecosystems like **Celestia, Osmosis, dYdX**, and **more**  ensuring their on-chain data is securely validated and permanently stored through decentralized storage solutions like **Arweave**. These projects use KYVE to maintain the integrity, accessibility, and reliability of their mission-critical blockchain data without needing to manage complex, centralized infrastructure. By using KYVE, they benefit from decentralized validation and long-term storage, ensuring data remains immutable and available for future use as a public good. [https://app.kyve.network/#/sources](https://app.kyve.network/#/sources)\\\\\\\\n\\\\\\\\n**Statistics:**\\\\\\\\n\\\\\\\\n- **+70M Transactions**\\\\\\\\n- **+7,87 TB validated and archived on Arweave (Mainnet)**\\\\\\\\n- **+18.54 TB validated and archived on Testnet**\\\\\\\\n\\\\\\\\nKYVE continues to scale its infrastructure, making it a cornerstone for secure and scalable data management in Web3 ecosystems.\\\\\\\\n\\\\\\\\n**Google BigQuery Data Sets:**\\\\\\\\n\\\\\\\\nLeveraging KYVE\\\\\\\\u{2019}s data load pipeline, BCP Innovations has published several datasets, such as those for **Osmosis**, **dYdX, Celestia, Noble** making it significantly easier for developers and data analysts to access and use blockchain data without needing to sync it from scratch. This eliminates the time-consuming process of syncing large amounts of historical data, allowing users to quickly query and analyze data. By providing pre-synced, validated datasets, KYVE reduces infrastructure overhead, enhances data accessibility, and enables faster development cycles for applications that rely on blockchain data.\\\\\\\\n\\\\\\\\n[https://console.cloud.google.com/bigquery/analytics-hub/exchanges/projects/36527693454/locations/eu/dataExchanges/kyve_public_datasets_191a23b668b/listings/osmosis_191a28703d2](https://console.cloud.google.com/bigquery/analytics-hub/exchanges/projects/36527693454/locations/eu/dataExchanges/kyve_public_datasets_191a23b668b/listings/osmosis_191a28703d2)\\\\\\\\n\\\\\\\\n**Potential Use Cases for the NEAR <> KYVE Integration**\\\\\\\\n\\\\\\\\nNEAR Developers: KYVE\\\\\\\\u{2019}s decentralized data lake gives NEAR developers free access to validated, trustless data, eliminating the need for costly centralized services. This ensures a consistent, secure, and reliable infrastructure for applications.\\\\\\\\n\\\\\\\\ndApps and Blockchain Analytics: Decentralized applications and analytics platforms can rely on KYVE to validate and archive NEAR data in a fully decentralized way, ensuring data integrity and reducing reliance on centralized systems, while enabling in-depth analysis and insights.\\\\\\\\n\\\\\\\\n**Proof of Concept: NEAR Trustless API Demo:**\\\\\\\\n\\\\\\\\nThe **Trustless API** enables developers to seamlessly connect their applications and dApps to verified blockchain data. Each data item is verified with a **Merkle Proof** (included in the http header), ensuring the integrity and trustworthiness of the data accessed.\\\\\\\\n\\\\\\\\nYou can explore NEAR blocks using the Trustless API:\\\\\\\\n\\\\\\\\n- **First NEAR block**: [Block #127590000](https://staging-613b8d89-data.services.kyve.network/near/value?height=127590000)\\\\\\\\n- **Last NEAR block**: [Block #127591973](https://staging-613b8d89-data.services.kyve.network/near/value?height=127591973)\\\\\\\\n\\\\\\\\nThis ensures that all data retrieved through the API is cryptographically verified and secure for use in any decentralized application.\\\\\\\\n\\\\\\\\n# **Milestones**\\\\\\\\n\\\\\\\\n**Milestone 1: NEAR Runtime Development & Testnet Deployment**\\\\\\\\n\\\\\\\\n*Completion by January 31, 2025*\\\\\\\\n\\\\\\\\n- **Develop NEAR runtime** to enable the retrieval and validation of NEAR blocks and chunks (txs and receipts are included in the chunks).\\\\\\\\n- **Collaborate with NEAR team** and **Community** to ensure smooth integration and alignment.\\\\\\\\n- **Upload validated data to Arweave** for permanent decentralized storage. After testing is complete, the testnet pool will switch and continue uploading to the KYVE storage provider, a centralized storage solution for testnet operations.\\\\\\\\n- **Test the NEAR runtime on KYVE\\\\\\\\u{2019}s testnet (Kaon)** to validate data retrieval, storage processes, and functionality. This includes a beta-testing phase with KYVE/NEAR Validators.\\\\\\\\n- After successful testing, **prepare for mainnet deployment**.\\\\\\\\n\\\\\\\\n---\\\\\\\\n\\\\\\\\n**Milestone 2: KYVE Data Pool Deployment on Mainnet & Base Functionality Release**\\\\\\\\n\\\\\\\\n*Completion by February 1, 2025*\\\\\\\\n\\\\\\\\n- **Deploy the KYVE NEAR data pool** on mainnet to handle data extraction, validation, and permanent storage.\\\\\\\\n- Release **base functionalities** of the KYVE **Data Pipeline** and **Trustless API** for community access to validated NEAR data.\\\\\\\\n- **Integrate NEAR tokens** into the KYVE ecosystem based on existing NEAR-IBC bridges or other solutions, to fund the data pool and incentivize validators for maintaining the pool.\\\\\\\\n- **Collaborate with NEAR community** to ensure smooth deployment and provide initial performance reports for monitoring.\\\\\\\\n\\\\\\\\n---\\\\\\\\n\\\\\\\\n**Milestone 3: Performance Optimization, Maintenance & Optional Advanced Data Transformations**\\\\\\\\n\\\\\\\\n*Completion by March 1, 2025*\\\\\\\\n\\\\\\\\n- **Maintain and optimize the KYVE NEAR integration** for efficient data streaming, validation, and storage.\\\\\\\\n- **Monitor performance** and implement improvements based on usage and community feedback.\\\\\\\\n- **Host workshops and webinars** to engage the developer community and showcase the full capabilities of the KYVE NEAR integration.\\\\\\\\n- **Optional**: Develop advanced data transformations using **DBT (Data Build Tool)** to convert raw NEAR data into schematized BigQuery tables for advanced analytics and reporting.\\\\\\\\n\\\\\\\\n---\\\\\\\\n\\\\\\\\n**Milestone 4: Transition Planning & Knowledge Transfer**\\\\\\\\n\\\\\\\\n*Completion by December 31, 2025*\\\\\\\\n\\\\\\\\n- **Conduct workshops** with NEAR teams (Infrastructure Committee) to develop a detailed transition plan to KYVE\\\\\\\\u{2019}s decentralized data infrastructure.\\\\\\\\n- **Prepare a comprehensive knowledge transfer document** that outlines NEAR\\\\\\\\u{2019}s current infrastructure and the steps for transitioning to KYVE.\\\\\\\\n\\\\\\\\n## **Budget**\\\\\\\\n\\\\\\\\nA KYVE data pool requires ongoing funding to operate. This funding can be provided by any party interested in having the data archived, validated, and made publicly accessible. The funds are distributed to the protocol validators and their delegators, who ensure the data is securely validated and uploaded. If the pool runs out of funds, the uploading stops, but the previously archived data remains accessible as a public good.\\\\\\\\n\\\\\\\\n**Why Arweave?**\\\\\\\\n\\\\\\\\nAmazon S3 charges for the entire archive every month, which can add up significantly over time, especially for large volumes of data. In contrast, with Arweave, you pay a single upfront fee for permanent storage. This model drastically reduces long-term costs, making it ideal for archives where data needs to be retained indefinitely without the burden of recurring monthly payments. Additionally, Arweave allows for free data retrieval, eliminating another cost that can become substantial with traditional cloud providers. Another key advantage of Arweave is its decentralized storage model, which distributes data across a global network, increasing resilience and security by removing any single point of failure. By choosing Arweave over S3 in this proposal, the goal is to minimize long-term storage expenses while benefiting from the resilience, decentralization, and free data access that Arweave offers.\\\\\\\\n\\\\\\\\nThe cost for the integration will be split as follows:\\\\\\\\n\\\\\\\\n- 1) Initial Integration\\\\\\\\n- 2) Data Pool Funding\\\\\\\\n- 3) Maintenance\\\\\\\\n\\\\\\\\n### **Phase 1) Initial Integration -** **$60 000  (Deliverables as per Milestone 1)**\\\\\\\\n\\\\\\\\nDevelop the NEAR Runtime for KYVE to enable seamless retrieval and validation of NEAR blocks and chunks in collaboration with the NEAR team and NEAR ecosystem partners.\\\\\\\\n\\\\\\\\n- Implement functionality for uploading validated NEAR data to Arweave, ensuring permanent, decentralized storage.\\\\\\\\n- Conduct extensive testing of the NEAR runtime on KYVE\\\\\\\\u{2019}s testnet (Kaon) to validate the efficiency of data retrieval, validation, and storage processes.\\\\\\\\n- Upon successful testing and validation on the testnet, proceed with preparations for the mainnet deployment.\\\\\\\\n- Assuming a total of 600h development work divided between BCP and the validators based on $100/h.\\\\\\\\n\\\\\\\\nThis process will require two developers over a period of two months, as well as infrastructure costs (such as a NEAR archival node) to facilitate the integration testing. Additionally, collaboration with the NEAR team will be necessary to perform research and set up a customized Trustless API for optimized data access.\\\\\\\\n\\\\\\\\n### **Phase 2) Continuous Funding and Maintenance (Deliverables as per Milestone 2-4)**\\\\\\\\n\\\\\\\\n### **Option 1: Fixed Payment through Grant $335,000**\\\\\\\\n\\\\\\\\n**Historical NEAR Data Pool Funding (Genesis to current live height) - $175,000**\\\\\\\\n\\\\\\\\nThe funding costs mainly consist of storage expenses and the incentivization premium for validators to upload data. For this example, our suggestion is to use Arweave as the storage provider.\\\\\\\\n\\\\\\\\nIt can be estimated that the NEAR raw data size, with compression, is going to be around 6.5TB, based on the current size of BigQuery tables.\\\\\\\\n\\\\\\\\nCost Breakdown:\\\\\\\\n\\\\\\\\n1. **Storage on Arweave: $105,000**\\\\\\\\n    \\\\\\\\n    Calculated using the current rate for Arweave storage via AR Turbo: 6.5TB * 16.36 USD/GB\\\\\\\\n    \\\\\\\\n2. **Buffer for AR Price Fluctuation: $25,000**\\\\\\\\n    \\\\\\\\n    Includes a 25% buffer for potential AR price increases\\\\\\\\n    \\\\\\\\n3. **Validator Incentivization: $45,000**\\\\\\\\n    \\\\\\\\n    Cost to incentivize validators for data uploading and validation\\\\\\\\n    \\\\\\\\n\\\\\\\\n**Live Data Pool (Future Blocks) - $60,000, payable in monthly installments of $5,000 for one year**\\\\\\\\n\\\\\\\\nAs NEAR\\\\\\\\u{2019}s blockchain continues to grow, BCP will establish a **live data pool** to handle ongoing data from the moment of deployment on mainnet. While the historical data is managed through existing historical data pools, this live data pool will sync in real-time from NEAR\\\\\\\\u{2019}s **live height** upon deployment. The costs for this include **storage on Arweave** and the incentivization of **KYVE validators** for validating and uploading the data.\\\\\\\\n\\\\\\\\nBased on NEAR\\\\\\\\u{2019}s block speed of **1.09 seconds** and an average block size of **50KB**, the following costs are estimated: **Total Monthly Costs: $5,000**\\\\\\\\n\\\\\\\\n- **Storage on Arweave**: 3.96 GB per month (approx.) $2,000\\\\\\\\n- **Buffer for Arweave Price Fluctuations (up to 50%)**: $1,000\\\\\\\\n- **Validator Incentivization**: $2,000\\\\\\\\n\\\\\\\\n![https://ipfs.near.social/ipfs/bafkreic52g47ny6rph4ljnbma6htnd6xqqy2eobie7hh4oulabdtwmphgi](https://ipfs.near.social/ipfs/bafkreic52g47ny6rph4ljnbma6htnd6xqqy2eobie7hh4oulabdtwmphgi)\\\\\\\\n\\\\\\\\n*All Data Pool funding will be directly forwarded to the corresponding NEAR data pools on KYVE.*\\\\\\\\n\\\\\\\\n**Maintenance - $100,000, payable in 10 monthly installments of $10,000**\\\\\\\\n\\\\\\\\nThis includes the maintenance of the data pool over a year in order to maintain it and follow the upgrade path, to support the validators archiving the NEAR data, and the maintenance and improvement of the Trustless API and of the Data Pipeline.\\\\\\\\n\\\\\\\\n- The above pricing includes reading data from the Trustless API and using the Data Pipeline by any data user.\\\\\\\\n\\\\\\\\nIf the total of the grant is not used, the remaining part will be returned or used to continue the funding. Once the funding is spent, the data and tooling remain accessible as a public good.\\\\\\\\n\\\\\\\\n### **Option 2: Public Good Funding (KYVE Foundation runs a validator to cover the costs)**\\\\\\\\n\\\\\\\\nKYVE\\\\\\\\\\\\'s Public Goods Funding Program is an alternative way to provide funding for the data pools and cover the maintenance.\\\\\\\\n\\\\\\\\nTo integrate NEAR\\\\\\\\u{2019}s data, KYVE requests a validator delegation from the NEAR Foundation. KYVE uses the returns from this delegation to fund the operation of a Public Good pool. This pool ensures that NEAR\\\\\\\\u{2019}s historical and live data is validated, stored, and continuously synced to live height without the need for costly archival nodes.\\\\\\\\n\\\\\\\\n- Delegation: NEAR delegates tokens to KYVE to run a Public Good validator node.\\\\\\\\n- Rewards: The data pool is funded by validator commission rewards, and both KYVE and NEAR validators receive tokens as rewards. The commission rewards should cover the costs associated with the operations of all data pools as well as the maintenance by BCP.\\\\\\\\n\\\\\\\\n![https://ipfs.near.social/ipfs/bafkreiccelx5qsyuo7e2h3ojrcd4ybeblr7fqfxagp6ophtv2lgeqdhqau](https://ipfs.near.social/ipfs/bafkreiccelx5qsyuo7e2h3ojrcd4ybeblr7fqfxagp6ophtv2lgeqdhqau)\\\\\\\\n\\\\\\\\nOffloads the need for NEAR to run its own expensive data infrastructure, allowing it to scale more easily. This mutually beneficial setup ensures NEAR\\\\\\\\u{2019}s data is maintained at minimal cost while enhancing the decentralization of its data infrastructure.\\\\\\\\n\\\\\\\\n# **Conclusion**\\\\\\\\n\\\\\\\\nKYVE\\\\\\\\\\\\'s decentralized data lake provides NEAR with a complete, valid, and accessible solution for managing blockchain data. By decentralizing storage and validation, NEAR\\\\\\\\u{2019}s data becomes a public good, easily accessible without reliance on centralized infrastructure. Tools like the Trustless API and Data Load Tool allow developers to leverage NEAR\\\\\\\\u{2019}s raw data for various use cases, unlocking new opportunities for growth and innovation.\\\\\\\\n\\\\\\\\nKYVE Foundation invites the NEAR Foundation to partner with KYVE in building a decentralized, secure, and scalable data infrastructure. Together, we can future-proof NEAR\\\\\\\\u{2019}s data landscape and empower its ecosystem with robust tools for continued success.\", \"linked_proposals\": [], \"receiver_account\": \"kyve_foundation.near\", \"requested_sponsor\": \"infrastructure-committee.near\", \"proposal_body_version\": \"V1\", \"requested_sponsorship_usd_amount\": \"395000\", \"requested_sponsorship_paid_in_currency\": \"NEAR\"}, \"labels\": []}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.6937007414238e+21
    }
  },
  {
    "id": "9665625675",
    "receipt_id": "CdPR1qCcZz9fZKCrmNnwSUvpGLdSebXCet3ovyJYVYtK",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "social.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "6oeM1mHmSJUACmxYtYMvFY4zefycdvA3W5uwB9qESmAu",
      "block_height": 131568547,
      "block_timestamp": 1730310403823868400
    },
    "receipt_outcome": {
      "gas_burnt": 3573455637121,
      "tokens_burnt": 357345563712100000000,
      "executor_account_id": "social.near",
      "status": true
    },
    "transaction_hash": "Fi1YsUycLsyCWDaZMDrdvKSB88wX6S6QZgA7xZK3TBBE",
    "included_in_block_hash": "8Fc2cGRDsT6GKP6SLLiUAbt9XU5W6ECCDJbPvUVLKdSR",
    "block_timestamp": "1730310401538720926",
    "block": {
      "block_height": 131568545
    },
    "receipt_conversion_tokens_burnt": "130650880838500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set",
        "deposit": 0,
        "fee": 357345563712100000000,
        "args": "{\"data\": {\"infrastructure-committee.near\": {\"index\": {\"notify\": \"{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"kyve_foundation.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"proposal/edit\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"proposal\\\\\\\\\\\\\\\":50,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"trechriron71.near\\\\\\\\\\\\\\\"}}\"}}}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.6937007414238e+21
    }
  },
  {
    "id": "9665640274",
    "receipt_id": "3Cc7rv82iVQJatUvVL2ngDBfbUeCwv8c6P2zpeE3mNSf",
    "predecessor_account_id": "trechriron71.near",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "8DBRkEFSTpDvcQvcdThdNKyseTTvqvDGmhmc65HaALCY",
      "block_height": 131568572,
      "block_timestamp": 1730310431560646400
    },
    "receipt_outcome": {
      "gas_burnt": 5083485967277,
      "tokens_burnt": 508348596727700000000,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "HNYnRoRbsTjrzozMkFwdePEaKUGW857E6cCAtSAV461m",
    "included_in_block_hash": "7YrjDjuh2VrTLp6Gx6aSauCPKxDDuZsLdnePUz1WzxKB",
    "block_timestamp": "1730310430440612307",
    "block": {
      "block_height": 131568571
    },
    "receipt_conversion_tokens_burnt": "49116496560000000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "edit_proposal",
        "deposit": 0,
        "fee": 508348596727700000000,
        "args": "{\"id\": 49, \"body\": {\"name\": \"Nodies: Multi-region indexer\", \"summary\": \"Founded by prev AWS and Coinbase Engineers, Nodies propose a cost effective solution by hosting this indexer on our bare-metal infrastructure fleet deployed in at least 3 geographic regions. (USE, DE, SGP).\", \"category\": \"Infrastructure Committee\", \"timeline\": {\"status\": \"REJECTED\", \"sponsor_requested_review\": false, \"reviewer_completed_attestation\": false}, \"linked_rfp\": 1, \"supervisor\": \"trechriron71.near\", \"description\": \"## Organization\\\\\\\\n\\\\\\\\nNodies is a web3 infrastructure company offering a broad range of services, including RPC, Snapshots, Validators, and soon Data-lake. Nodies hosts services on multi-regional, bare-metal servers, ensuring top-tier performance, high Quality of Service (QoS), and enterprise-level SLAs. Nodies currently supports 22 chains and is constantly expanding, and has to-date served over 1 trillion RPC requests. Founded by ex-AWS engineers and with over 2 years experience in operating blockchain nodes, Nodies is able to onboard and integrate with a new chain within an average of 7 days. Nodies provides a straightforward, per-request pricing model that is up to 70% more cost-effective than competitors like Alchemy and Infura. Nodies\\\\\\\\u{2019} web app platform offers intuitive endpoint creation, API Key and whitelist management, and project organization tools, all under a cost-effective pricing structure.\\\\\\\\n\\\\\\\\n### Primary person\\\\\\\\u{2019}s contact information\\\\\\\\n\\\\\\\\nGary Kong, gary@nodies.org\\\\\\\\n\\\\\\\\n### Size of the whole team\\\\\\\\n\\\\\\\\n12\\\\\\\\n\\\\\\\\n### Size of the engineering team\\\\\\\\n\\\\\\\\n10\\\\\\\\n\\\\\\\\n### Team location\\\\\\\\n\\\\\\\\nUnited States\\\\\\\\n\\\\\\\\n### Team background and bios\\\\\\\\n\\\\\\\\nFounders: Erick Ho Tommy Ho https://www.linkedin.com/in/erickhols/, https://www.linkedin.com/in/tommy-ho-20b42123b/ -* Previously AWS and Coinbase Engineers.*\\\\\\\\n\\\\\\\\n1 Project Manager, 1 Business Development, 8 engineers (software + dev ops),\\\\\\\\n\\\\\\\\n### Any affiliations with other NEAR ecosystem partners?\\\\\\\\n\\\\\\\\nWe signed a contract previously with Pagoda to operate their RPC from January to April.\\\\\\\\n\\\\\\\\n## Body\\\\\\\\n\\\\\\\\n1. Run Kit Indexer in 3 regions: APAC, US-East and Germany to allow for geographic load balancing + low latency.\\\\\\\\n\\\\\\\\n2. Create a public grafana dashboard indicating the current RPS and latency of each region + indexer\\\\\\\\n\\\\\\\\n3. Incorporate the indexing APIs as part of our SaaS RPC Plans and logged in dashboard\\\\\\\\n\\\\\\\\n## Goals / Milestones\\\\\\\\n\\\\\\\\nMilestone 1 (Week 1 to 2): Set up infrastructure to run in different regions\\\\\\\\nMilestone 3 (Week 3 to 4): Create public grafana dashboards to see RPC tip and Nodes\\\\\\\\nMilestone 4 (Week 5 to 6): Incorporate the indexing APIs as part of our main application\\\\\\\\n \\\\\\\\n100% payment delivered only after all deliverables are met. Since it is only 1 month project for us, we can front the cost.\\\\\\\\n\\\\\\\\n## Metrics\\\\\\\\n\\\\\\\\nWe will publish grafana dashboards for current latency and RPS per region.\\\\\\\\n\\\\\\\\n## Usage & Examples\\\\\\\\n\\\\\\\\nWe already offer SaaS RPC offering with team member support and create your own API endpoints\\\\\\\\n\\\\\\\\n## Budget: \\\\\\\\n\\\\\\\\n### Budget Total\\\\\\\\n\\\\\\\\n$75,000\\\\\\\\n\\\\\\\\n### Budget Breakdown\\\\\\\\n\\\\\\\\n$20,000 / month for maintenance and development costs.\\\\\\\\nRest will be accredited back to a public indexed API free tier according to our pricing plans.\\\\\\\\n\\\\\\\\nMilestone 1 (Week 1 to 2): Set up infrastructure to run in different regions\\\\\\\\nMilestone 3 (Week 3 to 4): Create public grafana dashboards to see RPC tip and Nodes\\\\\\\\nMilestone 4 (Week 5 to 6): Incorporate the indexing APIs as part of our main portal\\\\\\\\n \\\\\\\\nTotal: $20-25k / month, rest will be used to power a public endpoint hosted on https://nodies.app and subsidize using our standard RPC pricing plans.\\\\\\\\n\", \"linked_proposals\": [], \"receiver_account\": \"erickis.near\", \"requested_sponsor\": \"infrastructure-committee.near\", \"proposal_body_version\": \"V1\", \"requested_sponsorship_usd_amount\": \"75000\", \"requested_sponsorship_paid_in_currency\": \"USDC\"}, \"labels\": []}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 910645468015600000000
    }
  },
  {
    "id": "9665641408",
    "receipt_id": "9yT2d6fydGpttu8Y7tMGWXVyrVHjMxrjDYdMtxmzsC9T",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "social.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "BCBWta8fqjGreungARcSyjYBVNF1b5jZGxyRX3wMTCrS",
      "block_height": 131568573,
      "block_timestamp": 1730310432543934700
    },
    "receipt_outcome": {
      "gas_burnt": 3531803747279,
      "tokens_burnt": 353180374727900000000,
      "executor_account_id": "social.near",
      "status": true
    },
    "transaction_hash": "HNYnRoRbsTjrzozMkFwdePEaKUGW857E6cCAtSAV461m",
    "included_in_block_hash": "7YrjDjuh2VrTLp6Gx6aSauCPKxDDuZsLdnePUz1WzxKB",
    "block_timestamp": "1730310430440612307",
    "block": {
      "block_height": 131568571
    },
    "receipt_conversion_tokens_burnt": "49116496560000000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set",
        "deposit": 0,
        "fee": 353180374727900000000,
        "args": "{\"data\": {\"infrastructure-committee.near\": {\"index\": {\"notify\": \"{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"erickis.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"proposal/edit\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"proposal\\\\\\\\\\\\\\\":49,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"trechriron71.near\\\\\\\\\\\\\\\"}}\"}}}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 910645468015600000000
    }
  },
  {
    "id": "9665654302",
    "receipt_id": "DT4HbWRBXYXJU3UWH1f59cyUWcAEFzYfF5QQ896ggWkm",
    "predecessor_account_id": "trechriron71.near",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "3WZdU9UDTLhZfswB34ZfJurQEGpA6Yv74SXgrwyiqLpo",
      "block_height": 131568595,
      "block_timestamp": 1730310456922515200
    },
    "receipt_outcome": {
      "gas_burnt": 5228400192386,
      "tokens_burnt": 522840019238600000000,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "CX4dU7SE26NjH3N1VSh4CC5J8noJGTyUgsipRUf7CrMG",
    "included_in_block_hash": "3hZFJSA8hA94Gm3XDFk515bUML4cYPizsXQWrsGwNNjU",
    "block_timestamp": "1730310456128614988",
    "block": {
      "block_height": 131568594
    },
    "receipt_conversion_tokens_burnt": "52878741673500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "edit_proposal",
        "deposit": 0,
        "fee": 522840019238600000000,
        "args": "{\"id\": 48, \"body\": {\"name\": \"Nodies: Data Lake with Zero Egress Costs\", \"summary\": \"Founded by prev AWS and Coinbase Engineers, Nodies propose a cost effective solution using Cloudflare R2, which has a backwards-compatible API for S3 while charging ZERO egress. With this cost effective offering, most of the querying cost of the data-lake will be subsidized due to zero egress. R2 only charges for HTTP Methods (GET,POST,PUT,etc).\\\\\\\\n\\\\\\\\nNodies also already run RPC nodes at scale on our platform and use R2 for free public snapshots, https://nodies.app/snapshots.\", \"category\": \"Infrastructure Committee\", \"timeline\": {\"status\": \"REJECTED\", \"sponsor_requested_review\": false, \"reviewer_completed_attestation\": false}, \"linked_rfp\": 3, \"supervisor\": \"trechriron71.near\", \"description\": \"## Organization\\\\\\\\n\\\\\\\\nNodies is a web3 infrastructure company offering a broad range of services, including RPC, Snapshots, Validators, and soon Data-lake. Nodies hosts services on multi-regional, bare-metal servers, ensuring top-tier performance, high Quality of Service (QoS), and enterprise-level SLAs. Nodies currently supports 22 chains and is constantly expanding, and has to-date served over 1 trillion RPC requests. Founded by ex-AWS engineers and with over 2 years experience in operating blockchain nodes, Nodies is able to onboard and integrate with a new chain within an average of 7 days. Nodies provides a straightforward, per-request pricing model that is up to 70% more cost-effective than competitors like Alchemy and Infura. Nodies\\\\\\\\u{2019} web app platform offers intuitive endpoint creation, API Key and whitelist management, and project organization tools, all under a cost-effective pricing structure.\\\\\\\\n\\\\\\\\n(Add existing features here)\\\\\\\\n\\\\\\\\n### Primary person\\\\\\\\u{2019}s contact information\\\\\\\\n\\\\\\\\nGary Kong, gary@nodies.org\\\\\\\\n\\\\\\\\n### Size of the whole team\\\\\\\\n\\\\\\\\n12\\\\\\\\n\\\\\\\\n### Size of the engineering team\\\\\\\\n\\\\\\\\n10\\\\\\\\n\\\\\\\\n### Team location\\\\\\\\n\\\\\\\\nUnited States\\\\\\\\n\\\\\\\\n### Team background and bios\\\\\\\\n\\\\\\\\nFounders: Erick Ho Tommy Ho https://www.linkedin.com/in/erickhols/, https://www.linkedin.com/in/tommy-ho-20b42123b/ Previously AWS and Coinbase Engineers.\\\\\\\\n\\\\\\\\n1 Project Manager, 1 Business Development, 8 engineers (software + dev ops), \\\\\\\\n\\\\\\\\n### Any affiliations with other NEAR ecosystem partners?\\\\\\\\n\\\\\\\\nWe signed a contract previously with Pagoda to operate their RPC from January to April.\\\\\\\\n\\\\\\\\n## Body\\\\\\\\n\\\\\\\\n1. Migrate S3 Buckets to Cloudflare R2: The AWS Cost Estimates listed here does not include bandwidth. AWS charges a significant amount for egress, which will not be sustainable infrastructure spend. R2 charges ZERO for egress, allowing for infinite querying potential.\\\\\\\\n\\\\\\\\n2. Nodies already run redundant (2+) RPC nodes on their platform, so we do not need to create any new instances.\\\\\\\\n\\\\\\\\n3. Create a public grafana dashboard indicating the tip of RPC nodes and subsequently the data-lake buckets.\\\\\\\\n\\\\\\\\n\\\\\\\\n## Goals / Milestones\\\\\\\\n\\\\\\\\nMilestone 1 (Week 1 to 2): Migrate R2 Buckets\\\\\\\\nMilestone 2 (Week 3 to 4): Run Indexer to push to R2 Buckets\\\\\\\\nMilestone 3 (Week 4 to 5): Create public grafana dashboards to see RPC tip and Nodes\\\\\\\\nMilestone 4 (Week 5 to 6): Create periodic benchmarks to ensure 1k rps benchmark is satisfied.\\\\\\\\n \\\\\\\\n100% payment delivered only after all deliverables are met. Since it is only 1 month project for us, we can front the cost.\\\\\\\\n\\\\\\\\n## Metrics\\\\\\\\n\\\\\\\\nWe will publish grafana dashboards which include historical timestamp on current RPC node head and the data-lake head to ensure that we are on track with indexing.\\\\\\\\n\\\\\\\\n\\\\\\\\nAdditionally, we will run periodic benchmarks to ensure that data querying is meeting the 1,000 RPS requirement sourced from the R2 buckets.\\\\\\\\n\\\\\\\\n## Usage & Examples\\\\\\\\n\\\\\\\\nWe already use R2 at scale for our public node snapshots and our users love the fast download speeds, https://nodies.app/snapshots\\\\\\\\n\\\\\\\\n## Budget: \\\\\\\\n\\\\\\\\n### Budget Total\\\\\\\\n\\\\\\\\n$200,000\\\\\\\\n\\\\\\\\n### Budget Breakdown\\\\\\\\n\\\\\\\\n- $20,000 / month for maintenance and development costs\\\\\\\\n- $1k/month for R2 storage costs\\\\\\\\n- FREE RPC / Archival Node Access\\\\\\\\n*Rest is reserved for R2 HTTP API Methods. This cost can vary depending on how popular our R2 buckets are being used.*\\\\\\\\n\\\\\\\\nWeek 1 to 2: Migrate S3 Buckets to R2\\\\\\\\n\\\\\\\\nWeek 3 to 4: Run Indexer to Populate R2 Buckets and ensure stability with our public grafana dashboards\\\\\\\\n\\\\\\\\nWeek 5 to 6: Create periodic benchmarks to ensure 1k rps benchmark is satisfied.\\\\\\\\n\\\\\\\\nWeek 7 and onwards: Maintenance and development.\\\\\\\\n\", \"linked_proposals\": [], \"receiver_account\": \"erickis.near\", \"requested_sponsor\": \"infrastructure-committee.near\", \"proposal_body_version\": \"V1\", \"requested_sponsorship_usd_amount\": \"200000\", \"requested_sponsorship_paid_in_currency\": \"USDC\"}, \"labels\": []}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 932987992757800000000
    }
  },
  {
    "id": "9665655792",
    "receipt_id": "GQpAUMNWvoe7nSeKgQrCmAuiKMUoSk9AcsqvFKBWo6KH",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "social.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "3a5BNCZU9CiHCSZdyabeMwxXNFYenEgbTigtHiSJDnx3",
      "block_height": 131568596,
      "block_timestamp": 1730310458095799300
    },
    "receipt_outcome": {
      "gas_burnt": 3572692318457,
      "tokens_burnt": 357269231845700000000,
      "executor_account_id": "social.near",
      "status": true
    },
    "transaction_hash": "CX4dU7SE26NjH3N1VSh4CC5J8noJGTyUgsipRUf7CrMG",
    "included_in_block_hash": "3hZFJSA8hA94Gm3XDFk515bUML4cYPizsXQWrsGwNNjU",
    "block_timestamp": "1730310456128614988",
    "block": {
      "block_height": 131568594
    },
    "receipt_conversion_tokens_burnt": "52878741673500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set",
        "deposit": 0,
        "fee": 357269231845700000000,
        "args": "{\"data\": {\"infrastructure-committee.near\": {\"index\": {\"notify\": \"{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"erickis.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"proposal/edit\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"proposal\\\\\\\\\\\\\\\":48,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"trechriron71.near\\\\\\\\\\\\\\\"}}\"}}}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 932987992757800000000
    }
  },
  {
    "id": "9665689415",
    "receipt_id": "DiASBD2HV9p7EBnJS8b2C2ZDLBkR7nEmnx3gRnPGNJYf",
    "predecessor_account_id": "trechriron71.near",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "DXR87mSvB6QN13sRLuppfHRifiSVhTA2cHn7bmLDhPHU",
      "block_height": 131568658,
      "block_timestamp": 1730310536741947100
    },
    "receipt_outcome": {
      "gas_burnt": 7578297016193,
      "tokens_burnt": 757829701619300000000,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "4wcmZj7KgtuQiD4vwd7T6D6PaVHsFUHMYP1ivgeMzC7M",
    "included_in_block_hash": "Dg4ZNC1kGoyPYwYdFdQG7jPZ4jzyNtGRMDeRmEKapHoc",
    "block_timestamp": "1730310535347488102",
    "block": {
      "block_height": 131568657
    },
    "receipt_conversion_tokens_burnt": "62186602841500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "edit_proposal",
        "deposit": 0,
        "fee": 757829701619300000000,
        "args": "{\"id\": 38, \"body\": {\"name\": \"near.org RPC service by FASTNEAR\", \"summary\": \"Provide near.org RPC service by FASTNEAR\", \"category\": \"Infrastructure Committee\", \"timeline\": {\"status\": \"APPROVED\", \"sponsor_requested_review\": false, \"reviewer_completed_attestation\": false}, \"linked_rfp\": 2, \"supervisor\": \"trechriron71.near\", \"description\": \"# near.org RPC service by FASTNEAR\\\\\\\\n\\\\\\\\n## Organization\\\\\\\\n\\\\\\\\nFASTNEAR\\\\\\\\n\\\\\\\\n### Primary person\\\\\\\\\\\\'s contact information\\\\\\\\nEvgeny Kuzyakov (ek@fastnear.com)\\\\\\\\n\\\\\\\\n### About\\\\\\\\n\\\\\\\\n[FASTNEAR](https://fastnear.com) is NEAR Protocol Infrastructure Provider.\\\\\\\\n\\\\\\\\n#### [Services](https://fastnear.com/services)\\\\\\\\n- RPC endpoints\\\\\\\\n- API for wallets\\\\\\\\n- Snapshot data\\\\\\\\n- Indexing and Lake solutions\\\\\\\\n- Validator services\\\\\\\\n\\\\\\\\n#### Key Features\\\\\\\\n1. **Dedicated to NEAR Protocol:** We exclusively serve the NEAR ecosystem.\\\\\\\\n2. **High-Performance Infrastructure:** \\\\\\\\n   - The majority of nodes and servers hosted on bare-metal.\\\\\\\\n   - Currently ~4,000 RPC requests per second. Resulting in 320M calls per day.\\\\\\\\n\\\\\\\\n#### Reliability and Security\\\\\\\\n- Experienced in handling:\\\\\\\\n  - Traffic surges of 30,000 RPS\\\\\\\\n  - DDoS attacks (recently)\\\\\\\\n  - Provider outages\\\\\\\\n- ~100% RPCs uptime for the last 3 months\\\\\\\\n- 250ms p95 over 60min view call latency\\\\\\\\n\\\\\\\\n![latency monitoring](https://gist.github.com/user-attachments/assets/e873bdfb-b4fd-440e-a462-e7028e26ce8d)\\\\\\\\n\\\\\\\\n#### Monitoring and Performance\\\\\\\\n- Internal monitoring and alert systems\\\\\\\\n- Global RPC latency monitoring dashboards\\\\\\\\n\\\\\\\\n## Body\\\\\\\\n\\\\\\\\n### Hardware\\\\\\\\n\\\\\\\\nBased on the current usage of the following:\\\\\\\\n- RPC Mainnet - 10k requests/s (while currently 6k RPS)\\\\\\\\n- RPC-Archival Mainnet - 2k requests/s\\\\\\\\n- RPC Testnet - 400 requests/s\\\\\\\\n- RPC-Archival Testnet - 150 requests/s\\\\\\\\n\\\\\\\\nWe recommend the following setup:\\\\\\\\n- RPC Mainnet: 20 nodes (estimating 500 RPS each)\\\\\\\\n- RPC-Archival Mainnet: 4 full NVME nodes, with 10Gbps (at 500 RPS)\\\\\\\\n- RPC Testnet - 4 nodes (for 2X redundancy)\\\\\\\\n- RPC-Archival Testnet - 2 full NVME nodes (for 2X redundancy)\\\\\\\\n\\\\\\\\nNote, that we don\\\\\\\\\\\\'t rely on the read-rpc for this setup, due to the current setup complexity. We may consider switching to read-rpc over time.\\\\\\\\n\\\\\\\\n**Pricing**\\\\\\\\n\\\\\\\\nThree types of servers:\\\\\\\\n- RPC (mainnet/testnet): $250 with 2Tb NVME + 1Gbps\\\\\\\\n- RPC-Archive Mainnet: $2500 with 90Tb NVME + ~250TB of 10Gpbs traffic\\\\\\\\n- RPC-Archive Testnet: $1000 with ~20Tb NVME + 1Gbps\\\\\\\\n\\\\\\\\nTotal:\\\\\\\\n- 24 RPC nodes: $6000\\\\\\\\n- 4 Mainnet Archival nodes: $10000\\\\\\\\n- 2 Testnet Archival nodes: $2000\\\\\\\\n\\\\\\\\n**Total: $18000 per month**\\\\\\\\n\\\\\\\\n### Load-balancing\\\\\\\\n\\\\\\\\nOur current RPC setup is using a simple DNS-based load balancer. This works well for front-end clients which come from the different IPs. This setup has quite low cost overhead, but it can\\\\\\\\\\\\'t be used to minimize GEO-spatial latency. There is a latency overhead, because each request might be routed not to the closest server, but instead to a server on a different continent. While it does increase latency by up to ~140ms, we don\\\\\\\\\\\\'t consider it significant enough to justify costs associated with geo-spatial load-balancing.\\\\\\\\n\\\\\\\\n#### Expected load\\\\\\\\n\\\\\\\\n- ~12500 RPS\\\\\\\\n- 32.4B requests per month\\\\\\\\n- 93TB per month\\\\\\\\n\\\\\\\\nMost load balancer providers have costs associated with the number of requests. While GCP doesn\\\\\\\\\\\\'t charge for the number of requests, it has limitations of load balancing across external endpoints and does charge for the traffic.\\\\\\\\n\\\\\\\\n*Note, we don\\\\\\\\\\\\'t have enough experience with GCP load-balancing, so some assumptions might be wrong.*\\\\\\\\n\\\\\\\\nWe have considered the following options for this proposal:\\\\\\\\n1. Simple DNS-based load-balancing\\\\\\\\n3. **PREFERRED** Cloudflare Enterprise geo-spatial load-balancing.\\\\\\\\n4. Google Cloud Provider Load Balancing with proxy instances or GCP LB with simple traffic splitting.\\\\\\\\n\\\\\\\\n#### Option #1: Simple DNS-based load-balancing\\\\\\\\n\\\\\\\\nWe can use a CNAME record for each of the near.org endpoints to point to our endpoints(s).\\\\\\\\n\\\\\\\\nThis option might be fairly simple to setup at **no extra cost**.\\\\\\\\n\\\\\\\\nNote, Strict rate-limiting on HTTP referer will require extra work on nodes or an enterprise plan.\\\\\\\\n\\\\\\\\n#### Option #2: Cloudflare Enterprise Load-balancing (CF LB)\\\\\\\\n\\\\\\\\nSimple DNS-based load-balancing can be upgraded to geo-spatial load-balancing at our end.\\\\\\\\n\\\\\\\\nDuring the communication with Cloudflare sales, we\\\\\\\\\\\\'ve received an estimate for 15B requests per month. Scaling it up to 32.4B requests, the price might be around **~$6000 per month**.\\\\\\\\n\\\\\\\\nCloudflare enterprise offers rate limiting based on HTTP headers, including HTTP Referer or HTTP Origin.\\\\\\\\n\\\\\\\\n#### Option #3: Google Cloud Provider Load Balancing (GCP LB)\\\\\\\\n\\\\\\\\nGCP external load balancer has bandwidth associated with it. \\\\\\\\nBased on our estimates, the LB traffic is around $10 per TB for ingress, and $10 per TB for egress.\\\\\\\\n\\\\\\\\nGCP LB can\\\\\\\\\\\\'t be used for geo-spatial balancing without additional nodes on GCP or other cloud run/functions.\\\\\\\\n\\\\\\\\nSo there are 2 options for GCP:\\\\\\\\n- Full load-balancing. Requires RPC egress traffic with proxy nodes. Costs *estimated* **~$16000 per month**\\\\\\\\n- Splitting traffic (no geo-spatial routing). Costs around **~$2000 month**. Need to confirm feasibility.\\\\\\\\n\\\\\\\\n\\\\\\\\n## Goals / Milestones\\\\\\\\n\\\\\\\\n- Setup (2 weeks)\\\\\\\\n    - Setup RPC nodes and Archival RPC nodes\\\\\\\\n    - Setup 4 endpoints to point traffic\\\\\\\\n    - Rate-limiters based on IPs\\\\\\\\n- Status page for new endpoints (2 weeks)\\\\\\\\n- Setup external monitoring dashboard (4 weeks)\\\\\\\\n- Setup CF LB (4-8 weeks)\\\\\\\\n    - Negotiate deal with CF for LB\\\\\\\\n    - Setup rate limiter based on the HTTP referer.\\\\\\\\n- Full endpoints migration if necessary (3-6 months)\\\\\\\\n\\\\\\\\n## Metrics\\\\\\\\n\\\\\\\\n- Requests per second\\\\\\\\n    - All request types (expected to handle steady traffic of 12,500 RPS)\\\\\\\\n    - Function calls (majority of requests)\\\\\\\\n    - TX status\\\\\\\\n    - Broadcast TX\\\\\\\\n- Latency\\\\\\\\n    - Mean latency from 3 geo endpoints (~170ms for view calls)\\\\\\\\n    - P95 latency (~250ms for calls)\\\\\\\\n    - Lower mean/p95 latency after CF LB\\\\\\\\n- Rate limiting (number of throttled calls)\\\\\\\\n- Traffic (expected up to 3Tb per day)\\\\\\\\n- Uptime (expected 99.99%)\\\\\\\\n\\\\\\\\n### Compensation\\\\\\\\n\\\\\\\\nFor maintenance and development we ask for $12,000 a month.\\\\\\\\n\\\\\\\\n## Budget\\\\\\\\n\\\\\\\\n$36,000 per month (paid monthly) for the duration of 6 months.\\\\\\\\n- $18,000 nodes\\\\\\\\n- $6,000 CF LB\\\\\\\\n- $12,000 maintenance \\\\\\\\n\\\\\\\\nAfter 6 months, we expect a significant drop in the usage, so we should re-negotiate a deal based on the new requirements.\\\\\\\\n\\\\\\\\n\", \"linked_proposals\": [], \"receiver_account\": \"treasury.fastnear.tg\", \"requested_sponsor\": \"infrastructure-committee.near\", \"proposal_body_version\": \"V1\", \"requested_sponsorship_usd_amount\": \"216000\", \"requested_sponsorship_paid_in_currency\": \"USDC\"}, \"labels\": []}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.1773294420225e+21
    }
  },
  {
    "id": "9665689697",
    "receipt_id": "Ca61L9yxSbco7r4LP3ZWDhfpAZ3oHZ5C4bJ913o2o6Dk",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "social.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "69ChU3wrxVmpMWThXbqsk3edepZSSb899vuXT5zPgNxD",
      "block_height": 131568659,
      "block_timestamp": 1730310538016661800
    },
    "receipt_outcome": {
      "gas_burnt": 3573131375617,
      "tokens_burnt": 357313137561700000000,
      "executor_account_id": "social.near",
      "status": true
    },
    "transaction_hash": "4wcmZj7KgtuQiD4vwd7T6D6PaVHsFUHMYP1ivgeMzC7M",
    "included_in_block_hash": "Dg4ZNC1kGoyPYwYdFdQG7jPZ4jzyNtGRMDeRmEKapHoc",
    "block_timestamp": "1730310535347488102",
    "block": {
      "block_height": 131568657
    },
    "receipt_conversion_tokens_burnt": "62186602841500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set",
        "deposit": 0,
        "fee": 357313137561700000000,
        "args": "{\"data\": {\"infrastructure-committee.near\": {\"index\": {\"notify\": \"{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"mob.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"proposal/edit\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"proposal\\\\\\\\\\\\\\\":38,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"trechriron71.near\\\\\\\\\\\\\\\"}}\"}}}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.1773294420225e+21
    }
  },
  {
    "id": "9665722165",
    "receipt_id": "EQa9SwFkF3HiPk55MjBR7ezjqCWaTL4uthEKSd1XTd7p",
    "predecessor_account_id": "trechriron71.near",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "FfRVyNSzw8MjYFn7b91TB3r6tMSsS6F48swouhb5FmSk",
      "block_height": 131568801,
      "block_timestamp": 1730310725655068000
    },
    "receipt_outcome": {
      "gas_burnt": 6987308293845,
      "tokens_burnt": 698730829384500000000,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "GVUqPVzUhbnAdwmuqqTkkvdZqeBbQE4FNuMYPWpqoemc",
    "included_in_block_hash": "5JC5YN8wkwUAgkpXJGsVpkrFDBT2XkSs1kCaCRocxLgg",
    "block_timestamp": "1730310724338717009",
    "block": {
      "block_height": 131568800
    },
    "receipt_conversion_tokens_burnt": "66974047827500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "edit_proposal",
        "deposit": 0,
        "fee": 698730829384500000000,
        "args": "{\"id\": 46, \"body\": {\"name\": \"Kit Wallet Indexer API for NEAR.org by Unicsoft\", \"summary\": \"Unicsoft proposes to develop a comprehensive and scalable **Kit Wallet Indexer API** for the NEAR blockchain. This solution will focus on integrating with the NEAR Lake Framework for real-time access to blockchain data, along with setting up a high-performance PostgreSQL database for efficient storage and querying of wallet, fungible token (FT), and non-fungible token (NFT) activities. The API will provide developers with easy access to indexed wallet data, enabling quick lookups for token trans\", \"category\": \"Infrastructure Committee\", \"timeline\": {\"status\": \"REJECTED\", \"sponsor_requested_review\": false, \"reviewer_completed_attestation\": false}, \"linked_rfp\": 1, \"supervisor\": \"trechriron71\", \"description\": \"# Organization\\\\\\\\n\\\\\\\\n\\\\\\\\nUnicsoft is a technology consulting company specializing in blockchain development, artificial intelligence (AI), machine learning, data science, and custom software development. Founded in 2005, Unicsoft is headquartered in Larnaca, Cyprus, and serves clients globally. The company delivers innovative solutions to startups and enterprises across various industries, including finance, healthcare, retail, and logistics.\\\\\\\\n\\\\\\\\n\\\\\\\\n## Primary person\\\\\\\\u{2019}s contact information\\\\\\\\n\\\\\\\\n\\\\\\\\nName: Tomasz K\\\\\\\\u{119}czkowski\\\\\\\\nEmail: tmk@unicsoft.com \\\\\\\\n\\\\\\\\n## Size of the whole team\\\\\\\\n\\\\\\\\n\\\\\\\\nWhole Team: 200+ employees.\\\\\\\\n\\\\\\\\n## Size of the engineering team\\\\\\\\n\\\\\\\\n\\\\\\\\nEngineering Team: 150+ developers and engineers.\\\\\\\\n\\\\\\\\n\\\\\\\\n## Team location\\\\\\\\n\\\\\\\\n\\\\\\\\nLocation: Europe and Latin America.\\\\\\\\n\\\\\\\\n\\\\\\\\n## Team background and bios\\\\\\\\n\\\\\\\\n\\\\\\\\nUnicsoft is a technology consulting company specializing in blockchain, artificial intelligence, machine learning, and custom software development. With over 15 years of experience, the team is composed of industry experts, including:\\\\\\\\n\\\\\\\\n- Aleksey Zavgorodniy \\\\\\\\u{2013} Founder and CEO of Unicsoft with 15+ years of experience in IT consulting and software development.\\\\\\\\n- Artem Sklyarov \\\\\\\\u{2013} Solution Architect, with over 15 years of experience, specializing in decentralized applications and blockchain solutions.\\\\\\\\n- Stas Sorokin\\\\\\\\u{2013} Blockchain Solution Architect with 18+ years of experience in software design and management, with a deep understanding of business needs and technical solutions.\\\\\\\\n\\\\\\\\n\\\\\\\\n## Professional Experience\\\\\\\\n\\\\\\\\n\\\\\\\\nUnicsoft has been actively developing blockchain solutions since 2016, completing over 50 successful blockchain projects worldwide. Our experience includes developing decentralized applications (dApps), smart contracts, and tokenization platforms, as well as integrating blockchain technology into existing systems to enhance security, transparency, and efficiency.\\\\\\\\n\\\\\\\\n\\\\\\\\n### In-House Resources\\\\\\\\n\\\\\\\\n\\\\\\\\nDesign, UX/UI?: Yes\\\\\\\\n\\\\\\\\nProject management?: Yes\\\\\\\\n\\\\\\\\nBD / Marketing?: Yes\\\\\\\\n\\\\\\\\n## Body\\\\\\\\n\\\\\\\\n\\\\\\\\n**The primary approach and solution of the proposal.**\\\\\\\\n\\\\\\\\nThe Kit Wallet Indexer API will be developed with the following approach:\\\\\\\\n**Setting up the Project Structure and API Services:**\\\\\\\\nEstablish a solid project foundation by setting up the necessary structure and defining the API services. This will include implementing basic routes to allow querying of wallets, FT (fungible tokens), and NFT (non-fungible tokens) details.\\\\\\\\n**Integration with NEAR Lake Framework:**\\\\\\\\nIntegrate the API with the NEAR Lake Framework, which is designed to provide easy access to blockchain data streams. This integration will allow the API to retrieve and index on-chain data efficiently.\\\\\\\\n**Working with the Database (PostgreSQL):**\\\\\\\\nSet up and configure a PostgreSQL database to store indexed blockchain data. This will include implementing both writing and querying operations, ensuring that the data is structured in a way that supports fast and reliable retrieval.\\\\\\\\n**Developing Features for Wallet Data Indexing:**\\\\\\\\nBuild features to index wallet activities, including tracking token transfers (FT and NFT) and wallet-specific events. This will enable quick lookups and queries for wallet information, making the API highly efficient for various use cases within the NEAR ecosystem.\\\\\\\\n\\\\\\\\n**Why should the committee choose this project?**\\\\\\\\n\\\\\\\\n**Focused on Efficient Data Access:**\\\\\\\\nThe integration with NEAR Lake ensures efficient and scalable access to on-chain data, which is crucial for building a responsive and reliable indexer service.\\\\\\\\n**Comprehensive Data Coverage:**\\\\\\\\nThe API will support querying for a wide range of blockchain activities, including wallet transactions, fungible tokens, and NFTs. This makes it a valuable tool for developers building on the NEAR platform, ensuring comprehensive data access.\\\\\\\\n**Scalability and Performance:**\\\\\\\\nThe use of PostgreSQL as the database solution ensures scalability and high performance for both write and query operations, enabling this API to handle large amounts of data as the ecosystem grows.\\\\\\\\n**Experienced Team:**\\\\\\\\nThe estimate highlights the involvement of skilled software engineers with experience in blockchain and database integration, giving confidence in the team\\\\\\\\\\\\'s ability to deliver the project successfully.\\\\\\\\n\\\\\\\\n\\\\\\\\n## Goals / Milestones\\\\\\\\n\\\\\\\\n\\\\\\\\n**Goals**\\\\\\\\n\\\\\\\\n**Establish a Project Structure and API:**\\\\\\\\nSet up the project\\\\\\\\u{2019}s core structure, including the foundational API routes to query wallet, FT, and NFT data.\\\\\\\\n**Integrate the NEAR Lake Framework:**\\\\\\\\nEnable the API to interact with the NEAR Lake data stream for real-time blockchain data retrieval.\\\\\\\\n**Develop Database Support (PostgreSQL):**\\\\\\\\nImplement a scalable database solution for storing and querying indexed blockchain data.\\\\\\\\n**Implement Wallet Data Indexing Features:**\\\\\\\\nDevelop features that allow indexing and querying of wallet activities, including token transfers and other blockchain events.\\\\\\\\n\\\\\\\\n**Milestones**\\\\\\\\n\\\\\\\\nThe project will be completed over 9-10 weeks, divided into the following milestones:\\\\\\\\n\\\\\\\\n**Milestone 1: Project Structure and API Services Setup** (2 weeks)\\\\\\\\nDefine the project\\\\\\\\u{2019}s structure and implement basic API routes.\\\\\\\\nTest the API for querying wallet, FT, and NFT data to ensure all routes work correctly.\\\\\\\\n\\\\\\\\n**Milestone 2: Integration with NEAR Lake Framework** (2 weeks)\\\\\\\\nSet up the connection with NEAR Lake for retrieving blockchain data.\\\\\\\\nEnsure that the integration is seamless and can handle real-time data streams efficiently.\\\\\\\\n\\\\\\\\n**Milestone 3: Database (PostgreSQL) Setup** (2 weeks)\\\\\\\\nConfigure the PostgreSQL database for data storage.\\\\\\\\nImplement necessary operations for writing and querying the indexed blockchain data.\\\\\\\\n\\\\\\\\n**Milestone 4: Wallet Data Indexing Features** (3-4 weeks)\\\\\\\\nDevelop indexing features for wallet activity tracking.\\\\\\\\nOptimize the API for querying large datasets efficiently, focusing on token transfers and wallet-specific events.\\\\\\\\n \\\\\\\\n \\\\\\\\n## Budget\\\\\\\\n\\\\\\\\n\\\\\\\\n### Budget Total\\\\\\\\n\\\\\\\\n\\\\\\\\nThe total project cost has been estimated as follows:\\\\\\\\nOptimistic Estimate: $57,040\\\\\\\\t\\\\\\\\nPessimistic Estimate: $65,306\\\\\\\\nThese estimates cover all development tasks, including engineering hours, project management, and other critical activities.\\\\\\\\n\\\\\\\\n\\\\\\\\n### Budget Breakdown\\\\\\\\n\\\\\\\\n\\\\\\\\nPlease refer to the attached spreadsheet for the detailed budget breakdown: https://drive.google.com/file/d/1OhakK4WCIdlzDGKK72IrikzHSZctCRaK/view?usp=drive_link \\\\\\\\nNote: Public access to this spreadsheet is closed and will be provided only for NEAR Infrastructure Committee members on request.\\\\\\\\n\", \"linked_proposals\": [], \"receiver_account\": \"unicsoftfin.near\", \"requested_sponsor\": \"infrastructure-committee.near\", \"proposal_body_version\": \"V1\", \"requested_sponsorship_usd_amount\": \"65306\", \"requested_sponsorship_paid_in_currency\": \"USDC\"}, \"labels\": []}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.1230029636049e+21
    }
  },
  {
    "id": "9665722510",
    "receipt_id": "AYywdzp2cRscTid11WRo8yQLTFmk6SDaYXwVV1RcJJk",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "social.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "6ZsCjnk9hds35xx5jfLywdhmfa8bHWjch3epeVWJxkqp",
      "block_height": 131568802,
      "block_timestamp": 1730310726947218700
    },
    "receipt_outcome": {
      "gas_burnt": 3572980863929,
      "tokens_burnt": 357298086392900000000,
      "executor_account_id": "social.near",
      "status": true
    },
    "transaction_hash": "GVUqPVzUhbnAdwmuqqTkkvdZqeBbQE4FNuMYPWpqoemc",
    "included_in_block_hash": "5JC5YN8wkwUAgkpXJGsVpkrFDBT2XkSs1kCaCRocxLgg",
    "block_timestamp": "1730310724338717009",
    "block": {
      "block_height": 131568800
    },
    "receipt_conversion_tokens_burnt": "66974047827500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set",
        "deposit": 0,
        "fee": 357298086392900000000,
        "args": "{\"data\": {\"infrastructure-committee.near\": {\"index\": {\"notify\": \"{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"andrewlutsiuk.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"proposal/edit\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"proposal\\\\\\\\\\\\\\\":46,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"trechriron71.near\\\\\\\\\\\\\\\"}}\"}}}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.1230029636049e+21
    }
  },
  {
    "id": "9665727216",
    "receipt_id": "9xHT2x68sBp8PYE3ur7HK9JyP5dcZ8SPvDTWAQ8NyJx9",
    "predecessor_account_id": "trechriron71.near",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "s43ZoBkEDzX7nAqYh9j4k739ZpithUhxwMFAxf3wLzr",
      "block_height": 131568819,
      "block_timestamp": 1730310749235703300
    },
    "receipt_outcome": {
      "gas_burnt": 6497216372476,
      "tokens_burnt": 649721637247600000000,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "2Hnm4XYfJngtDgNMLbzqPzecKFpb9jS1h4XjRUheQ4s7",
    "included_in_block_hash": "A8mdGtEWYF5PbNaZtn9kcExPCgiwRSKgg4cHCDDNHbv9",
    "block_timestamp": "1730310747948776499",
    "block": {
      "block_height": 131568818
    },
    "receipt_conversion_tokens_burnt": "59654597575000000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "edit_proposal",
        "deposit": 0,
        "fee": 649721637247600000000,
        "args": "{\"id\": 45, \"body\": {\"name\": \"RPC Service for NEAR.org by Unicsoft\", \"summary\": \"Unicsoft proposes to develop a robust and scalable RPC service for NEAR, focusing on key components such as load balancers, RPC servers, ScyllaDB integration, and NEAR node synchronization. The solution will ensure high availability, optimized performance, and seamless data synchronization, with built-in monitoring for reliability.\", \"category\": \"Infrastructure Committee\", \"timeline\": {\"status\": \"REJECTED\", \"sponsor_requested_review\": false, \"reviewer_completed_attestation\": false}, \"linked_rfp\": 2, \"supervisor\": \"trechriron71.near\", \"description\": \"## Organization\\\\\\\\n\\\\\\\\n\\\\\\\\nUnicsoft is a technology consulting company specializing in blockchain development, artificial intelligence (AI), machine learning, data science, and custom software development. Founded in 2005, Unicsoft is headquartered in Larnaca, Cyprus, and serves clients globally. The company delivers innovative solutions to startups and enterprises across various industries, including finance, healthcare, retail, and logistics.\\\\\\\\n\\\\\\\\n\\\\\\\\n### Primary person\\\\\\\\u{2019}s contact information\\\\\\\\n\\\\\\\\n\\\\\\\\nName: Tomasz K\\\\\\\\u{119}czkowski\\\\\\\\nEmail: tmk@unicsoft.com \\\\\\\\n\\\\\\\\n\\\\\\\\n### Size of the whole team\\\\\\\\n\\\\\\\\n\\\\\\\\nWhole Team: 200+ employees.\\\\\\\\n\\\\\\\\n\\\\\\\\n### Size of the engineering team\\\\\\\\n\\\\\\\\n\\\\\\\\nEngineering Team: 150+ developers and engineers.\\\\\\\\n\\\\\\\\n\\\\\\\\n### Team location\\\\\\\\n\\\\\\\\n\\\\\\\\nLocation: Europe and Latin America.\\\\\\\\n\\\\\\\\n\\\\\\\\n### Team background and bios\\\\\\\\n\\\\\\\\n\\\\\\\\nUnicsoft is a technology consulting company specializing in blockchain, artificial intelligence, machine learning, and custom software development. With over 15 years of experience, the team is composed of industry experts, including:\\\\\\\\n\\\\\\\\n- Aleksey Zavgorodniy \\\\\\\\u{2013} Founder and CEO of Unicsoft with 15+ years of experience in IT consulting and software development.\\\\\\\\n- Artem Sklyarov \\\\\\\\u{2013} Solution Architect, with over 15 years of experience, specializing in decentralized applications and blockchain solutions.\\\\\\\\n- Stas Sorokin\\\\\\\\u{2013} Blockchain Solution Architect with 18+ years of experience in software design and management, with a deep understanding of business needs and technical solutions.\\\\\\\\n\\\\\\\\n\\\\\\\\n## Professional Experience\\\\\\\\n\\\\\\\\n\\\\\\\\nUnicsoft has been actively developing blockchain solutions since 2016, completing over 50 successful blockchain projects worldwide. Our experience includes developing decentralized applications (dApps), smart contracts, and tokenization platforms, as well as integrating blockchain technology into existing systems to enhance security, transparency, and efficiency.\\\\\\\\n\\\\\\\\n\\\\\\\\n### In-House Resources;\\\\\\\\n\\\\\\\\n\\\\\\\\nDesign, UX/UI: Yes\\\\\\\\nProject management: Yes\\\\\\\\nBD / Marketing: Yes\\\\\\\\n\\\\\\\\n\\\\\\\\n### Portfolio of relevant work\\\\\\\\n\\\\\\\\n\\\\\\\\nPlease review the presentation of Blockchain expertise: https://drive.google.com/file/d/1xyofTbodzEwc8m8aM9H2Lqmky79Df649/view?usp=sharing \\\\\\\\n\\\\\\\\n\\\\\\\\n## Body\\\\\\\\n\\\\\\\\n\\\\\\\\n**The primary approach and solution of the proposal**\\\\\\\\n\\\\\\\\nWe propose to develop a high-performance RPC service consisting of the following components:\\\\\\\\n**Load Balancer Development**: A routing mechanism that optimizes traffic distribution based on IP and region.\\\\\\\\n**RPC Servers (Read-RPC)**: Core servers designed to manage high volumes of requests with low-latency response times.\\\\\\\\n**ScyllaDB Integration**: A high-performance database to store and manage blockchain data, ensuring fast retrieval and efficient data access.\\\\\\\\n**NEAR Node Integration**: Seamless synchronization with NEAR archival and non-archival nodes to provide robust and reliable data access.\\\\\\\\n**Monitoring and Alerts**: A real-time monitoring system (Prometheus, Grafana) for tracking system health, detecting anomalies, and ensuring high availability.\\\\\\\\n\\\\\\\\n**Why should the committee choose this project?**\\\\\\\\n\\\\\\\\n**Scalability and Performance**: Our solution is designed to scale with growing demand, ensuring optimized performance and low-latency responses, which are crucial for NEAR\\\\\\\\u{2019}s ecosystem.\\\\\\\\n**Reliability**: Real-time monitoring and alerts will ensure any potential issues are identified and resolved swiftly, minimizing downtime.\\\\\\\\n**Comprehensive Integration**: We provide deep integration with NEAR nodes, enabling effective query handling and data synchronization, essential for NEAR\\\\\\\\u{2019}s blockchain infrastructure.\\\\\\\\n**Proven Experience**: Our team\\\\\\\\\\\\'s experience with similar blockchain infrastructure projects will ensure the timely and successful delivery of this solution.\\\\\\\\n\\\\\\\\n\\\\\\\\n## Goals / Milestones\\\\\\\\n\\\\\\\\n\\\\\\\\nThe project will be completed over 13-15 weeks, divided into the following milestones:\\\\\\\\n**Load Balancer Development**: 2-3 weeks\\\\\\\\nImplement routing logic based on IP/region to optimize traffic distribution.\\\\\\\\n**RPC Servers (Read-RPC)**: 4-5 weeks\\\\\\\\nDevelop core servers to manage requests and ensure low-latency communication between blockchain users and the NEAR nodes.\\\\\\\\n**ScyllaDB Integration**: 2 weeks\\\\\\\\nIntegrate the high-performance ScyllaDB for rapid data retrieval and management.\\\\\\\\n**NEAR Node Integration**: 3 weeks\\\\\\\\nSynchronize the RPC service with NEAR archival and non-archival nodes to ensure reliable data access.\\\\\\\\n**Monitoring and Alerts Setup**: 2 weeks\\\\\\\\nSet up a real-time monitoring system (Prometheus, Grafana) to ensure system health and detect anomalies.\\\\\\\\n\\\\\\\\n\\\\\\\\n## Budget\\\\\\\\n\\\\\\\\n\\\\\\\\n### Budget Total\\\\\\\\n\\\\\\\\n\\\\\\\\nThe total project cost has been estimated as follows:\\\\\\\\nOptimistic Estimate: $115,022.50\\\\\\\\nPessimistic Estimate: $135,985.00\\\\\\\\nThese estimates cover all development tasks, including engineering hours, project management, and other critical activities.\\\\\\\\n\\\\\\\\n\\\\\\\\n### Budget Breakdown\\\\\\\\n\\\\\\\\n\\\\\\\\nPlease refer to the attached spreadsheet for the detailed budget breakdown: https://drive.google.com/file/d/1b8i28UUd4foSqH18fi1GX_2JbejL866t/view?usp=drive_link \\\\\\\\nNote: Public access to this spreadsheet is closed and will be provided only for NEAR Infrastructure Committee members on request.\", \"linked_proposals\": [], \"receiver_account\": \"unicsoftfin.near\", \"requested_sponsor\": \"infrastructure-committee.near\", \"proposal_body_version\": \"V1\", \"requested_sponsorship_usd_amount\": \"135985\", \"requested_sponsorship_paid_in_currency\": \"USDC\"}, \"labels\": []}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.0667309743399e+21
    }
  },
  {
    "id": "9665727637",
    "receipt_id": "6jjBt4KxfdS66vtvDEcKBgED1eVsh8kYvMSd1RuvycXX",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "social.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "8gqsyAoMwJ6uBd4LXUzEYEMbuS2TmfsGxytbuq4zwgjK",
      "block_height": 131568820,
      "block_timestamp": 1730310750558794000
    },
    "receipt_outcome": {
      "gas_burnt": 3573547395173,
      "tokens_burnt": 357354739517300000000,
      "executor_account_id": "social.near",
      "status": true
    },
    "transaction_hash": "2Hnm4XYfJngtDgNMLbzqPzecKFpb9jS1h4XjRUheQ4s7",
    "included_in_block_hash": "A8mdGtEWYF5PbNaZtn9kcExPCgiwRSKgg4cHCDDNHbv9",
    "block_timestamp": "1730310747948776499",
    "block": {
      "block_height": 131568818
    },
    "receipt_conversion_tokens_burnt": "59654597575000000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set",
        "deposit": 0,
        "fee": 357354739517300000000,
        "args": "{\"data\": {\"infrastructure-committee.near\": {\"index\": {\"notify\": \"{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"andrewlutsiuk.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"proposal/edit\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"proposal\\\\\\\\\\\\\\\":45,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"trechriron71.near\\\\\\\\\\\\\\\"}}\"}}}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.0667309743399e+21
    }
  },
  {
    "id": "9665730562",
    "receipt_id": "9ZUcZB1SureyUnFAeGRZzaCueRyxHmLUNsuMnag7nRwt",
    "predecessor_account_id": "trechriron71.near",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "BRMnGGfPJjrwY4ktiB3GMh7vQ12u2HWzBeZTS6NYWEHQ",
      "block_height": 131568830,
      "block_timestamp": 1730310763725030400
    },
    "receipt_outcome": {
      "gas_burnt": 7865835438719,
      "tokens_burnt": 786583543871900000000,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "9KTLZDqNahwZE5Kpeyaw7xgPZNBjoJuaBtFT1aTtwQwc",
    "included_in_block_hash": "GjPSKrJsNQyVVzYkDZW2qEjpZtrZ2Bnf8FXFfx9mtkZB",
    "block_timestamp": "1730310762366697278",
    "block": {
      "block_height": 131568829
    },
    "receipt_conversion_tokens_burnt": "77531222328500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "edit_proposal",
        "deposit": 0,
        "fee": 786583543871900000000,
        "args": "{\"id\": 44, \"body\": {\"name\": \"Multi vendor and heterogeneity solution for near lake\", \"summary\": \"Seamless NEAR Lake transition leveraging Lava\\\\\\\\\\\\'s proven high-performance infrastructure while reducing costs through existing resources. Lava manages 50% of \\\\\\\\n\\\\\\\\nWith proven experience operating public endpoints for Axelar, Cosmos & Evmos Lava\\\\\\\\\\\\'s decentralized stack ensures high performance by aggregating top providers like Liquify and Chainstack, and community contributors\\\\\\\\n\\\\\\\\nLava will offer discounts on multi-chain APIs to accelerate the transition to a demo environment and support Chain Abstraction\\\\\\\\n\", \"category\": \"Infrastructure Committee\", \"timeline\": {\"status\": \"REJECTED\", \"kyc_verified\": false, \"timeline_version\": \"V1\", \"sponsor_requested_review\": false, \"reviewer_completed_attestation\": false}, \"linked_rfp\": 3, \"supervisor\": \"trechriron71.near\", \"description\": \"## Submission Info\\\\\\\\nSubmitted by: Lava Foundation\\\\\\\\nDate: October 14, 2024\\\\\\\\n\\\\\\\\n## Contact Information:\\\\\\\\nName: Amir A\\\\\\\\nRole: Head of Lava Foundation\\\\\\\\nEmail: amir@lava.foundation\\\\\\\\nTelegram: @RaFuN\\\\\\\\n\\\\\\\\n## Introduction\\\\\\\\nLava is well-equipped to manage the transition and future development of NEAR Lake, leveraging our experience with decentralized infrastructure. We will ensure a smooth migration of NEAR Lake\\\\\\\\\\\\'s S3 storage, maintaining zero downtime for key stakeholders in the ecosystem. Our decentralized approach will prepare NEAR Lake for upcoming challenges like dynamic sharding, while supporting the current NEAR Lake libraries. With a proven track record of reliability, Lava is ready to handle the increasing complexity and growing demands of NEAR Lake\\\\\\\\u{2019}s infrastructure, as well as improve its access as a public good by exposing it to developers to query.\\\\\\\\n\\\\\\\\nNear lake\\\\\\\\u{2019}s integration will allow the enhancement of APIs on near, seamless replacement of vendors, and competition over performance and price, with the goal of replacing the need for RPFs in the future and allowing vendors to compete based on queries and costs.\\\\\\\\n\\\\\\\\n**This approach allows near to transition from a single provider, and a risk factor that needs to be addressed regularly by the infrastructure committee into an automatic technically solved solution that can scale and allow competitiveness.** \\\\\\\\n\\\\\\\\nVendors will be encouraged to improve their costs and will allow the flexibility of any solution to be integrated in the future. We aim for the transition to be gradual, focusing on stability and making steps towards the goal of decentralizing and monetising the solution based on usage, while still offering the base rates as a public good.\\\\\\\\n\\\\\\\\n## Technical Requirements and Solution Proposal\\\\\\\\n\\\\\\\\n- **S3 Bucket Maintenance:** We will create and maintain two AWS S3 buckets: one for testnet and one for mainnet, both in the **eu-central-1 region**. The S3 storage will be handled using **S3 Standard** for 4.2 TB per month, with an average object size of 1.8 MB. Operations will include **300M PUT, COPY, POST, LIST requests** and **1 billion GET and SELECT requests** monthly paid by the requester. Strategies to optimize costs will be focused on **querying efficiency and minimizing storage overhead** by archiving older data when appropriate.\\\\\\\\n- **Lake Indexer Nodes:** Our proposal includes maintaining **two RPC nodes per network** (testnet and mainnet) with the **indexer framework enabled**. The indexer nodes will populate the S3 buckets with a low-latency, accurate data stream. We will utilize **t4g.xlarge instances** (over aws for latency and optimal block time, as detailed in the table). Exposing Near Lake to dapps through lava endpoints, allowing seamless development of indexing solutions using athena, for seamless integration of new indexing solutions, at controlled rates.\\\\\\\\n- **Adding a Near Lake incentive pool on Lava Network:** to encourage providers to create more efficient solutions, adding verifications of the quality of the content, and creating a multi vendor setup for Near Lake\\\\\\\\n\\\\\\\\n### Cost Reduction Strategies\\\\\\\\nEnable a multi provider set up for Near Lake encouraging competition over price and quality, where rewards are given based on performance and usage of clients.\\\\\\\\n\\\\\\\\nDetach Near Lake from the node and allow it to work with RPC, utilizing existing infra solutions rather than needing to track the chain with other instances. Utilizing RPC caching, multiple vendors can host the buckets, without running their own Near indexers. Separating Near Lake indexers from the storage allows a modular approach where each part of the stack can be improved. This opens up the stack for exploration for cheaper alternatives such as a decentralized storage, dedicated bare metals etc.\\\\\\\\n\\\\\\\\n### Monitoring and Alerts\\\\\\\\n\\\\\\\\nTo ensure smooth operations and proactive monitoring, we will use:\\\\\\\\n- **Grafana Metrics:** Visualizing up to 4k time series for up to 10 users.\\\\\\\\n- **Alerting:** Set up alerts for potential last block issues or storage overruns.\\\\\\\\n- **Logging:** Using Axiom for a 1 TB/month log retention plan with 95-day retention.\\\\\\\\n- **Status Page**: A public Statuspage to provide transparency on uptime, performance, and usage metrics.\\\\\\\\n\\\\\\\\n### Scalable and Efficient Data Querying:\\\\\\\\nBuilding on our experience with LAVA\\\\\\\\\\\\'s RPC services, we will enhance NEAR Lake\\\\\\\\u{2019}s data query capabilities by implementing scalable and efficient querying mechanisms. Using Athena as an initial query engine, we will help developers integrate with Near Lake and experiment with the information it offers.\\\\\\\\n\\\\\\\\nFurthermore, we will leverage smart caching strategies to optimize frequently queried data, reducing unnecessary repetitive scans. As NEAR\\\\\\\\u{2019}s ecosystem expands, our infrastructure can scale dynamically to handle increased data loads and traffic without compromising performance. By integrating ReadRPC solutions, we will ensure that both real-time and historical data are efficiently queried, offering developers and users quick and accurate responses, even as the complexity of NEAR Lake evolves with dynamic sharding and other protocol upgrades.\\\\\\\\n\\\\\\\\nOur goal is to provide a robust querying infrastructure that balances performance with cost efficiency, ensuring NEAR Lake remains a reliable data source as the ecosystem scales, while also helping indexers leverage its offering to build.\\\\\\\\n\\\\\\\\n### Service Level Agreement (SLA)\\\\\\\\nOur proposed NEAR Lake management solution will meet all RFP requirements with the following metrics:\\\\\\\\n- Uptime: 99.99%, ensuring continuous availability and zero downtime during the transition.\\\\\\\\n- Latency: Low latency for data queries and indexing, optimized through AWS services and auto-scaling infrastructure.\\\\\\\\n\\\\\\\\n### To enhance the SLA further, we will:\\\\\\\\n- Extensive monitoring\\\\\\\\n- Dedicated support channels\\\\\\\\n- Commission extra indexer nodes as a backup to catch up when there\\\\\\\\u{2019}s a lag due to a failure\\\\\\\\nEnsure multi-region failover for uninterrupted service.\\\\\\\\n\\\\\\\\n### Support\\\\\\\\nWe will provide both public and private channels for NEAR Lake support, ensuring quick resolutions to any issues. Dedicated communication lines will be set up for NEAR <> Lava users, with a goal to respond to issues within 4 hours and fully resolve them within 24-48 hours.\\\\\\\\n\\\\\\\\n#### Our comprehensive support includes:\\\\\\\\n- 24/7 monitoring with proactive issue detection.\\\\\\\\n- Clear, transparent communication via a public status page to track performance, latency, and any ongoing incidents.\\\\\\\\n\\\\\\\\n## Proposed Timeline and Milestones:\\\\\\\\n\\\\\\\\n### Total Budget: $660,000\\\\\\\\n\\\\\\\\n**Transition and Setup:** $100,000\\\\\\\\n- Transfer and testing of NEAR Lake infrastructure\\\\\\\\n- Migration and setup of S3 buckets\\\\\\\\n- Indexer infrastructure setup and documentation\\\\\\\\n- Exposing near lake as an endpoint on lava\\\\\\\\n\\\\\\\\n**Infrastructure**:\\\\\\\\n- **$16,000/month** for the first 6 months ($16,000 * 6 = $96,000)\\\\\\\\n- **$17,500/month** for the following 6 months ($17,500 * 6 = $105,000)\\\\\\\\n- Includes S3 bucket storage, indexer nodes, networking, athena and operational costs, monitoring (see table for break down)\\\\\\\\n\\\\\\\\n**Support:** $5,000/month\\\\\\\\n- User and provider support\\\\\\\\n- Monitoring (Grafana, logging, alerts)\\\\\\\\n- Documentation\\\\\\\\n\\\\\\\\n**Development:** $25,000/month\\\\\\\\nNear lake repository - further development and integration with advancement in sharding\\\\\\\\nAllowing Near Lake to work with RPC, separating the stack allowing the indexers to run on cheaper solutions\\\\\\\\nIntegration with different storage solutions without damaging the performance and latency\\\\\\\\nIntegration with lava exposing the data with athena as a public good endpoint\\\\\\\\n\\\\\\\\n **The majority of the budget doesn\\\\\\\\u{2019}t go to Lava, it\\\\\\\\u{2019}s distributed to top providers and NEAR\\\\\\\\u{2019}s community.**\\\\\\\\n\\\\\\\\n### Milestones\\\\\\\\n- **Milestone 1 (Month 1):** Agreement signing and initial setup.\\\\\\\\n**Milestone 2 (Month 2):** Begin migration of NEAR Lake infrastructure, including S3 and indexers.\\\\\\\\n- **Milestone 3 (Month 4):** Full operation with ownership on the current solution.\\\\\\\\n- **Milestone 4 (Month 5):** athena endpoint exposed on lava.\\\\\\\\n- **Milestone 5 (Month 7):** focus on infra cost reductions - separation of indexing from state tracking, exploration of cheaper storage alternatives\\\\\\\\n- **Milestone 6 (Month 9):** setting up a second vendor based on the new tech stack, verifications in place for data integrity vs the previous solution\\\\\\\\n- **Milestone 7 (Month 10):** enabling incentives over lava based on usage for the multi vendor set up\\\\\\\\n\\\\\\\\n![https://ipfs.near.social/ipfs/bafkreifh3n4b7dnhutedfahwnhddckvwycnbdqhchvxcc3ai5cb7x5rjce](https://ipfs.near.social/ipfs/bafkreifh3n4b7dnhutedfahwnhddckvwycnbdqhchvxcc3ai5cb7x5rjce)\", \"linked_proposals\": [], \"receiver_account\": \"8d51039cd656f1d9716894420b62555b68022797e7214adf4f630c77caf1cf66\", \"requested_sponsor\": \"infrastructure-committee.near\", \"proposal_body_version\": \"V1\", \"requested_sponsorship_usd_amount\": \"660000\", \"requested_sponsorship_paid_in_currency\": \"NEAR\"}, \"labels\": []}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.2163199412109e+21
    }
  },
  {
    "id": "9665730862",
    "receipt_id": "7wgJRPG43UVD3NSj2HqAuWLZhiBje2FdW15j7yKCzzpF",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "social.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "6HQCmuaHNeA4x1zxZpKh3FeKaFYMCD2XPXxNcNKoMXca",
      "block_height": 131568831,
      "block_timestamp": 1730310765569376800
    },
    "receipt_outcome": {
      "gas_burnt": 3522051750105,
      "tokens_burnt": 352205175010500000000,
      "executor_account_id": "social.near",
      "status": true
    },
    "transaction_hash": "9KTLZDqNahwZE5Kpeyaw7xgPZNBjoJuaBtFT1aTtwQwc",
    "included_in_block_hash": "GjPSKrJsNQyVVzYkDZW2qEjpZtrZ2Bnf8FXFfx9mtkZB",
    "block_timestamp": "1730310762366697278",
    "block": {
      "block_height": 131568829
    },
    "receipt_conversion_tokens_burnt": "77531222328500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set",
        "deposit": 0,
        "fee": 352205175010500000000,
        "args": "{\"data\": {\"infrastructure-committee.near\": {\"index\": {\"notify\": \"{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"8d51039cd656f1d9716894420b62555b68022797e7214adf4f630c77caf1cf66\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"proposal/edit\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"proposal\\\\\\\\\\\\\\\":44,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"trechriron71.near\\\\\\\\\\\\\\\"}}\"}}}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.2163199412109e+21
    }
  },
  {
    "id": "9665742932",
    "receipt_id": "GJrVpA45Fa5fu77arDCZfvFFDGGgAjw5XnUpJzEWudPj",
    "predecessor_account_id": "trechriron71.near",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "B8dkZ88jVx8hPMoEj6AxiriGwzrMmzw7uHZZnEY3zpZJ",
      "block_height": 131568844,
      "block_timestamp": 1730310782119081000
    },
    "receipt_outcome": {
      "gas_burnt": 10352688469259,
      "tokens_burnt": 1.0352688469259e+21,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "3F87UebSBLgHVr2rvwqUdcpzBiLapiGZjet8vDW3jNhg",
    "included_in_block_hash": "H8kdU2ZmoJNBAnyRo7XdqAT47ZgXnrNJGBcwftXu7dwu",
    "block_timestamp": "1730310780776301400",
    "block": {
      "block_height": 131568843
    },
    "receipt_conversion_tokens_burnt": "107500437206000000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "edit_proposal",
        "deposit": 0,
        "fee": 1.0352688469259e+21,
        "args": "{\"id\": 43, \"body\": {\"name\": \"Lava Network - Decentralizing and Upgrading rpc.near.org\", \"summary\": \"Lava successfully manages 50% of rpc.near.org traffic and is ready to scale to 100% quickly. Top NEAR teams like Ref, Burrow, Bitte & Pagoda trust Lava\\\\\\\\n\\\\\\\\nWith proven experience operating public endpoints for Axelar, Cosmos & Evmos Lava\\\\\\\\\\\\'s decentralized stack ensures high performance by aggregating top providers like Liquify and Chainstack, and community contributors\\\\\\\\n\\\\\\\\nLava will offer discounts on multi-chain APIs to accelerate the transition to a demo environment and support Chain Abstraction\\\\\\\\n\", \"category\": \"Infrastructure Committee\", \"timeline\": {\"status\": \"REJECTED\", \"kyc_verified\": false, \"timeline_version\": \"V1\", \"sponsor_requested_review\": false, \"reviewer_completed_attestation\": false}, \"linked_rfp\": 2, \"supervisor\": \"trechriron71.near\", \"description\": \"### Submission Info\\\\\\\\nSubmitted by: Lava Foundation\\\\\\\\nDate: October 14, 2024\\\\\\\\n\\\\\\\\n### Contact Information:\\\\\\\\nName: Yuval Binder\\\\\\\\nRole: BD Lead at Magma Devs\\\\\\\\nEmail: yuval@magmadevs.com\\\\\\\\nTelegram: @yuval_xyz\\\\\\\\n\\\\\\\\n## Body\\\\\\\\nrpc.near.org serves as the primary gateway into NEAR for new users and developers. As NEAR continues to grow rapidly, it\\\\\\\\u{2019}s crucial to ensure that rpc.near.org provides a smooth and reliable onboarding experience while funneling advanced users to production-grade services. \\\\\\\\n\\\\\\\\nLava\\\\\\\\u{2019}s decentralized RPC network enhances speed and reliability, drives user engagement and maximizes retention. It provides redundancy and scalability by aggregating and optimizing top providers (e.g. Nodies, Liquify, All That Node, Chainstack, FastNEAR) alongside community contributors.\\\\\\\\n\\\\\\\\nThe Infrastructure Committee doesn\\\\\\\\u{2019}t have to spend resources on writing RFPs, debating proposals and technical specs, just to choose a single provider. By partnering with Lava, NEAR chooses to distribute its *infra budget to providers that offer the best service* in practice, based on real usage, uptime and performance. \\\\\\\\nThe majority of the budget doesn\\\\\\\\u{2019}t go to Lava, and it\\\\\\\\u{2019}s distributed to top providers and NEAR\\\\\\\\u{2019}s community.\\\\\\\\n\\\\\\\\n#### Lava is the primary RPC provider for NEAR, achieving significant milestones this year:\\\\\\\\n- Managing 50% of the traffic on rpc.near.org\\\\\\\\n- Serving 233,000 unique daily users on NEAR\\\\\\\\n- Handling over 43 billion NEAR RPC requests, 10B every month\\\\\\\\n- Powering leading dApps such as: Ref Finance, Burrow Finance, Bitte Protocol, Here wallet, Meteor, NEAR Mobile, Sender, Dragonbot, SHITZU, Allstake and more\\\\\\\\n\\\\\\\\n### Performance:\\\\\\\\n- 100% uptime in the last 6 months\\\\\\\\n- 185ms average latency across all regions\\\\\\\\n\\\\\\\\n![https://ipfs.near.social/ipfs/bafkreiai44wnbwgqlwz373446j5giz43tn7do4u7vcfbhlfkjuozqp76ve](https://ipfs.near.social/ipfs/bafkreiai44wnbwgqlwz373446j5giz43tn7do4u7vcfbhlfkjuozqp76ve)\\\\\\\\n\\\\\\\\n### Unique features:\\\\\\\\nOur highest goal is to ensure seamless UX. Users who access NEAR through Lava are connected with the best providers in their geolocation based on uptime, latency, and data freshness. If a provider fails to respond or returns an error, the user automatically switches to another provider without any manual effort or noticing the change.\\\\\\\\n\\\\\\\\n- **0 Errors for developers -** automatic fallback and retry before errors reach the end user\\\\\\\\n- **Faster TX execution -** transactions are sent to many providers at once, resulting in faster propagation and execution for end users\\\\\\\\n- **Instant responses -** on common and recent requests through smart cache\\\\\\\\n- **Super reliable and robust -** aggregating top RPC providers on a single endpoint\\\\\\\\n- **Public stats page -** showing health, usage and performance metrics, \\\\\\\\n\\\\\\\\n### Security\\\\\\\\n1. Security Measures:\\\\\\\\n- Comprehensive DDoS protection via Cloudflare, IP whitelisting, and 95-day log retention with detailed monitoring.\\\\\\\\n- 24/7 proactive monitoring and response team to ensure 100% uptime and quick incident management.\\\\\\\\n\\\\\\\\n2. Disaster Recovery Plan:\\\\\\\\n- Our globally distributed infrastructure, with servers strategically placed across multiple regions, ensures minimized downtime and complete mitigation of outages.\\\\\\\\n- Each region is equipped with failover load balancing, providing seamless service continuity even during localized failures. Regular backups further reinforce our ability to restore services quickly and efficiently, always ensuring uninterrupted operation.\\\\\\\\n\\\\\\\\n3. Compliance and Data Integrity:\\\\\\\\n- Adherence to data consistency standards, with transparent communication during service changes or disruptions. Our infrastructure ensures high security and compliance.\\\\\\\\n- Lava\\\\\\\\u{2019}s RPC serves five-time epochs and tracks all NEAR shards. It also offers an advanced data integrity mechanism that samples and cross-references RPC responses to detect and prevent inaccurate data.\\\\\\\\n\\\\\\\\n### Service Level Agreement\\\\\\\\nOur current services meet the RFP requirements with:\\\\\\\\n- Uptime: 100% over the last 6 months\\\\\\\\n- Average latency: 185ms across all regions\\\\\\\\n\\\\\\\\nTo further improve our SLA, we will:\\\\\\\\n- Deploy additional gateways in main regions (endpoints)\\\\\\\\n- Onboard more top providers\\\\\\\\n- Integrate readrpc\\\\\\\\n\\\\\\\\n### Support\\\\\\\\nWe currently support the NEAR community through both public and private channels. We will happily set up dedicated support channels for NEAR <> Lava users. We aim to respond to issues significantly faster than the standard 24-48 hour timeframe.\\\\\\\\n\\\\\\\\n**Bitte:**\\\\\\\\n*\\\\\\\\\\\\\\\"Since integrating Lava RPC, we have seen a significant improvement in the performance of Mintbase Wallet, resulting in fewer user complaints. **\\\\\\\\\\\\\\\"The support from the Lava team has been exceptional, with their quick responses making a real difference.\\\\\\\\\\\\\\\"***\\\\\\\\n\\\\\\\\n**Dragonbot:**\\\\\\\\n*\\\\\\\\\\\\\\\"We\\\\\\\\u{2019}ve been using Lava for our trading bot and were pleasantly surprised by the performance and low integration cost. Switching from our previous provider to Lava proved to be a great decision. **Their support team has consistently been available to address any issues, often going above and beyond to implement fixes, even on weekends.\\\\\\\\\\\\\\\"***\\\\\\\\n\\\\\\\\n### Updates and Changes\\\\\\\\nLava will update its RPC specifications in line with nearcore updates, and collaborate with providers to ensure smooth upgrades.\\\\\\\\n\\\\\\\\n### Transparent status page\\\\\\\\nLava will provide an openly available real-time status page where anyone can monitor the health and usage stats of rpc.near.org - including availability, performance, geolocation distribution, common queries, rate-limit enforcement, dapp usage, and the transition from public to private RPC.\\\\\\\\n\\\\\\\\nA sneak preview of the new dashboard :)\\\\\\\\n![https://ipfs.near.social/ipfs/bafkreie2ch35rz5k5pq7eenxndy67py2qllhu7chsowcruz7feauxjpg7m](https://ipfs.near.social/ipfs/bafkreie2ch35rz5k5pq7eenxndy67py2qllhu7chsowcruz7feauxjpg7m)\\\\\\\\n\\\\\\\\n![https://ipfs.near.social/ipfs/bafkreidg52g7etbckr2dksubku5ei6yiml653oavva3px23ygfnfad2ymq](https://ipfs.near.social/ipfs/bafkreidg52g7etbckr2dksubku5ei6yiml653oavva3px23ygfnfad2ymq)\\\\\\\\n\\\\\\\\n### Transition to Demo Environment\\\\\\\\nUsers exceeding rate limits will be redirected to Lava\\\\\\\\u{2019}s Gateway (and NEAR Docs), where they can purchase API subscriptions. Lava\\\\\\\\u{2019}s subscriptions include NEAR and 30+ other networks, making it very attractive for developers interested in using NEAR for Chain Abstraction.\\\\\\\\n\\\\\\\\nBy offering special discounts on multi-chain data access, Lava will accelerate rpc.near.org\\\\\\\\u{2019}s transition to a demo environment and NEAR\\\\\\\\u{2019}s alignment with Chain Abstraction.\\\\\\\\n\\\\\\\\n### Rate limits\\\\\\\\nWe analyzed data from our network which serves %50 of rpc.near.org traffic, and traffic from users on Ref, Burrow, Bitte, Sender, Meteor and more. \\\\\\\\n**We propose a data-driven approach to enforcing new rate limits:**\\\\\\\\n\\\\\\\\n![https://ipfs.near.social/ipfs/bafkreiery4nwgratznmprpfvhdame34hhlbtfd4zvrqtva56byfcjxscnu](https://ipfs.near.social/ipfs/bafkreiery4nwgratznmprpfvhdame34hhlbtfd4zvrqtva56byfcjxscnu)\\\\\\\\n\\\\\\\\n![https://ipfs.near.social/ipfs/bafkreigseauigdcc4pp2awpw4utepefxgvllxd3seg7xhdecazso44hbfa](https://ipfs.near.social/ipfs/bafkreigseauigdcc4pp2awpw4utepefxgvllxd3seg7xhdecazso44hbfa)\\\\\\\\n\\\\\\\\n#### Observations:\\\\\\\\n - Changing the rate-limit to 5 req/sec (RPS) will force 65-71% of users to drop, removing 99% of traffic from rpc.near.org\\\\\\\\n- Changing the rate-limit to 50-100 RPS will impact ~20% of users who are responsible for ~70% of traffic.\\\\\\\\n\\\\\\\\n#### Recommendations:\\\\\\\\nDevelopers in the NEAR ecosystem are used to having almost no limits on rpc.near.org. While that created some challenges, it also made it easier for dapps to thrive and innovate on NEAR.\\\\\\\\nRestricting access too much or too quickly might hurt many users and builders.\\\\\\\\n\\\\\\\\n**We recommend moving forward with a more moderate transition:**\\\\\\\\n\\\\\\\\t1. Current limit: 900 RPS\\\\\\\\n\\\\\\\\t2. November: Lava inherits rpc.near.org operations\\\\\\\\n\\\\\\\\t3. January: 500 RPS\\\\\\\\n\\\\\\\\t4. February: 250 RPS\\\\\\\\n\\\\\\\\t5. March: 100 RPS\\\\\\\\n\\\\\\\\t6. April-October: 50 RPS\\\\\\\\n\\\\\\\\nWe will closely monitor critical metrics (listed below) and collaborate with builders and the NEAR Infra Committee to find an optimal balance. Our goal is to allow early-stage developers to build freely while maintaining a clear path to upgrading as their projects grow.\\\\\\\\n\\\\\\\\n## Budget & Milestones\\\\\\\\n### Budget breakdown\\\\\\\\n**Total budget - $304,600 in NEAR for the first year**\\\\\\\\n\\\\\\\\n**1. Transition and Setup - $10,000**\\\\\\\\n- Transfer and testing of rpc.near.org\\\\\\\\n- Adding ReadRPC to Lava\\\\\\\\n- Onboarding more top providers\\\\\\\\n- Deploying additional servers for redundancy\\\\\\\\n- Statistics dashboard\\\\\\\\n- User and provider docs\\\\\\\\n\\\\\\\\n**2. RPC Incentives - $30,000 / month until March (including), $15,000 / month from April**\\\\\\\\n- RPC nodes\\\\\\\\n- Archive nodes increasing costs\\\\\\\\n\\\\\\\\n**3. Support & maintenance: 4,000$ / month until March (including), $2,800 / month from April**\\\\\\\\n- Hardware\\\\\\\\n- Devops\\\\\\\\n- User support\\\\\\\\n- Provider support\\\\\\\\n\\\\\\\\n### Milestones\\\\\\\\n**1. Milestone 1 (October 2024): Signing of agreement**\\\\\\\\n**2. Milestone 2 (November 2024): Inheriting rpc.near.org operations**\\\\\\\\n- Quick transition. From 50% of traffic handled by Lava to 100% in a few days\\\\\\\\n- Knowledge transfer including ReadRPC\\\\\\\\n- Onboard top providers\\\\\\\\n- Launch marketing campaign\\\\\\\\n- Launch public statistics dashboard\\\\\\\\n\\\\\\\\n**3. Milestone 3 (February 2025): Transitioning rpc.near.org to a demo environment**\\\\\\\\n- Multi-chain API subscriptions campaign\\\\\\\\n- Complete rate-limit roadmap\\\\\\\\n\\\\\\\\n### Contingency\\\\\\\\nOur pricing uses Compute Units, which range from 10 to 200 according to the intensity and resources required to perform different queries. Looking at our current NEAR usage, the average ration is 16.34 CUs/Query.\\\\\\\\n\\\\\\\\nBased on the current usage stats, rpc.near.org serves ~26B monthly requests, assuming base traffic is 10,000 RPS.\\\\\\\\n\\\\\\\\nWe ask for $1.634 for every 1M requests above 26B monthly requests / $0.1 for every 1 million monthly Compute Units beyond 425 billion.\\\\\\\\n\\\\\\\\n### Metrics\\\\\\\\nWe will track the following metrics to measure success across two key areas:\\\\\\\\n**1. Quality of service**\\\\\\\\n- Uptime\\\\\\\\n- Latency\\\\\\\\n- Data freshness\\\\\\\\n- Success rate\\\\\\\\n\\\\\\\\n**2. Transition to demo environment**\\\\\\\\n- Total traffic\\\\\\\\n- Active users\\\\\\\\n- 429 Errors\\\\\\\\n- Referred traffic from rpc.near.org to gateway.lavanet.xyz and https://docs.near.org/api/rpc/providers (UTMs)\\\\\\\\n- Subscription purchases\\\\\\\\n\\\\\\\\n## Organization\\\\\\\\nLava Foundation is a non-profit entity representing Lava\\\\\\\\u{2019}s token holders and DAO, leading the vision and development of Lava Network. Our specialized team offers vast experience in Web3 strategy, growth, marketing, and leading the vision and blockchain development. The Foundation collaborates with Magma Devs, a team of world-class builders and ex-founders. We\\\\\\\\u{2019}re already in the process of hiring ex-Pagoda SRE engineers.\\\\\\\\n\\\\\\\\nPrimary contact: Yuval Binder, BD Lead at Magma Devs\\\\\\\\nTotal size of teams: Lava Foundation (6), Magma Devs (25)\\\\\\\\nTotal engineerings: 22\\\\\\\\nTeam location: Global\\\\\\\\n\\\\\\\\nAmir Aaronson - Head of Lava Foundation\\\\\\\\nAmir has extensive experience in strategic oversight and innovation in technology enterprises. He has been active in the blockchain space since 2017 and up until recently served as the head of the foundation at Beam \\\\\\\\n\\\\\\\\nOmer Mishael - CTO at Lava Foundation\\\\\\\\nOmer specializes in RPC, consensus building, Layer 1 protocols, software design, and development.\\\\\\\\n\\\\\\\\nEthan Luc - Head of Marketing at Lava Foundation\\\\\\\\nEthan has previously managed the digital growth of hundreds of small and medium companies spending millions in quarterly marketing spend, and advising multiple blockchain startups on their go-to-market. Before Lava, he was building an NFT marketplace using social graphs for community discovery.\\\\\\\\n\\\\\\\\n## Professional Experience\\\\\\\\nPortfolio of Relevant Work:\\\\\\\\nLava has 3 years of experience building and maintaining robust RPC systems for blockchains and enterprises, specializing in boosting ecosystem-wide user experiences.\\\\\\\\n\\\\\\\\nOur customers and partners include NEAR, Starknet, Filecoin, Union, Axelar, Evmos, Cosmos and many more will be announced soon.\\\\\\\\n\\\\\\\\nAs the official RPC provider for Axelar, Evmos and Cosmos Hub, we\\\\\\\\u{2019}ve maintained 100% uptime over the last 6 months, and an average latency of 170ms at high-throughput environments.\\\\\\\\n\\\\\\\\nhttps://x.com/lavanetxyz/status/1823373406513090669\\\\\\\\nhttps://x.com/lavanetxyz/status/1832092166773944745\\\\\\\\n\\\\\\\\n### NEAR Experience\\\\\\\\nLava is the go-to RPC service in the ecosystem, chosen by leading teams like Pagoda, Ref & Burrow, Bitte, Meteor, NEAR Mobile, Dragonbot, Sender Wallet, Allstake and more\\\\\\\\nThrough close collaboration with NEAR Foundation and Pagoda, and by leveraging Lava\\\\\\\\\\\\'s decentralized tech, we have significantly enhanced the reliability of on-chain activities. \\\\\\\\n#### Solving \\\\\\\\\\\\'node does not track shard-id\\\\\\\\\\\\' errors\\\\\\\\nLava implemented a retry mechanism that automatically redirects queries to alternative providers when failures occur. This solution greatly increased transaction success rates and minimized errors that affected all RPC services on NEAR, degrading critical services like Meteor Wallet.\\\\\\\\n\\\\\\\\n#### Boosting Ref Finance latency and loading times\\\\\\\\nBy identifying and caching the most crucial API calls for app.ref.finance, we dramatically improved user experience and loading times.\\\\\\\\n\\\\\\\\n### In-house resources\\\\\\\\n- Design UX/UI\\\\\\\\n- Project management\\\\\\\\n- Customer Support\\\\\\\\n- BD and marketing\\\\\\\\n\\\\\\\\n### Testimonials\\\\\\\\n#### Daniel - CPO at Altiplanic, Evmos:\\\\\\\\n*\\\\\\\\u{201c}Lava has been a valuable partner in offering public RPC endpoints on Evmos. Their innovative approach of decentralizing RPC endpoints via incentivization has notably improved the stability, quality, and visibility or RPC services on the Evmos chain. We appreciate Lava for their significant contributions to the project\\\\\\\\u{2019}s success.\\\\\\\\u{201d}*\\\\\\\\n\\\\\\\\n#### Ref Finance: \\\\\\\\n*\\\\\\\\u{201c}Lava has been a crucial partner for Ref and Burrow Finance. We rely on their endpoint as the default RPC for our products and have been extremely satisfied with their performance, stability, and support. Since integrating Lava, we\\\\\\\\u{2019}ve experienced a noticeable reduction in errors.\\\\\\\\\\\\\\\"*\\\\\\\\n\\\\\\\\n#### Bitte:\\\\\\\\n*\\\\\\\\\\\\\\\"Since integrating Lava RPC, we have seen a significant improvement in the performance of Mintbase Wallet, resulting in fewer user complaints. **The support from the Lava team has been exceptional, with their quick responses making a real difference.\\\\\\\\\\\\\\\"***\\\\\\\\n\\\\\\\\n#### Dragonbot:\\\\\\\\n*\\\\\\\\\\\\\\\"We\\\\\\\\u{2019}ve been using Lava for our trading bot and were pleasantly surprised by the performance and low integration cost. Switching from our previous provider to Lava proved to be a great decision. **Their support team has consistently been available to address any issues, often going above and beyond to implement fixes, even on weekends.\\\\\\\\\\\\\\\"***\\\\\\\\n\\\\\\\\n#### ShardDog:\\\\\\\\n*\\\\\\\\u{201c}At ShardDog, Lava has quickly become an important piece within our tech stack. As usage grows but we stay as a small team, we need reliable infra to handle the scaling. Since adding this to our front-end and back-end APIs, it has allowed us to focus on improving our product instead of the infrastructure.\\\\\\\\\\\\\\\"*\\\\\\\\n\", \"linked_proposals\": [], \"receiver_account\": \"8d51039cd656f1d9716894420b62555b68022797e7214adf4f630c77caf1cf66\", \"requested_sponsor\": \"infrastructure-committee.near\", \"proposal_body_version\": \"V1\", \"requested_sponsorship_usd_amount\": \"304600\", \"requested_sponsorship_paid_in_currency\": \"NEAR\"}, \"labels\": []}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.4952883451932e+21
    }
  },
  {
    "id": "9665743723",
    "receipt_id": "BQ9xoxAnmjt54LaN8j3rHHwHrmTkUPUAbihMJD3BWpgN",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "social.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "3ic21VZtNCsWWkj6yPXGSM6easqZBTvGppTZusjxN9aC",
      "block_height": 131568845,
      "block_timestamp": 1730310783434710300
    },
    "receipt_outcome": {
      "gas_burnt": 3525190610613,
      "tokens_burnt": 352519061061300000000,
      "executor_account_id": "social.near",
      "status": true
    },
    "transaction_hash": "3F87UebSBLgHVr2rvwqUdcpzBiLapiGZjet8vDW3jNhg",
    "included_in_block_hash": "H8kdU2ZmoJNBAnyRo7XdqAT47ZgXnrNJGBcwftXu7dwu",
    "block_timestamp": "1730310780776301400",
    "block": {
      "block_height": 131568843
    },
    "receipt_conversion_tokens_burnt": "107500437206000000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set",
        "deposit": 0,
        "fee": 352519061061300000000,
        "args": "{\"data\": {\"infrastructure-committee.near\": {\"index\": {\"notify\": \"{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"8d51039cd656f1d9716894420b62555b68022797e7214adf4f630c77caf1cf66\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"proposal/edit\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"proposal\\\\\\\\\\\\\\\":43,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"trechriron71.near\\\\\\\\\\\\\\\"}}\"}}}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.4952883451932e+21
    }
  },
  {
    "id": "9665750453",
    "receipt_id": "8Z7UXcnMs6J6TdukectCy8y7T1F6B5wgxnysfRaSNxCS",
    "predecessor_account_id": "trechriron71.near",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "3VjvqSiM34XhWXBkEYmejS9D5u6fQZWyz97BLTcpkBNB",
      "block_height": 131568857,
      "block_timestamp": 1730310798313490000
    },
    "receipt_outcome": {
      "gas_burnt": 7878927950541,
      "tokens_burnt": 787892795054100000000,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "J4QvpmS36w6qYY7n3ZEj5QWH3tf63RPrbEPX4speUc3w",
    "included_in_block_hash": "DpZwv2wuQFLzarnVFFJtt7Djtqk7Eh1FQWUFiotzFEDn",
    "block_timestamp": "1730310797244085636",
    "block": {
      "block_height": 131568856
    },
    "receipt_conversion_tokens_burnt": "101067904052500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "edit_proposal",
        "deposit": 0,
        "fee": 787892795054100000000,
        "args": "{\"id\": 42, \"body\": {\"name\": \"BlockJoy - High-performance, Secure, and Decentralized Public RPC\", \"summary\": \"This proposal is submitted in response to the RFQ for the management and development of the near.org RPC service. Our team, with extensive experience in blockchain RPC infrastructure, is committed to providing a high-performance, secure, and decentralized RPC service that aligns with NEAR\\\\\\\\\\\\'s vision and Web3 values. Additionally we are very keen on Near\\\\\\\\u{2019}s vision and the approach to sharding and have been active token holders long before this proposal.\\\\\\\\n\", \"category\": \"Infrastructure Committee\", \"timeline\": {\"status\": \"REJECTED\", \"sponsor_requested_review\": false, \"reviewer_completed_attestation\": false}, \"linked_rfp\": 2, \"supervisor\": \"trechriron71.near\", \"description\": \"### Overview\\\\\\\\nThis proposal is submitted in response to the RFQ for the management and development of the near.org RPC service. Our team, with extensive experience in blockchain RPC infrastructure, is committed to providing a high-performance, secure, and decentralized RPC service that aligns with NEAR\\\\\\\\\\\\'s vision and Web3 values. Additionally we are very keen on Near\\\\\\\\u{2019}s vision and the approach to sharding and have been active token holders long before this proposal.\\\\\\\\n\\\\\\\\n### Organization\\\\\\\\nBlockJoy is a venture-backed Delaware C-Corporation with its headquarters in Boston, MA. BlockJoy specializes in Node Operation and Management and is backed by Gradient Ventures (Google\\\\\\\\u{2019}s venture arm), Borderless Capital, Draper Dragon, Tribe Capital, Active Capital, and other crypto and infrastructure investors.\\\\\\\\n\\\\\\\\n**Primary Contact Information:**\\\\\\\\n  - Name: Eric Ullrich\\\\\\\\n  - Email: eric@blockjoy.com\\\\\\\\n\\\\\\\\n**Team Size and Location:**\\\\\\\\n  - Whole Team: 13\\\\\\\\n  - Engineering Team: 9\\\\\\\\n  - Location: Global distributed with US headquarters.\\\\\\\\n\\\\\\\\n **Team Background and Bios:**\\\\\\\\nOur team consists of experienced professionals with a strong background in devops, blockchain technology and RPC infrastructure management. Key team members include:\\\\\\\\n- Chris Bruce, CEO - 5x Technical Founder, formerly Head of Product Development and Board of Directors at Helium, https://www.linkedin.com/in/chrisabruce/\\\\\\\\n- Caleb Call, VP Infrastructure, formerly Head of Platform Engineering at Ripple, https://www.linkedin.com/in/calebcall/\\\\\\\\n- Matei Popa, Blockchain Reliability Engineer, previously Senior DevOps Engineer at CoW Protocol, https://www.linkedin.com/in/mateipopa/\\\\\\\\n- Cade Call, Blockchain Reliability Engineer, previously Lead DevOps Engineer at Medici Ventures, https://www.linkedin.com/in/cadecall/\\\\\\\\n\\\\\\\\n\\\\\\\\n### Professional Experience\\\\\\\\n- BlockJoy started as one of the most successful Validators as a Service platforms on Helium and at one point was operating over 50% of the Helium network. Our services offered the best cost-to-performance ratio and had the highest ROI out of all the other providers.\\\\\\\\n- We later ran Helium\\\\\\\\u{2019}s entire public API. Consisting of over 30 clustered Postgres servers with 40TB of data each and 20 application servers (scaling as high as 100 when needed). We migrated Helium off AWS and ran everything in house on bare metal hardware. We implemented our own custom caching configuration, multi-region load balancing, and rate limiting. At its peak, we were handling over 300M requests/day. Additionally, we ran nearly 20 private APIs for companies like Binance, Crypto.com, Seed, and Nova Labs.\\\\\\\\n- Today we use the same custom built infrastructure to run over 500 nodes with support for over 30 protocols and adding new protocols and nodes weekly. We are currently serving nearly 2B rpc requests per month.\\\\\\\\n\\\\\\\\n**Examples of Relevant Experience with Helium Blockchain Public RPC:**\\\\\\\\n- Operated Helium\\\\\\\\u{2019}s entire public API, in house on bare metal\\\\\\\\n- Operated the largest Validators as a Service for the Helium Network, 1600 validators\\\\\\\\n- Using our custom build infrastructure, we saved helium over $2M/year in operational costs\\\\\\\\n- Our Helium validators had the lowest cost and highest ROI out of the entire network\\\\\\\\n- Ran private Helium APIs for Binance, Crypto.com, Seed, and Nova Labs\\\\\\\\n\\\\\\\\n**Examples of Relevant Experience with NEAR Blockchain:**\\\\\\\\n- Integration of NEAR Blockchain to BlockVisor, enabling one-click deployment of high performance, unmetered RPC nodes to any server.  Features of Blockvisor include: one-click deployment, monitoring, alerting, logging on per node instance, efficient image upgrade and downgrade procedure, fast enrollment of new server to system, powerful management UX. All on bare metal servers resulting in lower costs and higher performance.\\\\\\\\n\\\\\\\\n### Main Appproach and Solution\\\\\\\\n- BlockJoy has developed a purpose-built suite of tools designed specifically for operating and managing Blockchain Nodes on bare metal servers (servers running without virtual machines, docker, or kubernetes) without the mismatched Web2 tooling. These tools enable BlockJoy to run nodes in a highly performant manner resulting in higher throughput and lower operating costs than is typically seen on virtual machine and container based systems. Based on our experience, we can typically operate at 20% or less the cost of running on the cloud. Furthermore, we typically remove 3-5ms from response times of container based virtualization.\\\\\\\\n- For execution of this grant, we will utilize BlockJoy\\\\\\\\u{2019}s purpose-built node orchestration technology to efficiently handle node deployment, version updates, monitoring and alerting of full nodes and archive nodes. \\\\\\\\n- We will leverage our partnerships with several of the leading bare metal datacenter providers around the world for our bare metal servers and use best in class hardware (Gen4 AMD EPYC CPUs, NVMe5 disks, and a 10Gb network.) We strongly believe this helps to build a more diverse and resilient network that all protocols should be striving for. As a case in point, Hetzner, without notice, decided to pull the plug on all Solana validators running within their data centers, resulting in around 30% of solana\\\\\\\\u{2019}s validators going offline and triggering a huge token price crash. \\\\\\\\n- We will implement a robust load balancer to ensure high availability throughput and low latency. This system will incorporate global load balancing to efficiently route traffic to the nearest RPC nodes. We will establish rate limiting based on criteria such as URI, request volume across multiple time windows, upstream host capabilities, number of connections to the upstream host, response time, and IP address. Additionally, our solution will include caching specific calls to provide quicker response times. We will also conduct automatic health checks on upstream nodes to swiftly identify and replace any unhealthy nodes from the network, ensuring continuous and reliable service.\\\\\\\\n- We will implement a monitoring and alerting system that includes the following components:\\\\\\\\n  - External Synthetic Checks: Conducted from eight geographic locations to ensure nodes are operational and responding with expected results. Alerts will be triggered for failures such as non-200 responses, long response times, or unexpected responses.\\\\\\\\n  - Ping Checks: Performed on every host system to verify simple up/down status, with alerts issued if a system goes down.\\\\\\\\n  - Full System Metrics: Monitored for prolonged high CPU load, high memory usage, and low disk space, with alerts for any prolonged issues.\\\\\\\\n  - System and Blockchain Logs Collection: Alerts will be generated for error events, out-of-memory events, and blockchain-specific events as appropriate.\\\\\\\\n  - Full Blockchain Metrics Collection: Monitored from the client side, with alerts for RPC errors and other protocol-specific metrics.\\\\\\\\n  - Load Balancer Monitoring: Includes external synthetic checks from eight geographic locations to ensure functionality, with alerts for failures such as non-200 responses or unexpected results.\\\\\\\\n  - External-Facing Status Page: We will implement a nice looking custom status page utilizing a tool such as Atlassian Statuspage.\\\\\\\\n- We will implement a comprehensive security plan that includes robust DDoS protection via Cloudflare with IP whitelisting and blocking capabilities. We maintain detailed logging and monitoring with 13-month retention allowing for year-over-year analysis and behavior trends, utilizing the LGTM stack (Loki, Grafana, Tempo, and Mimir). \\\\\\\\n- Disaster recovery will be addressed through our regular snapshot service.  We maintain nodes that are used to take regular snapshots, we then store multiple versions of those snapshots which allows us to quickly deploy new nodes.  This also allows us to scale very quickly as well if there are unexpected sustained surges in traffic.  In addition to maintaining snapshots, we\\\\\\\\u{2019}ve established strategic partnerships with Data Centers throughout the world maintaining strong relationships and ensuring we\\\\\\\\u{2019}re not reliant on any one hardware provider.\\\\\\\\n- BlockJoy\\\\\\\\\\\\'s SRE team will provide ad-hoc support on community forums, GitHub issues, and developer community channels such as Slack, Telegram, and Discord, with best-effort responses within 24-48 hours for generic services. We will assist in updating documentation for node operation on near.org.  Additionally, we will offer white-glove service support to facilitate the transition of high-priority overflow business, assisting in the migration of high-value users from public RPC to private NEAR RPC providers.\\\\\\\\n\\\\\\\\n**Why Choose This Project:**\\\\\\\\n- Our team offers proven expertise in high-performance RPC infrastructure, a strong understanding of NEAR protocol architecture, and a commitment to decentralization and open-source principles.\\\\\\\\nWe believe in the philosophy of the Near token project and our founder has been a Near token holder long before the last Crypto crash.\\\\\\\\n- Our team has extensive experience in building and maintaining high-performance public RPC infrastructure on decentralized networks of bare metal servers for tier one blockchain networks such as Helium and Ripple. Additionally, we have on staff software developers constantly improving our tooling so our nodes can perform their best.\\\\\\\\n- We have a strong understanding of NEAR protocol architecture and technical specifications.\\\\\\\\n- We have a proven track record of handling high transaction volumes and ensuring low latency in a cost efficient manner.\\\\\\\\n- Lastly, our software is designed to run and manage blockchain nodes on any infrastructure. By distributing nodes across multiple bare metal vendors (instead of centralizing it to our own hardware) and not utilizing traditional Cloud companies, we help to make the Near Network more diverse and more resilient. \\\\\\\\n### Goals / Milestones\\\\\\\\n**Transition Timeline:**\\\\\\\\n- Nov 1st: Initial knowledge transfer and transition planning. Support in transition of high value public endpoint users to dedicated RPC clusters through BlockJoy or other 3rd party RPC solutions.\\\\\\\\n- December 1st: Implementation of all dedicated Near RPC nodes and load balancer across 7 data centers globally.  Initial testing and monitoring implementation\\\\\\\\n- January 1st: Transition to BlockJoy load balancing and monitoring and alerting infrastructure.\\\\\\\\n- February 1st: Complete transition and operational handover.\\\\\\\\n\\\\\\\\n**Deliverables:**\\\\\\\\nAs part of our grant deliverables, we will establish a fully operational free-tier-only NEAR.org RPC service with the following features:\\\\\\\\n- Response Time latency \\\\\\\\u{2264} 200ms\\\\\\\\n- High Availability Throughput: See budget breakdown for details based on various scenarios.\\\\\\\\n- Service Level Agreement: Ensuring 99.99% uptime.\\\\\\\\n- External-Facing Status Page: To communicate system status and updates effectively.\\\\\\\\n- White-Glove Service Support: Assisting high-value RPC NEAR Foundation partners (dApps) in transitioning to private RPC solutions\\\\\\\\n\\\\\\\\n**Success Measurement:**\\\\\\\\n- Project success will be measured by achieving the following key performance indicators (KPIs):\\\\\\\\n- Uptime: Maintain a 99.99% monthly uptime.\\\\\\\\n- Performance: Providing extremely low response time latency averaging 200 ms or better.\\\\\\\\n- User Transition: Successfully transition high-value users to private RPC options through BlockJoy\\\\\\\\\\\\'s dedicated node clusters or other providers.\\\\\\\\n- Developer support: Successfully supporting and growth the near developers ecosystem through engagement on forums and through maintaining updated documentation.\\\\\\\\n### Budget\\\\\\\\n- **Budget Total:**\\\\\\\\n  - $26,088 per month, 6 month minimum commitment\\\\\\\\n- **Budget Breakdown:**\\\\\\\\n\\\\\\\\n![https://ipfs.near.social/ipfs/bafkreih5ravkgskospg45wo52zr2ofk4bw76f6g4vle7wlrrkum5k2g6ha](https://ipfs.near.social/ipfs/bafkreih5ravkgskospg45wo52zr2ofk4bw76f6g4vle7wlrrkum5k2g6ha)\\\\\\\\n\\\\\\\\n**Budget Narrative:**\\\\\\\\nOur proposed budget is based on Scenario 1, which assumes there will be a minimum of 50% reduction in total request volume to near.org RPCs due to the efforts to transition high usage accounts to private providers.  However if aggregate usage averages a 10x reduction or greater from current levels, we propose the scenario 2 budget.  A detailed unit-based analysis supporting the proposed budget is [available here.](https://docs.google.com/spreadsheets/d/1DM7GGguhDPMYfSDe2D7VEAnTlbY1ECwvmrSexc9FwXc/edit?gid=0#gid=0)\\\\\\\\n- Salaries: Contributing to engineering staff that will be responsible for deployment, testing, maintenance, incident response, and SRE efforts.\\\\\\\\n- Infrastructure Costs:  In Scenario 2 we anticipate supporting an average of 5k RPS, with capacity to burst up over 8k RPS.  To achieve this we anticipate running the following nodes: 10 mainnet-full, 4 mainnet-archive, 2 testnet-full, 2 testnet-archive. This alongside our caching technology will ensure excellent latency and reliability.\\\\\\\\n- Third-party Services Costs: This includes software fees of $1,600 for services such as Grafana and a hosted status page.\\\\\\\\n- Load Balancer Cost: Assuming average of 11B requests per month at $0.3 per 500k requests.\\\\\\\\n- This budget strategy ensures that Near.org RPC receives excellent service, while not overpaying for unused capacity for an extended period of time. \\\\\\\\n### Testimonials:**\\\\\\\\n> Since switching to BlockJoy, we are now able to run our API nodes outside legacy cloud providers, and we anticipate saving over 60% of our operating costs. This partnership has also saved our team hundreds of hours per month by no longer having to manage daily fires. The cost and time saved have already made a significant difference in our operations, and we\\\\\\\\u{2019}re excited to see how far this partnership takes Us. \\\\\\\\n-- Marc Nijdam, CTO, NOVA LABS\\\\\\\\n\", \"linked_proposals\": [], \"receiver_account\": \"blockjoyw3.near\", \"requested_sponsor\": \"infrastructure-committee.near\", \"proposal_body_version\": \"V1\", \"requested_sponsorship_usd_amount\": \"156528\", \"requested_sponsorship_paid_in_currency\": \"USDC\"}, \"labels\": []}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.2470085425383e+21
    }
  },
  {
    "id": "9665751970",
    "receipt_id": "5jqKiczjKAFsY4drrYszwvcifRWtpyzEjSs4zoqr5Hdx",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "social.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "HLAhX3aRNGCCSDBYDBrD4wYF6iTPbfwRWU2gXfbU4nMh",
      "block_height": 131568858,
      "block_timestamp": 1730310799632945200
    },
    "receipt_outcome": {
      "gas_burnt": 3580478434317,
      "tokens_burnt": 358047843431700000000,
      "executor_account_id": "social.near",
      "status": true
    },
    "transaction_hash": "J4QvpmS36w6qYY7n3ZEj5QWH3tf63RPrbEPX4speUc3w",
    "included_in_block_hash": "DpZwv2wuQFLzarnVFFJtt7Djtqk7Eh1FQWUFiotzFEDn",
    "block_timestamp": "1730310797244085636",
    "block": {
      "block_height": 131568856
    },
    "receipt_conversion_tokens_burnt": "101067904052500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set",
        "deposit": 0,
        "fee": 358047843431700000000,
        "args": "{\"data\": {\"infrastructure-committee.near\": {\"index\": {\"notify\": \"{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"6774b99e89ff2cf881a303932afe3c01f5923651f634c18e54876a40209e7a34\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"proposal/edit\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"proposal\\\\\\\\\\\\\\\":42,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"trechriron71.near\\\\\\\\\\\\\\\"}}\"}}}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.2470085425383e+21
    }
  },
  {
    "id": "9665760692",
    "receipt_id": "Fbk9DcmmqHcaPKx7eNDnuoDoQP1D1qRd3vggftHd1Mur",
    "predecessor_account_id": "trechriron71.near",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "6hGRS2X7HzkSiXhDfCmSWULGiBuPPoa6kqzvSP5kCH2X",
      "block_height": 131568869,
      "block_timestamp": 1730310814085314600
    },
    "receipt_outcome": {
      "gas_burnt": 5595211861495,
      "tokens_burnt": 559521186149500000000,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "2suMSnp6UyRYc9sAsjkR9h9qErqaeH1CsJSgmkE8vy9g",
    "included_in_block_hash": "9pbiRVwFqaiYsDxm6kf987KJbmzV4EE5eyHYqPFcmPes",
    "block_timestamp": "1730310812811637755",
    "block": {
      "block_height": 131568868
    },
    "receipt_conversion_tokens_burnt": "60050372409500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "edit_proposal",
        "deposit": 0,
        "fee": 559521186149500000000,
        "args": "{\"id\": 40, \"body\": {\"name\": \"NEAR Lake Support by FASTNEAR\", \"summary\": \"Support NEAR Lake by FASTNEAR by utilizing existing nodes from NEARDATA\", \"category\": \"Infrastructure Committee\", \"timeline\": {\"status\": \"REJECTED\", \"sponsor_requested_review\": false, \"reviewer_completed_attestation\": false}, \"linked_rfp\": 3, \"supervisor\": \"trechriron71.near\", \"description\": \"# NEAR Lake Support by FASTNEAR\\\\\\\\n\\\\\\\\n## Organization\\\\\\\\n\\\\\\\\nFASTNEAR\\\\\\\\n\\\\\\\\n### Primary person\\\\\\\\\\\\'s contact information\\\\\\\\nEvgeny Kuzyakov (ek@fastnear.com)\\\\\\\\n\\\\\\\\n### About\\\\\\\\n\\\\\\\\n[FASTNEAR](https://fastnear.com) is NEAR Protocol Infrastructure Provider.\\\\\\\\n\\\\\\\\n#### [Services](https://fastnear.com/services)\\\\\\\\n- RPC endpoints\\\\\\\\n- API for wallets\\\\\\\\n- Snapshot data\\\\\\\\n- Indexing and Lake solutions (see https://neardata.xyz)\\\\\\\\n- Validator services\\\\\\\\n\\\\\\\\n#### Key Features\\\\\\\\n1. **Dedicated to NEAR Protocol:** We exclusively serve the NEAR ecosystem.\\\\\\\\n2. **High-Performance Infrastructure:** \\\\\\\\n   - The majority of nodes and servers hosted on bare-metal.\\\\\\\\n   - Currently handling ~4,000 RPC requests per second. Resulting in 320M calls per day.\\\\\\\\n\\\\\\\\n#### Reliability and Security\\\\\\\\n- Experienced in handling:\\\\\\\\n  - Traffic surges of 30,000 RPS\\\\\\\\n  - DDoS attacks (recently)\\\\\\\\n  - Provider outages\\\\\\\\n  - Testnet/mainnet issues\\\\\\\\n- Free NEAR Lake alternative at https://neardata.xyz\\\\\\\\n\\\\\\\\n#### Monitoring and Performance\\\\\\\\n- Internal monitoring and alert systems\\\\\\\\n- External status page https://status.fastnear.com\\\\\\\\n\\\\\\\\n## Body\\\\\\\\n\\\\\\\\n### (Background) NEARDATA by FASTNEAR\\\\\\\\n\\\\\\\\nFASTNEAR provides a simple and free alternative to the publicly available S3-based service NEAR Lake Framework called NEARDATA (https://neardata.xyz).\\\\\\\\n\\\\\\\\nFeatures:\\\\\\\\n- Data is grouped by blocks.\\\\\\\\n- Data is accessible through HTTPS for free.\\\\\\\\n- Each `ExecutionOutcome` for every Action Receipt contains originating transaction hash.\\\\\\\\n- Data is cached locally and by Cloudflare.\\\\\\\\n- Ability to read blocks from the browser.\\\\\\\\n- Ability to get recent optimistic blocks.\\\\\\\\n- Ability to download raw archived data. Useful for backfills.\\\\\\\\n\\\\\\\\nExample of the blocks timestamp to the wall time latency from NEARDATA:\\\\\\\\n![NEARDATA Latency](https://gist.github.com/user-attachments/assets/f0033340-0d66-4c92-be45-14e632bb9df8)\\\\\\\\n\\\\\\\\nFASTNEAR is already indexing and serving the following:\\\\\\\\n- NEAR Mainnet Final blocks\\\\\\\\n- NEAR Mainnet Optimistic blocks (with an average of 1- second wall to block-timestamp latency)\\\\\\\\n- NEAR Testnet Final blocks https://testnet.neardata.xyz\\\\\\\\n- NEAR Testnet Optimistic blocks\\\\\\\\n\\\\\\\\nWe provide data in the following formats:\\\\\\\\n- Full indexed blocks (including all data for all shards) in JSON file accessible throught HTTPS. Examples:\\\\\\\\n    - Latest finalized mainnet block: https://mainnet.neardata.xyz/v0/last_block/final\\\\\\\\n    - Latest optimistic mainnet block: https://mainnet.neardata.xyz/v0/last_block/optimistic\\\\\\\\n    - Latest finalized testnet block: https://testnet.neardata.xyz/v0/last_block/final\\\\\\\\n    - Block `123456789` on mainnet: https://mainnet.neardata.xyz/v0/block/123456789\\\\\\\\n    - Block `123456789` on testnet: https://testnet.neardata.xyz/v0/block/123456789\\\\\\\\n- Pending finalized blocks. When you request a block by height that is close to the head, but is not produced yet, the server will hold the connection until the block becomes available. Making it easy to implement indexers.\\\\\\\\n- Archival data by 10 block archives, allows to quickly backfill data. Available for mainnet and testnet:\\\\\\\\n    - Older mainnet data: https://a0.mainnet.neardata.xyz/raw/\\\\\\\\n    - Recent mainnet data: https://mainnet.neardata.xyz/raw/\\\\\\\\n    - Testnet data: https://mainnet.neardata.xyz/raw/\\\\\\\\n\\\\\\\\nThe whole indexing and servers are open-sourced with README: https://github.com/fastnear/neardata-server\\\\\\\\n \\\\\\\\n### Proposal\\\\\\\\n\\\\\\\\nFASTNEAR offers support for the existing S3-based NEAR Lake solution.\\\\\\\\n\\\\\\\\nWe\\\\\\\\\\\\'ll utilize existing indexing NEARDATA nodes to also write data to the S3-based NEAR Lake.\\\\\\\\n\\\\\\\\n### Cost estimates\\\\\\\\n\\\\\\\\n#### Nodes\\\\\\\\n\\\\\\\\nWe don\\\\\\\\\\\\'t include the cost of the hardware nodes into this proposal, because we are already covering it as part of NEARDATA. Consider the nodes cost included into the monthly maintenance fee.\\\\\\\\n\\\\\\\\nNote, that in the future a single node for all shards might not be sufficient, so indexing nodes will need to produce shards independently. That\\\\\\\\\\\\'s where our expertise of the customized setups will be helpful.\\\\\\\\n\\\\\\\\n#### S3\\\\\\\\n\\\\\\\\nThere is very good S3 cost estimate provided in the following proposal by Aurora Labs: https://near.social/infrastructure-committee.near/widget/app?page=proposal&id=28\\\\\\\\n\\\\\\\\nWe recommend a few adjustments to the estimate:\\\\\\\\n- The storage might grow due to the increase in the number of shards. Rumors are there will be 10 shards by the EOY, which might increase throughput of the network and the amount of data.\\\\\\\\n- Target blocks per second should be `1`.\\\\\\\\n- The current storage is around 40Tb for the mainnet and 8Tb for the testnet.\\\\\\\\n\\\\\\\\nBreakdown:\\\\\\\\n- S3 storage per month (at 84Tb avg): $2107.39\\\\\\\\n- Estimated objects per network per month: 28,908,000\\\\\\\\n- Writes per month: $936.6\\\\\\\\n- Reads per month: $63\\\\\\\\n- Safety margin: 20%\\\\\\\\n- Total: **$3804 per month**\\\\\\\\n\\\\\\\\n#### Maintenance\\\\\\\\n\\\\\\\\nWe ask for **$8,000** a month for maintenance and support.\\\\\\\\n\\\\\\\\n## Goals / Milestones\\\\\\\\n\\\\\\\\n- Knowledge transfer (1 week)\\\\\\\\n- Setup nodes once the write access is received (1 week)\\\\\\\\n- Transfer of S3 bucket ownership\\\\\\\\n- Dedicated status page entry (2 weeks)\\\\\\\\n- Public latency monitoring dashboard (2 weeks)\\\\\\\\n- Documentation updates if necessary (4 weeks)\\\\\\\\n\\\\\\\\n## Metrics\\\\\\\\n\\\\\\\\n- Block timestamp to wall latency (expected most blocks to be available under 5 seconds). Similar to a live latency test from NEARDATA https://neardata.xyz/\\\\\\\\n- Uptime (expected 99.9%)\\\\\\\\n- Consistency: no-skipped data\\\\\\\\n\\\\\\\\n### Compensation\\\\\\\\n\\\\\\\\nFor maintenance and development we ask for $12,000 a month.\\\\\\\\n\\\\\\\\n## Budget\\\\\\\\n\\\\\\\\n$11,800 per month (paid monthly) for the duration of 12 months.\\\\\\\\n- $3,800 AWS S3\\\\\\\\n- $8,000 maintenance \\\\\\\\n\", \"linked_proposals\": [], \"receiver_account\": \"treasury.fastnear.tg\", \"requested_sponsor\": \"infrastructure-committee.near\", \"proposal_body_version\": \"V1\", \"requested_sponsorship_usd_amount\": \"141600\", \"requested_sponsorship_paid_in_currency\": \"USDC\"}, \"labels\": []}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 971711492671900000000
    }
  },
  {
    "id": "9665761635",
    "receipt_id": "8dqYNKgKDCZqeoMQHth86fpMvw4VaJtb4LL64mv3ihVg",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "social.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "ELDQFFAaNpivxxbPdEU4En8HtrgAJqdtomwrkPncALac",
      "block_height": 131568870,
      "block_timestamp": 1730310815393256400
    },
    "receipt_outcome": {
      "gas_burnt": 3521399341129,
      "tokens_burnt": 352139934112900000000,
      "executor_account_id": "social.near",
      "status": true
    },
    "transaction_hash": "2suMSnp6UyRYc9sAsjkR9h9qErqaeH1CsJSgmkE8vy9g",
    "included_in_block_hash": "9pbiRVwFqaiYsDxm6kf987KJbmzV4EE5eyHYqPFcmPes",
    "block_timestamp": "1730310812811637755",
    "block": {
      "block_height": 131568868
    },
    "receipt_conversion_tokens_burnt": "60050372409500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set",
        "deposit": 0,
        "fee": 352139934112900000000,
        "args": "{\"data\": {\"infrastructure-committee.near\": {\"index\": {\"notify\": \"{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"mob.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"proposal/edit\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"proposal\\\\\\\\\\\\\\\":40,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"trechriron71.near\\\\\\\\\\\\\\\"}}\"}}}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 971711492671900000000
    }
  },
  {
    "id": "9666262298",
    "receipt_id": "Cj87YsHRJPu1c6q2AagqppAgtKMtW3YjYVEQyrssjasJ",
    "predecessor_account_id": "trechriron71.near",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "F4jxHpoTLi3FYGjHfeYwLgZYyDsygk47cn48AUFCZMWX",
      "block_height": 131570131,
      "block_timestamp": 1730312351284556300
    },
    "receipt_outcome": {
      "gas_burnt": 6655700751319,
      "tokens_burnt": 665570075131900000000,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "9FsfcNLT6JCrbqHswcHTRXQroArpwcPYyPfwrv28eAih",
    "included_in_block_hash": "89up5e9UotiZ9jxbGW97phwRTHyxFjNBVkFNfUvG2CtU",
    "block_timestamp": "1730312350004119851",
    "block": {
      "block_height": 131570130
    },
    "receipt_conversion_tokens_burnt": "63245181314500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "edit_proposal",
        "deposit": 0,
        "fee": 665570075131900000000,
        "args": "{\"id\": 28, \"body\": {\"name\": \"Aurora Labs: NEAR Lake\", \"summary\": \"Aurora Labs proposes to take over the NEAR Lake service for further maintenance and development.\", \"category\": \"Infrastructure Committee\", \"timeline\": {\"status\": \"APPROVED\", \"sponsor_requested_review\": false, \"reviewer_completed_attestation\": false}, \"linked_rfp\": 3, \"supervisor\": \"trechriron71.near\", \"description\": \"## Organization\\\\\\\\n\\\\\\\\n### Primary person\\\\\\\\u{2019}s contact information\\\\\\\\n\\\\\\\\nAlex Shevchenko ([alex.shevchenko@aurora.dev](alex.shevchenko@aurora.dev)) - Aurora Labs CEO\\\\\\\\n\\\\\\\\n### Project DRIs\\\\\\\\n\\\\\\\\nDimitar Petkov ([dimitar.petkov@aurora.dev](dimitar.petkov@aurora.dev))\\\\\\\\nDmitry Strokov ([dmitry.strokov@aurora.dev](dimitar.petkov@aurora.dev))\\\\\\\\n\\\\\\\\n### Size of the whole team\\\\\\\\n\\\\\\\\n48 people\\\\\\\\n\\\\\\\\n### Size of the engineering team\\\\\\\\n\\\\\\\\n23 people\\\\\\\\n\\\\\\\\n## Professional Experience\\\\\\\\n\\\\\\\\n### Examples of relevant experience with NEAR blockchain\\\\\\\\n\\\\\\\\nAurora Labs\\\\\\\\u{2019} engineering team has developed significant expertise in indexing, storing, and distributing blockchain data to meet the demands of internal infrastructure. Over the past two and a half years, the focus has been on building and refining a robust data pipeline designed to deliver maximum speed, high availability, fault tolerance, and efficient global data access.\\\\\\\\n\\\\\\\\nTo support these capabilities, the team includes engineers with experience in the relevant parts of the nearcore codebase, which enables the maintenance and customization of an in-house version of the NEAR Indexer using the NEAR Indexer Framework. This specialized knowledge has been instrumental in operating instances of nearcores and NEAR Indexers, ensuring that Aurora RPC services consistently achieve high availability and performance.\\\\\\\\n\\\\\\\\nThe entire infrastructure is continuously monitored and backed-up to maintain optimal performance and reliability across various regions worldwide, aligning with the company\\\\\\\\\\\\'s commitment to delivering resilient and responsive blockchain services.\\\\\\\\n\\\\\\\\n## Body\\\\\\\\n\\\\\\\\nThe proposed solution involves adopting the current setup for NEAR Lake from the Pagoda team, with a focus on ensuring reliability and high availability, eliminating potential vulnerabilities, and establishing comprehensive monitoring. The approach includes deploying new or additional indexer instances if necessary to meet failover/latency demands.\\\\\\\\n\\\\\\\\nAdditionally, there is a plan to potentially integrate the process of writing to NEAR Lake into the existing infrastructure pipeline in the future, aiming to reduce operational costs by reusing data from the indexers for both internal needs of Aurora infrastructure and the needs of NEAR Lake.\\\\\\\\n\\\\\\\\n## Goals / Milestones\\\\\\\\n\\\\\\\\n1. Conduct knowledge transfer sessions with the Pagoda team\\\\\\\\n2. Take over the ownership of S3 buckets\\\\\\\\n3. Deploy new/additional indexers\\\\\\\\n4. Set up indexers monitoring\\\\\\\\n5. Set up lake progression monitoring\\\\\\\\n6. Set up public status-page\\\\\\\\n7. Update all relevant documentation, take over support channels\\\\\\\\n8. Make announcements, finish the hand-over\\\\\\\\n9. (Optional/Later): integrate lake indexer with existing Aurora infrastructure\\\\\\\\n\\\\\\\\n## Metrics\\\\\\\\n\\\\\\\\nKey things that have to be tracked:\\\\\\\\n- Per-indexer metrics - have to be exported from indexer instances:\\\\\\\\n\\\\\\\\t- Liveness status\\\\\\\\n\\\\\\\\t- Sync/unsync status\\\\\\\\n\\\\\\\\t- Current progression\\\\\\\\n\\\\\\\\t- Errors\\\\\\\\n- Bucket progression metrics - shall be measured by reading from S3 using lake client library (indexer framework):\\\\\\\\n\\\\\\\\t- Current progression\\\\\\\\n\\\\\\\\t- Fetching/parsing errors\\\\\\\\n\\\\\\\\t- Lag from the final block (shall be compared against final block querying from RPC)\\\\\\\\n- Total uptime is calculated as: total time when lag was less than 5 blocks\\\\\\\\n\\\\\\\\nSuccess condition: uptime during the evaluation period is at least 99.9%\\\\\\\\n\\\\\\\\n## Budget\\\\\\\\n\\\\\\\\nThe budget might be re-evaluated in future due to:\\\\\\\\n\\\\\\\\t- Growth of monthly-generated NEAR data\\\\\\\\n\\\\\\\\t- Pipeline optimizations applied by Aurora Labs team\\\\\\\\n\\\\\\\\n### Budget total\\\\\\\\n\\\\\\\\n$35,000 USD per quarter\\\\\\\\n\\\\\\\\n### Budget Breakdown\\\\\\\\n\\\\\\\\nS3 costs breakdown:\\\\\\\\n- Assuming that:\\\\\\\\n  - Pricing model is S3 Standard\\\\\\\\n    - Storage cost = 0,0245 USD/month/1GB\\\\\\\\n    - PUT cost = 0,0054 USD/1000 requests\\\\\\\\n    - LIST cost = 0,0054 USD/1000 requests\\\\\\\\n    - GET cost = 0,00043 USD/1000 requests\\\\\\\\n  - Every block is represented with 7 objects: 1 header + 6 chunks\\\\\\\\n  - Every object is written at most 3 times (failover replication)\\\\\\\\n    - Note: replication multiplier can be optimized with some effort\\\\\\\\n  - Readers are paying for themself\\\\\\\\n  - There\\\\\\\\u{2019}s 3 progression trackers per network (failover replication) that are reading continuously\\\\\\\\n    - Note: replication multiplier can be optimized with some effort\\\\\\\\n  - 6TB of data is written every month in average (during 1 year period)\\\\\\\\n- Storage cost:\\\\\\\\n  - Current storage: 40TB\\\\\\\\n  - Storage after 1 year: 40TB + 6TB * 12months = 112TB\\\\\\\\n  - Average (during 1 year) monthly storage: (40TB + 112TB) / 2 = 76TB\\\\\\\\n  - Average (during 1 year) monthly storage cost: 76TB * 1024 * 0.0245 USD/month/GB = 1907 USD\\\\\\\\n  - First year storage cost = 12 * 1907 USD = 22884 USD\\\\\\\\n- Blocks per year per network = 365 * 24 * 3600 / 1.2 = 26280000 blocks\\\\\\\\n- Objects per year per network = 26280000 blocks * 7 objects = 183960000 objects\\\\\\\\n- Write cost:\\\\\\\\n  - Writes cost per year per network per instance = 183960000 / 1000 * 0.0054 USD = 993 USD\\\\\\\\n  - Total writes cost per year = 1987 USD * 2 networks * 3 replicas = 5958 USD\\\\\\\\n- Read cost:\\\\\\\\n  - LIST requests per year per network per instance = 183960000 objects / 1000 = 183960 requests\\\\\\\\n  - LIST cost per year per network per instance = 183960 / 1000 * 0.0054 USD = 1 USD\\\\\\\\n  - GET cost per year per per network instance = 183960000 objects / 1000 * 0.00043 USD = 79 USD\\\\\\\\n  - Read cost per year per network per instance = 1 USD + 79 USD = 80 USD\\\\\\\\n  - Total read cost per year = 80 USD * 2 networks * 3 replicas = 480 USD\\\\\\\\n- Total S3 cost per year = 22884 USD + 5958 USD + 480 USD ~= $30k USD\\\\\\\\n\\\\\\\\nHardware costs:\\\\\\\\n- The optimal fit for one indexer is (for example) Hetzner AX52 with +2+2TB (raid-1) NVME SSD:\\\\\\\\n  - Monthly cost: 125 USD\\\\\\\\n  - Setup fee: 51 USD\\\\\\\\n  - Yearly cost: 51 + 125 * 12 = 1551 USD\\\\\\\\n- Total machines needed:\\\\\\\\n  - Indexers: 2 networks * 3 replicas = 6\\\\\\\\n  - Progression trackers/etc: collocated with other services on different machines, but is equivalent of 1 more machine\\\\\\\\n  - 7 machines in total\\\\\\\\n- Total cost per year: 7 machines * 1551 USD ~= $11k USD\\\\\\\\n\\\\\\\\nOperational overhead and safety margin:\\\\\\\\n- $8k / month ~= $96k / year\\\\\\\\n\\\\\\\\nTotal cost for the first year = $30k + $11k + $96k = ~$137k\\\\\\\\n\\\\\\\\nWe propose to structure the contract with quarterly payments: $35k/quarter\\\\\\\\n\", \"linked_proposals\": [], \"receiver_account\": \"aurorasupport.near\", \"requested_sponsor\": \"infrastructure-committee.near\", \"proposal_body_version\": \"V1\", \"requested_sponsorship_usd_amount\": \"35000\", \"requested_sponsorship_paid_in_currency\": \"USDC\"}, \"labels\": []}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.0860590790373e+21
    }
  },
  {
    "id": "9666264115",
    "receipt_id": "Anj7o7G4w9eLrSY8R2iMrksFbJiHsuD7AEHZvURmkcHX",
    "predecessor_account_id": "infrastructure-committee.near",
    "receiver_account_id": "social.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "6xPREpDhXQrSyZppfxmVDhAj6MrSKyQKMmbXCsGnBXny",
      "block_height": 131570132,
      "block_timestamp": 1730312352540892000
    },
    "receipt_outcome": {
      "gas_burnt": 3572438225909,
      "tokens_burnt": 357243822590900000000,
      "executor_account_id": "social.near",
      "status": true
    },
    "transaction_hash": "9FsfcNLT6JCrbqHswcHTRXQroArpwcPYyPfwrv28eAih",
    "included_in_block_hash": "89up5e9UotiZ9jxbGW97phwRTHyxFjNBVkFNfUvG2CtU",
    "block_timestamp": "1730312350004119851",
    "block": {
      "block_height": 131570130
    },
    "receipt_conversion_tokens_burnt": "63245181314500000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "set",
        "deposit": 0,
        "fee": 357243822590900000000,
        "args": "{\"data\": {\"infrastructure-committee.near\": {\"index\": {\"notify\": \"{\\\\\\\\\\\\\\\"key\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"strokov.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"value\\\\\\\\\\\\\\\":{\\\\\\\\\\\\\\\"type\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"proposal/edit\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"proposal\\\\\\\\\\\\\\\":28,\\\\\\\\\\\\\\\"widgetAccountId\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"infrastructure-committee.near\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\"notifier\\\\\\\\\\\\\\\":\\\\\\\\\\\\\\\"trechriron71.near\\\\\\\\\\\\\\\"}}\"}}}}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.0860590790373e+21
    }
  },
  {
    "id": "9666460236",
    "receipt_id": "82wKpMdCxXx2cuLYE1TeB653ZVn4qDUzz6STxtGDncnL",
    "predecessor_account_id": "trechriron71.near",
    "receiver_account_id": "infrastructure-committee.near",
    "receipt_kind": "ACTION",
    "receipt_block": {
      "block_hash": "7j1taQPjuqmSmrHT6zQ4nPsb67LvoMkzvTkqCVbnVxwq",
      "block_height": 131570513,
      "block_timestamp": 1730312824123131000
    },
    "receipt_outcome": {
      "gas_burnt": 11697265380535,
      "tokens_burnt": 1.1697265380535e+21,
      "executor_account_id": "infrastructure-committee.near",
      "status": true
    },
    "transaction_hash": "DPFwWJjf7oJLNiQeDjwG7V4MQJMThZjPaQhrxR4MrXRw",
    "included_in_block_hash": "HcEJdgZaeHG84hNYgK3rGt8ogC7TFJBzcbbSB6s7LiZ2",
    "block_timestamp": "1730312823065159900",
    "block": {
      "block_height": 131570512
    },
    "receipt_conversion_tokens_burnt": "87101343929000000000",
    "actions": [
      {
        "action": "FUNCTION_CALL",
        "method": "edit_proposal",
        "deposit": 0,
        "fee": 1.1697265380535e+21,
        "args": "{\"id\": 37, \"body\": {\"name\": \"NEAR Lake, Public Datasets and KitWallet Proposal by former Pagoda Data Team\", \"summary\": \"Two core developers on the Data Platform team propose to take over NEAR Lake, Public Datasets powering analytics, and KitWallet, on a 2-year contract. \", \"category\": \"Infrastructure Committee\", \"timeline\": {\"status\": \"REJECTED\", \"sponsor_requested_review\": false, \"reviewer_completed_attestation\": false}, \"linked_rfp\": 3, \"supervisor\": \"trechriron71.near\", \"description\": \"\\\\\\\\nThis is a combined proposal for the following RFPs: [NEAR Lake](https://dev.near.org/infrastructure-committee.near/widget/app?page=rfp&id=3), [BigQuery and Data Pipelines](https://dev.near.org/infrastructure-committee.near/widget/app?page=rfp&id=4) and [KitWallet](https://dev.near.org/infrastructure-committee.near/widget/app?page=rfp&id=1). \\\\\\\\n# Organization\\\\\\\\n\\\\\\\\n\\\\\\\\n### Primary person\\\\\\\\u{2019}s contact information\\\\\\\\n\\\\\\\\nPavel Kudinov \\\\\\\\u{2013} pavel@blocklake.io; Telegram @paulksg\\\\\\\\nWebsite: [https://www.blocklake.io/](https://www.blocklake.io/)\\\\\\\\n\\\\\\\\n\\\\\\\\n### Size of the whole team\\\\\\\\n\\\\\\\\nCurrently two people\\\\\\\\n\\\\\\\\n\\\\\\\\n### The size of the engineering team\\\\\\\\n\\\\\\\\nCurrently two people \\\\\\\\u{2013} Pavel Kudinov and Eduardo Ohe. We plan to engage DevOps/SRE on a contract when necessary.\\\\\\\\n\\\\\\\\n\\\\\\\\n### Team location\\\\\\\\n\\\\\\\\nVancouver, Canada\\\\\\\\n\\\\\\\\n\\\\\\\\n### Team background and bios\\\\\\\\n\\\\\\\\nFor the past ~2 years, we both have been the senior-most members of the Pagoda Data Team, working on NEAR Lake, Databricks Lakehouse powering NEAR Foundation analytics, BigQuery and Dune integration, as well as optimizing the performance of critical databases of EnhancedAPI, Explorer, and QueryAPI.\\\\\\\\n\\\\\\\\n**Eduardo Ohe** \\\\\\\\u{2013} Currently a staff engineer at the Pagoda team running data infra, including hands-on work on NEAR Lake, Databricks, Public Datasets/BigQuery/Dune integrations, and KitWallet. He shared and advocated for NEAR data solutions in the [Google tech blogs](https://cloud.google.com/blog/topics/partners/increasing-blockchain-accessibility-for-devops) and in the last [Databricks DATA+AI Summit](https://www.databricks.com/dataaisummit/session/sponsored-google-scale-your-databricks-workloads-15k-nodes-google-cloud) as a co-speaker. Over 28 years of experience with software engineering and big data, he has an MBA and a Bachelor of Computer Science that helped him to make bridges between business needs and tech solutions. He has experience as a CTO | Co-founder running his own BI/CRM company with +30 employees and successful exit. He also led data engineering projects for [petabyte-scale datasets at Twitter](https://blog.x.com/engineering/en_us/topics/infrastructure/2022/scaling-data-access-by-moving-an-exabyte-of-data-to-google-cloud) ensuring its [data quality/reliability.](https://blog.x.com/engineering/en_us/topics/infrastructure/2022/data-quality-automation-at-twitter) \\\\\\\\n\\\\\\\\n**Pavel Kudinov** \\\\\\\\u{2013} Currently a senior manager at the Pagoda team running data infra, including NEAR Lake. Over 18 years of experience in building Data Science products. More than 5 years serving in Director of Engineering or CTO-like roles, experience running private data consulting and creating startups from scratch.\\\\\\\\n\\\\\\\\n\\\\\\\\n# Professional Experience\\\\\\\\n\\\\\\\\n\\\\\\\\n### Examples of relevant experience with NEAR blockchain\\\\\\\\n\\\\\\\\n\\\\\\\\n\\\\\\\\n* NEAR Lake Primitives library, simplifying data extraction from NEAR Lake JSON files: [https://github.com/near/near-lake-framework-js/tree/main/packages/near-lake-primitives](https://github.com/near/near-lake-framework-js/tree/main/packages/near-lake-primitives) \\\\\\\\n* Databricks Lakehouse, powered by NEAR Lake: [https://github.com/near/near-public-lakehouse](https://github.com/near/near-public-lakehouse)\\\\\\\\n* BigQuery integration: [https://console.cloud.google.com/bigquery?p=bigquery-public-data&d=crypto_near_mainnet_us&page=dataset](https://console.cloud.google.com/bigquery?p=bigquery-public-data&d=crypto_near_mainnet_us&page=dataset)\\\\\\\\n* NEAR QueryAPI, powered by NEAR Lake: [https://github.com/near/queryapi](https://github.com/near/queryapi)\\\\\\\\n\\\\\\\\n\\\\\\\\n### Non-technical capabilities:\\\\\\\\n\\\\\\\\n\\\\\\\\n\\\\\\\\n* **Leadership.** Pavel has experience building and running product, data, and software engineering since 2008.\\\\\\\\n* **Data Consulting.** Both Eduardo and Pavel have experience running data consulting (data engineering and business intelligence) for small and big businesses in Brazil and Singapore.\\\\\\\\n* **Business Development**. we have experience working with B2B clients and establishing partnerships.\\\\\\\\n* **Project Management**. Pavel has experience running large-scale, multi-quarter projects across multiple teams involving data-intensive applications with high SLAs.\\\\\\\\n\\\\\\\\n\\\\\\\\n### In-House Resources;\\\\\\\\n\\\\\\\\n\\\\\\\\n\\\\\\\\n* Design, UX/UI\\\\\\\\n    * For this RFP, we don\\\\\\\\u{2019}t need Design or UX work. However, we have preliminary agreements with existing Pagoda designers to help with design work if necessary.\\\\\\\\n* Project management\\\\\\\\n    * Pavel Kudinov will be handling project management\\\\\\\\n* Customer support\\\\\\\\n    * Eduardo and Pavel will share handling customer support. Based on our experience so far, there are not many daily requests.\\\\\\\\n* BD / Marketing\\\\\\\\n    * Pavel and Eduardo have experience with BD and partnership management from our consulting experience. For Marketing, we will rely on external partners known in the NEAR ecosystem when required.\\\\\\\\n\\\\\\\\n\\\\\\\\n### Portfolio of relevant work\\\\\\\\n\\\\\\\\nFor this RFP, the most relevant is that we had been working with NEAR Lake for 2 years and significantly contributed to many tools running on top of it.\\\\\\\\n\\\\\\\\n\\\\\\\\n# Body\\\\\\\\n\\\\\\\\nBlockLake Inc will be focusing on the following:\\\\\\\\n\\\\\\\\n\\\\\\\\n\\\\\\\\n* raw blockchain data extraction, hosting, and serving;\\\\\\\\n* building data pipelines for analytics, powering Near Foundation, Dune and BigQuery;\\\\\\\\n* critical APIs for most popular and essential use cases, such as native and FT token balance history;\\\\\\\\n* consulting services for external clients;\\\\\\\\n* In the future, multichain indexing and APIs.\\\\\\\\n\\\\\\\\n\\\\\\\\n### The main approach and solution of the proposal\\\\\\\\n\\\\\\\\n\\\\\\\\n\\\\\\\\n1. Take over existing infrastructure for NEAR Lake: hosting NEAR Indexer nodes and the S3 bucket.\\\\\\\\n2. Utilize our expertise to build better and even cheaper access tools for people using NEAR Lake and offering it based on subscription:\\\\\\\\n    1. Block index to query only relevant blocks\\\\\\\\n    2. Block and transaction streaming through WebSockets and/or Webhooks\\\\\\\\n3. Take over critical data pipelines for integrating Dune (and maintaining ~$350k annual savings) and BigQuery.\\\\\\\\n\\\\\\\\n\\\\\\\\n### Why should the committee choose this project?\\\\\\\\n\\\\\\\\n\\\\\\\\n\\\\\\\\n1. The team behind this proposal has profound knowledge of the domain and technical architecture. Zero migration and onboarding costs.\\\\\\\\n2. Internal and External users rely on the high-quality datasets that we already built; other data sources are not as reliable. Data Analytics and AI use cases require high-quality data.\\\\\\\\n3. Dune\\\\\\\\u{2019}s proposal cost was reduced by 50% only because we did most of the work on the NEAR Lakehouse.\\\\\\\\n\\\\\\\\n\\\\\\\\n### Will this solution be open source? What licensing will be used?\\\\\\\\n\\\\\\\\nWe will keep the same open source license that NEAR GitHub repos have currently for all public goods code \\\\\\\\u{2013} the NEAR Lake, client libraries and data pipelines.\\\\\\\\n\\\\\\\\n\\\\\\\\n# Goals / Milestones\\\\\\\\n\\\\\\\\n\\\\\\\\n\\\\\\\\n* By February 2025\\\\\\\\n    * Incorporate the company, establish operations\\\\\\\\n    * Takeover existing Lake infrastructure as is with existing costs, ensuring non-disruptive transition of all existing clients\\\\\\\\n    * Replace Databricks with the cheaper alternative to empower Dune and BigQuery use-cases\\\\\\\\n* By July 2025\\\\\\\\n    * First revenue from consulting services and custom indexers\\\\\\\\n    * First revenue from NEAR Streams \\\\\\\\u{2013} a cheaper way to stream transactions to clients, reducing network costs and latency.\\\\\\\\n    * Reduction of infrastructure costs to run NEAR Lake (using dedicated servers)\\\\\\\\n* By December 2025\\\\\\\\n    * Expand the Lake for another blockchain(s)\\\\\\\\n\\\\\\\\n\\\\\\\\n# Service Level Agreements \\\\\\\\n\\\\\\\\n\\\\\\\\n### Support\\\\\\\\n\\\\\\\\n\\\\\\\\n\\\\\\\\n* **Support Availability**: Community-based support only (e.g., through forums, GitHub issues, or a developer community Slack/Telegram/Discord channel)\\\\\\\\n* **Response Time**: No guaranteed response time, but best-effort responses within 24-48 hours\\\\\\\\n* **No SLA Credits**: No financial credits or compensation for outages or performance issues to the users.\\\\\\\\n\\\\\\\\n\\\\\\\\n### Legal\\\\\\\\n\\\\\\\\n\\\\\\\\n\\\\\\\\n* **Terms & Conditions:** We will provide a clear T&C and Privacy Policy facilitating fair usage of services, following best practices.\\\\\\\\n* **Fair Use Policy**: Explicit statements about the intended use for development and the prohibition of production workloads\\\\\\\\n* **Termination Rights**: The right to suspend or terminate the service for users who exceed fair use or misuse the service. IC must be informed about these.\\\\\\\\n\\\\\\\\n\\\\\\\\n### Technical\\\\\\\\n\\\\\\\\n\\\\\\\\n\\\\\\\\n* **Availability**\\\\\\\\n    * **Uptime Guarantee**: 99.0% for Lake and 95% for Public Datasets monthly uptime \\\\\\\\n    * **Downtime Allowance**: Up to 1% for Lake and 5% for Public Datasets of downtime per month\\\\\\\\n* **Data freshness**:\\\\\\\\n    * NEAR Lake: 99% monthly SLA that the Lake is less than 5 blocks from the latest finalized block.\\\\\\\\n    * Public Datasets: 99% monthly SLA that all datasets are within 1 hour from the tip of the network.\\\\\\\\n* **Rate Limiting**:\\\\\\\\n    * As defined in the rate limit plan with gradual reductions for both Lake and public datasets\\\\\\\\n* **Rate Limit Enforcement**: Strict enforcement with immediate rate limit application once thresholds are reached for both Lake and public datasets\\\\\\\\n* **Updates and Changes**\\\\\\\\n* **Notice for Breaking Changes**: At least 7 days\\\\\\\\\\\\' notice for any breaking changes in the Lake services or infrastructure\\\\\\\\n\\\\\\\\n\\\\\\\\n# Usage & Examples\\\\\\\\n\\\\\\\\n\\\\\\\\n\\\\\\\\n* NEAR Lake is critical for the Ecosystem\\\\\\\\n    * NEAR Lake has 75 active users with ~103 blocks/second served on average\\\\\\\\n    * 2 Billion HTTP requests served monthly\\\\\\\\n* Public Dataset is critical for the Ecosystem\\\\\\\\n    * BigQuery is used by Nansen, SWEAT, NEAR NDC and others\\\\\\\\n    * Allows to save ~$350K on Dune integration annually\\\\\\\\n\\\\\\\\n\\\\\\\\n# Budget\\\\\\\\n\\\\\\\\n\\\\\\\\n### Budget Total\\\\\\\\n\\\\\\\\nWe ask for a budget for 2 years, with possible extension further upon review. The budget includes infrastructure growth costs, as we expect to put engineering effort to reduce them.\\\\\\\\n\\\\\\\\nProposed: **$327,500** / quarter\\\\\\\\n\\\\\\\\n\\\\\\\\n### Quarterly Budget Breakdown\\\\\\\\n\\\\\\\\n\\\\\\\\n<table>\\\\\\\\n  <tr>\\\\\\\\n   <td>Estimated Costs\\\\\\\\n   </td>\\\\\\\\n   <td>Proposed (USD) / Quarter\\\\\\\\n   </td>\\\\\\\\n  </tr>\\\\\\\\n  <tr>\\\\\\\\n   <td>Labour (Data Engineering, DevOps, SRE)\\\\\\\\n   </td>\\\\\\\\n   <td><p style=\\\\\\\\\\\\\\\"text-align: right\\\\\\\\\\\\\\\">\\\\\\\\n$225,000</p>\\\\\\\\n\\\\\\\\n   </td>\\\\\\\\n  </tr>\\\\\\\\n  <tr>\\\\\\\\n   <td>Lake Infra (Mainnet & Testnet)\\\\\\\\n   </td>\\\\\\\\n   <td><p style=\\\\\\\\\\\\\\\"text-align: right\\\\\\\\\\\\\\\">\\\\\\\\n$37,500</p>\\\\\\\\n\\\\\\\\n   </td>\\\\\\\\n  </tr>\\\\\\\\n  <tr>\\\\\\\\n   <td>Public Datasets Infra (Databricks, Dune, BQ, etc)\\\\\\\\n   </td>\\\\\\\\n   <td><p style=\\\\\\\\\\\\\\\"text-align: right\\\\\\\\\\\\\\\">\\\\\\\\n$25,000</p>\\\\\\\\n\\\\\\\\n   </td>\\\\\\\\n  </tr>\\\\\\\\n  <tr>\\\\\\\\n   <td>KitWallet Infra\\\\\\\\n   </td>\\\\\\\\n   <td><p style=\\\\\\\\\\\\\\\"text-align: right\\\\\\\\\\\\\\\">\\\\\\\\n$7,500</p>\\\\\\\\n\\\\\\\\n   </td>\\\\\\\\n  </tr>\\\\\\\\n  <tr>\\\\\\\\n   <td>SaaS subscriptions\\\\\\\\n   </td>\\\\\\\\n   <td><p style=\\\\\\\\\\\\\\\"text-align: right\\\\\\\\\\\\\\\">\\\\\\\\n$1,500</p>\\\\\\\\n\\\\\\\\n   </td>\\\\\\\\n  </tr>\\\\\\\\n  <tr>\\\\\\\\n   <td>Admin, Legal and Accounting\\\\\\\\n   </td>\\\\\\\\n   <td><p style=\\\\\\\\\\\\\\\"text-align: right\\\\\\\\\\\\\\\">\\\\\\\\n$6,000</p>\\\\\\\\n\\\\\\\\n   </td>\\\\\\\\n  </tr>\\\\\\\\n  <tr>\\\\\\\\n   <td>Customer Success, Documentation, Marketing\\\\\\\\n   </td>\\\\\\\\n   <td><p style=\\\\\\\\\\\\\\\"text-align: right\\\\\\\\\\\\\\\">\\\\\\\\n$25,000</p>\\\\\\\\n\\\\\\\\n   </td>\\\\\\\\n  </tr>\\\\\\\\n  <tr>\\\\\\\\n   <td>\\\\\\\\n   </td>\\\\\\\\n   <td><p style=\\\\\\\\\\\\\\\"text-align: right\\\\\\\\\\\\\\\">\\\\\\\\n<strong>$327,500 </strong></p>\\\\\\\\n\\\\\\\\n   </td>\\\\\\\\n  </tr>\\\\\\\\n</table>\\\\\\\\n\\\\\\\\n\\\\\\\\nWe are happy to discuss the Fiat/$NEAR ratio for labor costs, up to 50% of $NEAR. The payment for both Fiat and $NEAR should be prepaid for every 3 months.\\\\\\\\n\", \"linked_proposals\": [], \"receiver_account\": \"nearpavel.near\", \"requested_sponsor\": \"infrastructure-committee.near\", \"proposal_body_version\": \"V1\", \"requested_sponsorship_usd_amount\": \"327500\", \"requested_sponsorship_paid_in_currency\": \"USDC\"}, \"labels\": []}"
      }
    ],
    "actions_agg": {
      "deposit": 0
    },
    "outcomes": {
      "status": true
    },
    "outcomes_agg": {
      "transaction_fee": 1.6085943452746e+21
    }
  }
]